Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/Inspections/InspectionResults.*.resx
Languages: cs, de, es, fr, it

# ObsoleteCallingConventionInspection
source: '{0}' is declared using the obsolete 'CDecl' calling convention.
cs: '{0}' je deklarováno zastaralou 'CDecl' volací konvencí.
de: '{0}' wurde mit der unter Windows nicht erlaubten 'CDecl'-Aufrufkonvention deklariert.
es: '{0}' se declara usando la convención de llamada obsoleta 'CDecl'.
fr: '{0}' est déclarée avec la convention d'appel 'CDecl'.
it: {0} viene dichiarato utilizzando la convenzione di chiamata obsoleta 'CDecl'.

# DuplicatedAnnotationInspection
source: Annotation '{0}' is duplicated.
cs: Anotace '{0}' je duplikována.
de: Annotation '{0}' wurde mehrfach spezifiziert.
es: La anotación '{0}' está duplicada.
fr: L'annotation '{0}' est dupliquée.
it: L'annotazione '{0}' è duplicata.

# ModuleWithoutFolderInspection
source: Module '{0}' has no '@Folder' annotation.
cs: Modul '{0}' nemá '@Folder' anotaci.
de: Das Modul '{0}' hat keine '@Folder'-Annotation.
es: El módulo '{0}' no tiene una anotación '@Folder'.
fr: Le module '{0}' n'a pas d'annotation '@Folder'.
it: Il modulo '{0}' non ha annotazioni '@Folder'.

# OnLocalErrorInspection
source: 'On Local Error' statement detected.
cs: 'On Local Error' statement detekován.
de: 'On Local Error'-Direktive erkannt.
es: Se detectó una declaración 'On Local Error'.
fr: Instruction 'On Local Error' détectée.
it: Rilevata l'istruzione 'On Local Error'.

# IsMissingOnInappropriateArgumentInspection
source: 'IsMissing' will always return false with the passed argument.
cs: 'IsMissing' bude s předanými argumenty pokaždé vracet false.
de: 'IsMissing' wird mit dem übergebenen Argument immer 'False' zurückliefern.
es: 'IsMissing' siempre devolverá false con el argumento pasado.
fr: 'IsMissing' sera toujours 'False' avec ce paramètre.
it: 'IsMissing' restituirà sempre false con l'argomento passato.

# IsMissingWithNonArgumentParameterInspection
source: 'IsMissing' is passed an expression that is not an argument to the enclosing procedure.
cs: 'IsMissing' je předáno jako výraz, který není argumentem uzavírající procedury.
de: 'IsMissing' wird ein Ausdruck übergeben, der kein Argument der umgebenden Prozedur ist.
es: 'IsMissing' se pasa una expresión que no es un argumento para el procedimiento que la contiene.
fr: 'IsMissing' reçoit une expression qui n'est pas l'un des paramètres de la procédure.
it: A 'IsMissing' viene passata un'espressione che non è un argomento per la procedura che lo contiene.

# AssignmentNotUsedInspection
source: An assignment is immediately overridden by another assignment or is never referenced.
cs: Přiřazení je okamžitě přepsáno jiným přiřazením, nebo není nikdy použito.
de: Eine Zuweisung wird sofort überschrieben oder nie gelesen.
es: Una asignación es anulada inmediatamente por otra asignación o nunca se hace referencia.
fr: Une assignation est écrasée par une assignation subséquente, ou la valeur assignée n'est jamais utilisée.
it: Un'assegnazione è immediatamente sovrascritta da un'altra assegnazione o non è mai referenziata.

# UnderscoreInPublicClassModuleMemberInspection
source: Public member name '{0}' contains an underscore.
cs: Veřejné jméno členu '{0}' obsahuje podtržítko.
de: Der öffentliche Membername '{0}' enthält einen Unterstrich.
es: El nombre de miembro público '{0}' contiene un guión bajo.
fr: Le nom du membre public '{0}' contient un caractère de soulignement.
it: Il nome del membro pubblico '{0}' contiene un trattino basso.

# ExcelMemberMayReturnNothingInspection
source: Result of '{0}' call is not tested for 'Nothing'.
cs: Výsledek '{0}' není testovaný pro 'Nothing'.
de: Das Ergebnis des Aufrufs von '{0}' wird nie auf 'Nothing' überprüft.
es: El resultado de la llamada '{0}' no se prueba para 'Nothing'.
fr: Le résultat de l'appel à '{0}' n'est pas testé pour 'Nothing'.
it: Il risultato della chiamata '{0}' non è stato testato per 'Nothing'.

# ExcelUdfNameIsValidCellReferenceInspection
source: '{0}' is hidden by a valid Excel cell reference.
cs: '{0}' je skryta(o) validní Excelovskou referencí na buňku.
de: '{0}' wird von einem EXCEL-Zellverweis verdeckt.
es: '{0}' está oculto por una referencia de celda de Excel válida.
fr: '{0}' est cachée par une référence à une cellule valide.
it: '{0}' è nascosto da un riferimento di cella Excel valido.

# AttributeValueOutOfSyncInspection
source: The attribute value(s) for attribute {0} ({1}) are out of sync with the {2} annotation.
cs: Hodnota(y) atributu pro atribut {0} ({1}) jsou nesynchronizovány s anotací {2}.
de: Die Wert(e) des {0}-Attributs ({1}) passen nicht zur {2}-Annotation.
es: Los valores de atributo para el atributo {0} ({1}) no están sincronizados con la anotación {2}.
fr: La valeur de l'attribut {0} ({1}) est désynchronisée avec l'annotation {2}.
it: I valori dell'attributo {0} ({1}) non sono sincronizzati con l'annotazione {2}.

# MissingMemberAnnotationInspection
source: Member '{0}' has a '{1}' attribute with value(s) '{2}', but no corresponding annotation.
cs: Člen '{0}' má '{1}' atribut s hodnotou/hodnotami '{2}', avšak chybí odpovídající anotace.
de: Element '{0}' hat ein '{1}' Attribut mit Wert(en) '{2}', aber keine zugehörige Annotation.
es: El miembro '{0}' tiene un atributo '{1}' con valor(es) '{2}', pero no tiene la anotación correspondiente.
fr: Le membre '{0}' a un attribut '{1}' avec la/les valeur(s) '{2}', mais aucune annotation correspondante.
it: Il membro '{0}' ha un attributo '{1}' con i valori '{2}', ma nessuna annotazione corrispondente.

# MissingModuleAnnotationInspection
source: Module '{0}' has a '{1}' attribute with value(s) '{2}', but no corresponding annotation.
cs: Modul '{0}' má '{1}' atribut s hodnotou/hodnotami '{2}', avšak chybí odpovídající anotace.
de: Modul '{0}' hat ein '{1}' Attribut mit Wert(en) '{2}', aber keine zugehörige Annotation.
es: El módulo '{0}' tiene un atributo '{1}' con valor (es) '{2}', pero no tiene la anotación correspondiente.
fr: Le module '{0}' a l'attribut '{1}' avec la/les valeur(s) '{2}', mais aucune annotation correspondante.
it: Il modulo '{0}' ha un attributo '{1}' con i valori '{2}', ma nessuna annotazione corrispondente.

# KeywordsUsedAsMemberInspection
source: Keyword used as an identifier for the member '{0}'.
cs: Klíčové slovo použito jako identifikátor člena '{0}'.
de: Der Name des Elements '{0}' ist ein Schlüsselwort.
es: Palabra reservada usada como identificador para el miembro '{0}'.
fr: Le nom du membre '{0}' est un mot-clé.
it: Parola chiave utilizzata come identificatore per il membro '{0}'.

# LineContinuationBetweenKeywordsInspection
source: Line continuation(s) in unexpected places.
cs: Pokračování řádku(ů) na neočekávaných místech.
de: Zeilenfortsetzungszeichen an unerwarteten Orten.
es: Continuación de línea en lugares inesperados.
fr: Marqueur(s) de continuation inattendu.
it: Continuazione/i di riga in punti inaspettati.

# NonBreakingSpaceIdentifierInspection
source: Non-breaking space encountered in identifier '{0}'.
cs: Pevná mezera v identifikátoru '{0}'.
de: Der Bezeichner '{0}' enthält ein geschütztes Leerzeichen.
es: Se han encontrado espacios NBSP en el identificador '{0}'.
fr: L'identifiant '{0}' comporte un espace insécable.
it: Spazio non di separazione rilevato nell'identificatore '{0}'.

# ThunderCode_Base
source: {0} Andrew "ThunderFrame" Jackson would be proud! You're seeing this inspection result because there's no way that's real code and you're just pushing the limits of Rubberduck's parsing and resolving capabilities, right? ...RIGHT? In memoriam, 1972-2018
cs: {0} Andrew "ThunderFrame" Jackson by byl pyšný! Výsledek této inspekce vidíte, protože neexistuje žádná šance, je toto reálný kód a zkoušíte hranice možností, co ještě RubberDuck analýza zmákne, než selže. ...ŽE? In memoriam, 1972-2018
de: {0} Andrew "ThunderFrame" Jackson wäre stolz! Sie sehen dies, da es nicht sein kann, dass dies ein echtes Programm ist. Sie versuchen lediglich Rubberducks Grenzen auszuloten, oder? ..ODER? In Memoriam, 1972-2018
es: {0} Andrew "ThunderFrame" Jackson estaría orgulloso! Estás viendo el resultado de esta inspección porque no hay forma de que sea un código real y solo estás superando los límites de las capacidades de análisis y resolución de Rubberduck, ¿verdad? ...¿CORRECTO? En memoria, 1972-2018
fr: {0} Andrew "ThunderFrame" Jackson serait fier! Vous voyez ce résultat d'inspection parce qu'il n'y a aucune raison que ce soit du vrai code et que vous tentez simplement de pousser les limites des capacités d'analyse de Rubberduck... n'est-ce pas? N'EST-CE PAS? In memoriam, 1972-2018
it: {0} Andrew "ThunderFrame" Jackson sarebbe orgoglioso! Stai vedendo questo risultato dell'ispezione perché non è possibile che sia codice reale e stai solo spingendo i limiti delle capacità di analisi e risoluzione di Rubberduck, giusto? ...GIUSTO? In memoriam, 1972-2018

# NegativeLineNumberInspection
source: Negative line number encountered
cs: Bylo zjištěno záporné číslo řádku
de: Verwendung einer negativen Zeilennummer
es: Número de línea negativo encontrado
fr: Utilisation d'un numéro de ligne négatif
it: Sono stati trovati numeri di riga negativi

# OnErrorGoToMinusOneInspection
source: On Error GoTo -1 encountered
cs: Došlo k chybě: 'On Error GoTo -1'
de: Verwendung von 'On Error GoTo -1'
es: En error GoTo -1 encontrado
fr: Utilisation de 'On Error GoTo -1'
it: Rilevato On Error GoTo -1

# ObsoleteWhileWendStatementInspection
source: 'While...Wend' conditional loop can be written as a 'Do While...Loop' block.
cs: Bloková odmínka 'While...Wend' může být napsána jako 'Do While...Loop'.
de: 'While...Wend'-Schleife kann als 'Do While...Loop'-Block formuliert werden.
es: El bucle condicional 'While...Wend' puede ser escrito como un bloque 'Do While...Loop'.
fr: La boucle conditionelle 'While...Wend' pourrait être 'Do While...Loop'.
it: Il ciclo condizionale 'While ... Wend' può essere scritto come un blocco 'Do While ... Loop'.

# SetAssignmentWithIncompatibleObjectTypeInspection
source: To the variable '{0}' of declared type '{1}' a value is set assigned with the incompatible declared type '{2}'.
cs: Proměnné '{0}' deklarovaného typu '{1}' je přiřazena hodnota nekompatibilního deklarovaného typu '{2}'.
de: Der Variablen '{0}' vom deklarierten Typ '{1}' wird eine Wert des inkompatiblen Typs '{2}' Set-zugewiesen.
es: Se asignó un valor a la variable '{0}' del tipo declarado '{1}' con el tipo declarado '{2}' incompatible.
fr: Une référence de type '{2}' est assignée ('Set') à la variable '{0}' du type déclaré '{1}', incompatible.
it: Alla variabile '{0}' di tipo dichiarato '{1}' viene impostato un valore assegnato con il tipo dichiarato incompatibile '{2}'.

# ArgumentWithIncompatibleObjectTypeInspection
source: The argument '{2}' of type '{3}' is passed to the parameter '{0}' of the incompatible type '{1}'.
cs: Argument '{2}' typu '{3}' je předán parametru '{0}' jako nekompatibilní typ '{1}'.
de: Das Argument '{2}' vom Typ '{3}' wird für den Parameter '{0}' vom inkompatiblen Typ '{1}' übergeben.
es: El argumento '{2}' de tipo '{3}' se pasó al parámetro '{0}' de tipo '{1}' (incompatible).
fr: L'argument '{2}', de type '{3}', est passé au paramètre '{0}', du type incompatible '{1}'.
it: L'argomento '{2}' di tipo '{3} viene passato al parametro '{0}' di tipo incompatibile '{1}'.

# EmptyMethodInspection
source: {0} '{1}' contains no executable statements.
cs: {0} '{1}' neobsahuje žádné spustitelné příkazy.
de: {0} '{1}' enthält keine ausführbaren Anweisungen.
es: {0} '{1}' no contiene sentencias ejecutables.
fr: {0} '{1}' ne contient aucune instruction exécutable.
it: {0} '{1}' non contiene istruzioni eseguibili.

# ImplementedInterfaceMemberInspection
source: Interface class module '{2}' contains a concrete implementation for {0} '{1}'.
cs: Modul třídy rozhraní '{2}' obsahuje konkrétní implementaci pro {0} '{1}'.
de: Die Interface-Klasse '{2}' enthält eine Implementierung für die {0} '{1}'.
es: El módulo de clase Interfaz '{2}' contiene una implementación concreta para {0} '{1}'.
fr: L'interface abstraite définie par '{2}' contient une implémentation concrète pour {0} '{1}'.
it: Il modulo di classe dell'interfaccia '{2}' contiene un'implementazione concreta per {0} '{1}'.

# ValueRequiredInspection
source: In a context that requires a value type, the expression '{0}' of object type '{1}' is used that does not have a suitable default member.
cs: V kontextu, který vyžaduje typ 'hodnota', je použit výraz '{0}' typu objekt '{1}', který nemá vhodný výchozí člen.
de: An einer Stelle, die einen Wert verlangt, wird der Ausdruck '{0}' vom Objekttyp '{1}' verwendet, der keinen passendes Standardelement hat.
es: En un contexto que requiere un tipo de valor, la expresión '{0}' de tipo '{1}' no tiene un miembro default adecuado.
fr: Dans un contexte qui requiert une valeur (ex. [Let] foo = x), l'expression '{0}' renvoie un objet de type '{1}', qui n'a pas de membre par défaut pouvant renvoyer la valeur attendue.
it: In un contesto che richiede un tipo di valore, viene utilizzata l'espressione '{0}' del tipo di oggetto '{1}' che non dispone di un membro predefinito appropriato.

# ProcedureRequiredInspection
source: In a context that requires a procedure, the expression '{0}' of object type '{1}' is used that does not have a suitable default member.
cs: V kontextu, který vyžaduje 'proceduru', je použit výraz '{0}' typu objekt '{1}', který nemá vhodný výchozí člen.
de: An einer Stelle, die eine Prozedur erfordert, wird der Ausdruck '{0}' vom Objekttyp '{1}' verwendet, der keinen passendes Standardelement hat.
es: En un contexto que requiere un procedimiento, la expresión '{0}' de tipo '{1}' no tiene un miembro default adecuado.
fr: Dans un contexte qui requiert un appel de procédure, l'expression '{0}' renvoie un objet de type '{1}', qui n'a pas de membre par défaut pouvant rendre cette instruction légale.
it: In un contesto che richiede una procedura, è utilizzata l'espressione '{0}' del tipo di oggetto '{1}' che non dispone di un membro predefinito appropriato.

# DefaultMemberRequiredInspection
source: The expression '{0}' requires a default member access, but the type '{1}' does not have a suitable default member.
cs: Výraz '{0}' vyžaduje výchozí členský přístup, avšak typ '{1}' nemá vhodný výchozí člen.
de: Der Ausdruck '{0}' erfordert einen Standardelementzugriff, aber der Typ '{1}' hat kein passendes Standardelement.
es: La expresión '{0}' requiere un acceso a miembro default, pero el tipo '{1}' no tiene un miembro default adecuado.
fr: L'expression '{0}' comporte un appel d'un membre par défaut, mais le type ('{1}') n'a pas de membre par défaut compatible.
it: L'espressione '{0}' richiede un membro di accesso predefinito, ma il tipo '{1}' non dispone di un membro predefinito appropriato.

# UseOfBangNotationInspection
source: The expression '{0}' uses bang notation.
cs: Výraz '{0}' používá 'bang' notaci.
de: Der Ausdruck '{0}' verwendet Ausrufezeichennotation.
es: La expresión '{0}' usa notación Bang.
fr: L'expression '{0}' implique une liaison tardive.
it: L'espressione '{0}' utilizza la notazione con il punto esclamativo.

# UseOfRecursiveBangNotationInspection
source: The expression '{0}' uses a recursive bang operator.
cs: Výraz '{0}' používá rekurzivní 'bang' operátor.
de: Der Ausdruck '{0}' verwendet rekursive Ausrufezeichennotation.
es: La expresión '{0}' usa un operador Bang recursivo.
fr: L'expression '{0}' implique une liaison tardive... dont la résolution est récursive.
it: L'espressione '{0}' utilizza un operatore bang ricorsivo.

# UseOfUnboundBangNotationInspection
source: The expression '{0}' uses an unbound bang operator.
cs: Výraz '{0}' používá 'unbound bang' operátor.
de: Der Ausdruck '{0}' verwendet nicht gebundene Ausrufezeichennotation.
es: La expresión '{0}' usa un operador Bang sin vincular.
fr: L'expression '{0}' implique une liaison tardive.
it: L'espressione '{0}' utilizza un operatore bang non associato.

# ObjectWhereProcedureIsRequiredInspection
source: The expression '{0}' is used in a context that requires a procedure, which leads to a call to the default member '{1}'.
cs: Výraz '{0}' je použit v kontextu, který požaduje 'proceduru', což vede k volání výchozího člena '{1}'.
de: Der Ausdruck '{0}' wird an einer Stelle verwendet, die nach einer Prozedur verlangt, was zu einem Aufruf des Standardelements '{1}' führt.
es: La expresión '{0}' se usa en un contexto que requiere un procedimiento, lo cual conduce a una llamada al miembro default '{1}'.
fr: L'expression '{0}' est utilisée dans un contexte qui demande un appel de procédure: le membre par défaut '{1}' est appelé implicitement.
it: L'espressione '{0}' viene utilizzata in un contesto che richiede una procedura, che porta a una chiamata al membro predefinito '{1}'.

# ObjectWhereProcedureIsRequiredInspection_Unbound
source: The expression '{0}' is used in a context that requires a procedure, which leads to a call to a default member that cannot be determined at compile time.
cs: Výraz '{0}' je použit v kontextu, který požaduje 'proceduru', což vede k volání výchozího člena, kterého nelze určit při kompilaci.
de: Der Ausdruck '{0}' wird an einer Stelle verwendet, die nach einer Prozedur verlangt, was zu einem Aufruf eines Standardelements führt, welcher erst zur Laufzeit bestimmt werden kann.
es: La expresión '{0}' se usa en un contexto que requiere un procedimiento, lo cual conduce a una llamada a un miembro default que no se puede determinar en tiempo de compilación.
fr: L'expression '{0}' est utilisée dans un contexte qui demande un appel de procédure: le membre par défaut qui sera appelé implicitement ne sera résolu/lié qu'au moment de l'exécution.
it: L'espressione '{0}' viene utilizzata in un contesto che richiede una procedura, che porta a una chiamata a un membro predefinito che non può essere determinato in fase di compilazione.

# IndexedDefaultMemberAccessInspection
source: The expression '{0}' contains an indexed default member access to '{1}'.
cs: Výraz '{0}' obsahuje přístup indexovaného výchozího člena k '{1}'.
de: Der Ausdruck '{0}' enthält einen parametrisierten Zugriff auf das Standardelement '{1}'.
es: La expresión '{0}' contiene un acceso a miembro default indexado a '{1}'.
fr: L'expression '{0}' contient un appel indexé au membre par défaut '{1}'.
it: L'espressione '{0}' contiene un accesso indicizzato al membro predefinito a '{1}'.

# IndexedRecursiveDefaultMemberAccessInspection
source: The expression '{0}' contains an indexed recursive default member access to '{1}'.
cs: Výraz '{0}' obsahuje přístup indexovaného rekurzivního výchozího člena k '{1}'.
de: Der Ausdruck '{0}' enthält einen parametrisierten rekursiven Standardelementzugriff auf '{1}'.
es: La expresión '{0}' contiene un acceso a miembro default indexado recursivo a '{1}'.
fr: L'expression '{0}' contient un appel indexé récursif au membre par défaut '{1}'.
it: L'espressione '{0}' contiene un accesso ricorsivo indicizzato al membro predefinito a '{1}'.

# IndexedUnboundDefaultMemberAccessInspection
source: The expression '{0}' contains an indexed unbound default member access.
cs: Výraz '{0}' obsahuje přístup indexovaného nevázaného výchozího člena.
de: Der Ausdruck '{0}' enthält einen parametrisierten nicht gebundenen Standardelementzugriff.
es: La expresión '{0}' contiene un acceso a miembro default indexado sin vincular.
fr: L'expression '{0}' contient un appel indexé sans liaison d'un membre par défaut.
it: L'espressione '{0}' contiene un accesso indicizzato non associato al membro predefinito.

# ImplicitDefaultMemberAccessInspection
source: On the expression '{0}', there is an implicit default member access to '{1}'.
cs: Ve výrazu '{0}' existuje implicitní přístup k výchozímu členu '{1}'.
de: Für den Ausdruck '{0}' kommt es zu einem impliziten Zugriff auf das Standardelement '{1}'.
es: En la expresión '{0}' hay un acceso a miembro default implícito a '{1}'.
fr: L'expression '{0}' comporte un appel implicite au membre par défaut '{1}'.
it: Nell'espressione '{0}' è presente un accesso implicito al membro predefinito a '{1}'.

# ImplicitRecursiveDefaultMemberAccessInspection
source: On the expression '{0}', there is an implicit recursive default member access to '{1}'.
cs: Ve výrazu '{0}' existuje implicitní rekurzivní výchozí členský přístup k '{1}'.
de: Für den Ausdruck '{0}' kommt es zu einem impliziten rekursiven Standardelementzugriff auf '{1}'.
es: En la expresión '{0}' hay un acceso a miembro default implícito recursivo a '{1}'.
fr: L'expression '{0}' comporte un appel implicite au membre par défaut '{1}'.
it: Nell'espressione '{0}' è presente un accesso ricorsivo implicito al membro predefinito a '{1}'.

# ImplicitUnboundDefaultMemberAccessInspection
source: On the expression '{0}', there is an implicit unbound default member access.
cs: Ve výrazu '{0}' existuje implicitní rekurzivní výchozí členský přístup.
de: Für den Ausdruck '{0}' kommt es zu einem impliziten nicht gebundenen Standardelementzugriff.
es: En la expresión '{0}' hay un acceso a miembro default implícito sin vincular.
fr: L'expression '{0}' comporte un appel implicite sans lisaison à un membre par défaut.
it: Nell'espressione '{0}' è presente un accesso implicito non associato al membro predefinito.

# SuspiciousLetAssignmentInspection
source: There is an assignment from the default member of the result of expression '{1}' to that of the expression '{0}'.
cs: Od výchozího člena je přirazen výsledek výrazu '{1}' k výrazu '{0}'.
de: Es wird vom Standardmember des Resultats des Ausdrucks '{1}' dem des Resultats des Ausdrucks '{0}' zugewiesen.
es: Hay una asignación desde el miembro default del resultado de la expresión '{1}' al miembro default de la expresión '{0}'.
fr: Le résultat de l'expression '{1}' est assigné à celui de l'expression '{0}'.
it: Esiste un'assegnazione dal membro predefinito del risultato dell'espressione '{1}' a quello dell'espressione '{0}'.

# UnreachableCaseInspection
source: Case clause '{0}' cannot be reached.
cs: Nelze dosáhnout klauzule '{0}'.
de: Der Case-Zweig '{0}' kann niemals erreicht werden.
es: No se puede acceder a la cláusula '{0}' del Case.
fr: Le bloc sous la condition '{0}' est inatteignable.
it: La clausola Case '{0}' non può essere mai raggiunta.

# UnreachableCaseInspection_CaseElse
source: 'Case Else' statement is unreachable.
cs: Výraz 'Case Else' je nedosažitelný.
de: Der 'Case Else'-Zweig kann niemals erreicht werden.
es: La sentencia 'Case Else' es inaccesible.
fr: Le bloc 'Case Else' est inatteignable.
it: L'istruzione "Case Else" è irraggiungibile.

# UnreachableCaseInspection_TypeMismatch
source: 'Case' statement will cause run-time error 13 (type mismatch).
cs: Výraz 'Case' způsobí za běhu programu chybu 13 (neshoda typu).
de: Der Case-Ausdruck wird einen Laufzeitfehler 13 (Typkonflikt) verursachen.
es: La sentencia 'Case' ocasionará un error en tiempo de ejecución 13 (type mismatch).
fr: L'expression du bloc 'Case' causera une erreur d'exécution 13 (type mismatch).
it: L'istruzione 'Case' causerà l'errore 13 di runtime (tipo non corrispondente).

# UnreachableCaseInspection_Overflow
source: 'Case' statement will cause run-time error 6 (Overflow).
cs: Výraz 'Case' způsobí za běhu programu chybu 6 (Přetečení).
de: Der Case-Ausdruck wird den Laufzeitfehler 6 (Überlauf) verursachen.
es: La sentencia 'Case' ocasionará un error en tiempo de ejecución 6 (Overflow).
fr: L'expression du bloc 'Case' causera une erreur d'exécution 6 (overflow).
it: L'istruzione 'Case' causerà l'errore di runtime 6 (Overflow).

# UnreachableCaseInspection_Unreachable
source: 'Case' statement is unreachable.
cs: Výraz 'Case' je nedosažitelný.
de: Der Case-Ausdruck kann niemals erreicht werden.
es: La sentencia 'Case' es inaccesible.
fr: Le bloc 'Case' est inatteignable.
it: L'istruzione 'Case' è irraggiungibile.
