Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/Inspections/InspectionNames.*.resx
Languages: cs, de, es, fr, it

# RedundantOptionInspection
source: Redundant module option
cs: Nadbytečná možnost v modulu
de: Redundante Moduloption
es: Opción de módulo redundante
fr: Option de module redondante
it: Opzione modulo ridondante

# SelfAssignedDeclarationInspection
source: Object variable reference is auto-instantiated.
cs: Reference k objektu proměnné je automaticky instancovaná.
de: Objektvariable ist selbstzugewiesen.
es: La referencia de la variable de objeto es una instancia automática.
fr: La variable objet est assignée lors de sa déclaration.
it: Il riferimento alla variabile oggetto viene istanziato automaticamente.

# SetAssignmentWithIncompatibleObjectTypeInspection
source: Set assignment with incompatible object type
cs: Nastaveno přiřazení s nekompatibilním typem objektu
de: Set-Zuweisung mit nicht kompatiblem Objekttyp
es: Asignación Set con objeto de tipo incompatible
fr: Assignation 'Set' à un type d'objet incompatible
it: Assegnazione con tipo di oggetto incompatibile

# ShadowedDeclarationInspection
source: Shadowed declaration
cs: Stínová deklarace
de: Überschattete Deklaration
es: Declaración ambigua en distintos ámbitos
fr: Déclaration cachée
it: Dichiarazione oscurata

# SheetAccessedUsingStringInspection
source: Statically accessible sheet accessed using string
cs: Staticky přístupný sešit přístupný pomocí řetězce
es: Se accede a la hoja estáticamente usando una cadena
fr: Une feuille Excel accessible statiquement est référencée par une chaîne de caractères
it: Accesso usando una stringa ad un foglio accessibile staticamente

# StepIsNotSpecifiedInspection
source: 'For...Next' loop step is not specified
cs: U smyčky 'For...Next' není specifikován 'Step'
de: 'Step' in 'For...Next'-Schleife ist nicht angegeben
es: No se especifica incremento del bucle 'For...Next'
fr: Clause 'Step' implicite
it: Passo del ciclo 'For...Next' non specificato

# StepOneIsRedundantInspection
source: 'For...Next' loop step 1 is redundant
cs: U smyčky 'For...Next' není třeba specifikovat 'Step 1'
de: 'Step 1' ist in 'For...Next'-Schleife redundant
es: El incremento 1 en el bucle 'For...Next' es redundante
fr: Clause 'Step' redondante
it: Il passo 1 del ciclo 'For...Next' è ridondante

# StopKeywordInspection
source: 'Stop' keyword
cs: Klíčové slovo 'Stop'
de: 'Stop'-Schlüsselwort
es: Palabra reservada 'Stop'
fr: Mot-clé 'Stop'
it: Parola chiave 'Stop'

# SuperfluousAnnotationArgumentInspection
source: Superfluous annotation arguments
cs: Přebytečné argumenty anotace
de: Überflüssige Annotationsargumente
es: Argumentos de anotaciones sobrantes
fr: Arguments d'annotation superflus
it: Argomenti di annotazione superflui

# SuspiciousLetAssignmentInspection
source: Suspicious Let assignment
cs: Podezřelé přiřazení 'Let'
de: Verdächtige Let-Zuweisung
es: Asignación Let dudosa
fr: Assignation 'Let' suspecte
it: Assegnazione con Let sospetta

# UnassignedVariableUsageInspection
source: Variable is used but not assigned.
cs: Proměnná je použita, avšak není přiřazena.
de: Variable wird genutzt ohne das ihr ein Wert zugewiesen wurde.
es: La variable se usa pero no se asigna.
fr: La variable est utilisée, mais non assignée.
it: Variabile usata ma non assegnata.

# UndeclaredVariableInspection
source: Undeclared variable
cs: Nedeklarovaná proměnná
de: Nicht deklarierte Variable
es: Variable no declarada
fr: Variable non déclarée
it: Variabile non dichiarata

# UnderscoreInPublicClassModuleMemberInspection
source: Underscore in public class module member
cs: Podtržítko ve členu modulu veřejné třídy
de: Unterstrich im Namen eines öffentlichen Elements
es: Guión bajo en miembro de módulo de clase pública
fr: Caractère de soulignement dans le nom d'un membre d'un module de classe
it: Trattino basso nel membro pubblico di un modulo di classe

# UnhandledOnErrorResumeNextInspection
source: Unhandled 'On Error Resume Next'
cs: Neošetřený 'On Error Resume Next'
de: Unbehandeltes 'On Error Resume Next'
es: No manejado 'On Error Resume Next'
fr: Suppression d'erreurs
it: 'On Error Resume Next' non gestito

# UnreachableCaseInspection
source: Case Clause(s) cannot be reached.
cs: Klauzule případů nelze dosáhnout.
de: Case-Klausel(n) nicht erreichbar.
es: No se puede acceder a la(s) cláusula(s) del Case.
fr: Bloc 'Case' inatteignable.
it: Clausola/e Case non raggiungibile.

# UntypedFunctionUsageInspection
source: Use of variant-returning string function
cs: Použití řetězcové funkce, která vrací 'Variant'
de: Verwendung einer 'Variant' zurückgebenden String-Funktion
es: Utiliza una función de string que devuelve 'Variant'
fr: Utilisation d'une fonction retournant une 'String' dans une variable 'Variant'
it: Uso di una funzione stringa che restituisce Variant

# UseMeaningfulNameInspection
source: Use meaningful names
cs: Použij smysluplné názvy
de: Aussagekräftige Namen nutzen
es: Usar nombres significativos
fr: Utilisez un nom significatif
it: Usa nomi significativi

# UseOfBangNotationInspection
source: Use of bang notation
cs: Použití vykřičníkové notace
de: Verwendung der Ausrufezeichennotation
es: Uso de notación Bang
fr: Utilisation de la notation "bang" (!)
it: Uso della notazione con il punto esclamativo

# UseOfRecursiveBangNotationInspection
source: Use of recursive bang notation
cs: Použití rekurzivní vykřičníkové notace
de: Verwendung rekursiver Ausrufezeichennotation
es: Uso de notación Bang recursiva
fr: Utilisation récursive de la notation "bang" (!)
it: Uso della notazione con il punto esclamativo ricorsiva

# UseOfUnboundBangNotationInspection
source: Use of unbound bang notation
cs: Použití nezávazné vykřičníkové notace
de: Verwendung nicht gebundener Ausrufezeichennotation
es: Uso de notación Bang sin vincular
fr: Utilisation sans liaison de la notation "bang" (!)
it: Uso della notazione con il punto esclamativo non associata

# ValueRequiredInspection
source: Object used where a value is required
cs: Objekt použit tam, kde je vyžadována hodnota
de: Objekt statt Wert verwendet
es: Objeto usado donde se requiere un valor
fr: Une valeur est attendue, mais un objet est fourni
it: Oggetto utilizzato dove è richiesto un valore

# VariableNotAssignedInspection
source: Variable is not assigned.
cs: Proměnná není přiřazena.
de: Der Variable wird kein Wert zugewiesen.
es: La variable no esta asignada.
fr: Une variable est déclarée, mais pas assignée.
it: La variabile non è assegnata.

# VariableTypeNotDeclaredInspection
source: Implicitly 'Variant' variable
cs: Implicitně proměnná typu 'Variant'
de: Variable ist implizit 'Variant'
es: Variable 'Variant' implicita
fr: Variable implicitement de type 'Variant'
it: Variabile implicitamente 'Variant'

# WriteOnlyPropertyInspection
source: Write-only property
cs: Vlastnost pouze-zápis
de: Nur-Schreib Eigenschaft
es: Propiedad de solo escritura
fr: Propriété en écriture seule
it: Proprietà di sola lettura

# ApplicationWorksheetFunctionInspection
source: Late bound WorksheetFunction call.
cs: Pozdní vázání pro volání 'WorksheetFunction'.
de: Laufzeitgebundener Aufruf an WorksheetFunction.
es: Enlace tardío para 'WorksheetFunction'.
fr: Appel de fonction WorksheetFunction à liaison tardive.
it: Chiamata WorksheetFunction in associazione tardiva.

# InvalidAnnotationInspection
source: Invalid annotation
cs: Ilegální anotace
de: Unzulässige Annotation
fr: Annotation invalide
it: Annotazione non valida

# AnnotationInIncompatibleComponentTypeInspection
source: Annotation in component with incompatible type
cs: Anotace je nekompatibilní s typem komponenty
de: Annotation in Komponente mit inkompatiblem Typ
fr: Annotation dans un type de composant incompatible
it: Annotazione in componente con tipo incompatibile

# UnrecognizedAnnotationInspection
source: Unrecognized annotation
cs: Nerozpoznaná anotace
de: Unbekannte Annotation
fr: Annotation inconnue
it: Annotazione non riconosciuta

# IIfSideEffectInspection
source: Potential 'IIf' Function side effects
de: Mögliche Nebeneffekte der 'IIf'-Funktion
it: Potenziali effetti collaterali della funzione 'IF'

# ReadOnlyPropertyAssignmentInspection
source: Read-Only Property assignment
de: Schreibgeschützt-Eigenschaftzuweisung
it: Assegnazione proprietà di sola lettura

# SuspiciousPredeclaredInstanceAccessInspection
source: Suspicious access to a predeclared instance
de: Verdächtiger Zugriff auf eine vordefinierte Instanz.
it: Accesso sospetto a un'istanza predichiarata

# PublicControlFieldAccessInspection
source: Public control field access
de: Öffentlicher Steuerelementzugriff
it: Accesso a campo controllo pubblico

# VariableNotUsedInspection
source: Variable is not used.
de: Variable wird nicht verwendet.
it: La variabile non è usata.

# PublicEnumerationDeclaredInWorksheetInspection
source: Public enumeration declared within worksheet
de: Public Enumerations Deklaration innerhalb eines Arbeitsblattes
it: Enumerazione pubblica dichiarata all'interno di un foglio di lavoro

# ProcedureNotUsedInspection
source: Procedure/Function/Property is not used.
de: Prozedur/Funktion/Eigenschaft wird nicht benutzt.
it: Procedura/Funzione/Proprietà non usata.

# ParameterNotUsedInspection
source: Parameter is not used.
de: Parameter wird nicht genutzt.
it: Il parametro non è usato.

# LineLabelNotUsedInspection
source: Line label is not used
de: Zeilenbezeichnung wird nicht verwendet
it: Etichetta di riga non usata

# ConstantNotUsedInspection
source: Constant is not used
de: Konstante wird nicht verwendet
it: La costante non è usata

# UDTMemberNotUsedInspection
source: User Defined Type member is not used
de: Benutzerdefinierter Typ wird nicht verwendet
it: Membro Tipo Definito dall'Utente non è usato

# PublicImplementationShouldBePrivateInspection
source: Implementations of interfaces and event handlers should be Private
de: Implementierungen von Interfaces und Ereignis-Handlern sollten Private sein.
it: Le implementazioni di interfacce e gestori di eventi dovrebbero essere Private
