Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/Inspections/InspectionNames.*.resx
Languages: cs, de, es, fr, it

# ArgumentWithIncompatibleObjectTypeInspection
source: Argument with incompatible object type
cs: Argument s nekompatibilním typem objektu
de: Argument mit nicht kompatiblem Objekttyp
es: Argumento con tipo de objeto incompatible
fr: Argument d'un type incompatible avec le type d'objet attendu
it: Argomento con tipo di oggetto incompatibile

# AssignedByValParameterInspection
source: ByVal parameter is assigned
cs: ByVal parametr je přidělen
de: ByVal Parameter ist zugewiesen
es: Se asigna el parámetro ByVal
fr: Assignation d'un paramètre passé par valeur (ByVal)
it: Assegnazione ad un parametro ByVal

# AssignmentNotUsedInspection
source: Assignment is not used
cs: Přiřazení není použito
de: Zuweisung wird nie gelesen
es: No se usa la asignacion
fr: Assignation non utilisée
it: L'assegnazione non è utilizzata

# AttributeValueOutOfSyncInspection
source: Value does not match between attribute and annotation
cs: Hodnota nesedí mezi atributem a anotací
de: Wert stimmt nicht überein zwischen Attribut und Annotation
es: El valor no coincide entre atributo y anotación
fr: La valeur de l'attribut diffère de celle suggérée par l'annotation
it: Valore non corrispondente tra attributo e annotazione

# BooleanAssignedInIfElseInspection
source: Boolean literal assignment in conditional
cs: Podmínce přidělen boolenovský znak
de: Boolsche Zeichenkette wird in Bedingung zugewiesen
es: Asignación literal booleana en condicional
fr: Assignation d'une valeur Booléenne littérale dans une structure conditionnelle
it: Assegnazione letterale booleana in condizionale

# DefaultMemberRequiredInspection
source: Indexed default member access without default member
cs: Indexovaný výchozí přístup člena bez výchozího člena
de: Standardelementzugriff ohne Standardelement
es: Acceso a miembro default indexado sin miembro default
fr: Un appel indexé d'un membre par défaut est tenté sur un objet sans membre par défaut
it: Accesso indicizzato al membro predefinito senza un membro predefinito

# DefaultProjectNameInspection
source: Project name is not specified
cs: Název projektu není specifikován
de: Das Projekt hat den Standard-Projektnamen
es: No se especifica el nombre del proyecto
fr: Le projet porte le nom assigné par défaut
it: Il nome del progetto non è specificato

# DefTypeStatementInspection
source: Usage of 'Def[Type]' statement
cs: Použití výrazu 'Def[Type]'
de: Verwendung der 'Def[Type]'-Anweisung
es: Uso de la declaración 'Def [Type]'
fr: Utilisation d'instruction 'Def[Type]'
it: Utilizzo dell'istruzione 'Def[Type]'

# DuplicatedAnnotationInspection
source: Annotation is duplicated
cs: Anotace je duplikována
de: Annotation ist dupliziert
es: La anotación está duplicada
fr: Annotation dupliquée
it: L'annotazione è duplicata

# EmptyCaseBlockInspection
source: Empty 'Case' block
cs: Prázdný 'Case' blok
de: Leerer 'Case'-Block
es: Bloque 'Case' vacío
fr: Bloc 'Case' vide
it: Blocco 'Case' vuoto

# EmptyDoWhileBlockInspection
source: Empty 'Do...While' Loop
cs: Prázdná 'Do...While' smyčka
de: Leere 'Do…While'-Schleife
es: Bucle 'Do...While' vacío
fr: Boucle 'Do...While' vide
it: Ciclo 'Do...While' vuoto

# EmptyElseBlockInspection
source: Empty 'Else' block
cs: Prázdný 'Else' blok
de: Leerer 'Else'-Block
es: Bloque 'Else' vacío
fr: Bloc 'Else' vide
it: Blocco 'Else' vuoto

# EmptyForEachBlockInspection
source: Empty 'For Each...Next' Loop
cs: Prázdná 'For Each...Next' smyčka
de: Leere 'For Each…Next'-Schleife
es: Bucle 'For Each...Next' vacio
fr: Boucle 'For Each...Next' vide
it: Ciclo 'For Each...Next' vuoto

# EmptyForLoopBlockInspection
source: Empty 'For...Next' Loop
cs: Prázdná 'For...Next' smyčka
de: Leere 'For…Next'-Schleife
es: Bucle 'For...Next' vacio
fr: Boucle 'For...Next' vide
it: Ciclo 'For...Next' vuoto

# EmptyIfBlockInspection
source: Empty conditional branch
cs: Prázdná větev podmínky
de: Leerer 'If'-Block
es: Rama condicional vacía
fr: Branche conditionelle vide
it: Ramo condizionale vuoto

# EmptyMethodInspection
source: Empty method
cs: Prázdná metoda
de: Leere Methode
es: Método vacío
fr: Méthode vide
it: Metodo vuoto

# EmptyModuleInspection
source: Empty module
cs: Prázdný modul
de: Leeres Modul
es: Módulo vacío
fr: Module vide
it: Modulo vuoto

# EmptyStringLiteralInspection
source: Empty string literal
cs: Znak prázdného řetězce
de: Leeres 'String Literal'
es: Cadena vacía
fr: Chaîne de caractères vide
it: Stringa letterale vuota

# EmptyWhileWendBlockInspection
source: Empty 'While...Wend' loop
cs: Prázdná 'While...Wend' smyčka
de: Leere 'While…Wend'-Schleife
es: Bucle 'While...Wend' vacio
fr: Boucle 'While...Wend' vide
it: Ciclo 'While...Wend' vuoto

# EncapsulatePublicFieldInspection
source: Public field breaks encapsulation
cs: Veřejné pole ruší zapouzdření
de: Öffentliches Feld bricht die Kapselung
es: Campo público rompe el encapsulamiento
fr: Un champ public rompt l'encapsulation
it: Il campo pubblico rompe l'incapsulamento

# ExcelMemberMayReturnNothingInspection
source: Member access may return 'Nothing'
cs: Je možné, že členský přístup může vrátit 'Nothing'
de: Elementraufruf kann 'Nothing' zurückgeben
es: El acceso de los miembros puede devolver "Nothing"
fr: Accès à un membre pouvant renvoyer 'Nothing'
it: Il membro di accesso può restituire 'Nothing'

# ExcelUdfNameIsValidCellReferenceInspection
source: Function is hidden by Excel cell reference
cs: Funkce je schována referencí Excelovské buňky
de: Funktion wird von EXCEL-Zellreferenz verdeckt
es: La función está oculta por la referencia de celda de Excel
fr: Une fonction est cachée par une référence de cellule valide
it: La funzione è nascosta dal riferimento di cella di Excel

# FunctionReturnValueAlwaysDiscardedInspection
source: Function return value is always discarded.
cs: Návratová hodnota funkce je vždy zahozena.
de: Der Rückgabewert einer Funktion wird immer verworfen.
es: El valor de retorno de la función siempre se descarta.
fr: La valeur renvoyée par la fonction est systématiquement ignorée.
it: Il valore restituito dalla funzione è sempre scartato.

# FunctionReturnValueDiscardedInspection
source: Function return value gets discarded.
cs: Návratová hodnota funkce je zahozena.
de: Der Rückgabewert einer Funktion wird verworfen.
es: El valor de retorno de la función se descarta.
fr: La valeur renvoyée par la fonction est ignorée.
it: Il valore restituito dalla funzione viene scartato.

# HostSpecificExpressionInspection
source: Host-specific bracketed expression is only evaluated at runtime
cs: Hranatý výraz specifický pro hostitele je vyhodnocen pouze při běhu
de: Hostspezifischer geklammerter Ausdruck wird nur zur Laufzeit ausgewertet
es: La expresión entre corchetes específica del host solo se evalúa en tiempo de ejecución
fr: Les expressions spécifiques à l'application hôte, encadrées de crochets, sont seulement évaluées lors de l'exécution
it: L'espressione tra parentesi specifica dell'host viene valutata solo in fase di esecuzione

# HungarianNotationInspection
source: Variable uses Hungarian notation.
cs: Proměnná používá Maďarskou notaci.
de: Variable verwendet 'Ungarische Notation'.
es: Variable utiliza la notación húngara.
fr: L'identifiant utilise la notation hongroise.
it: La variabile utilizza la notazione ungherese.

# ImplementedInterfaceMemberInspection
source: Implemented member of interface class
cs: Implementovaný člen třídy rozhraní
de: Implementierte Methode einer Interface-Klasse
es: Miembro implementado de la clase Interfaz
fr: Implémentation concrète d'un membre d'une interface abstraite
it: Membro implementato in una classe interfaccia

# ImplicitActiveSheetReferenceInspection
source: Implicit reference to ActiveSheet
cs: Implicitní reference na 'ActiveSheet'
de: Implizite Referenz zum 'ActiveSheet'
es: Referencia implícita a ActiveSheet
fr: Référence implicite à la feuille active
it: Riferimento implicito ad ActiveSheet

# ImplicitActiveWorkbookReferenceInspection
source: Implicit reference to ActiveWorkbook
cs: Implicitní reference na 'ActiveWorkbook'
de: Implizite Referenz zum 'ActiveWorkbook'
es: Referencia implícita a ActiveWorkbook
fr: Référence implicite au classeur actif
it: Riferimento implicito ad ActiveWorkbook

# ImplicitByRefModifierInspection
source: Implicit ByRef parameter
cs: Implicitní ByRef parametr
de: Impliziter ByRef Parameter
es: Parámetro ByRef implícito
fr: Paramètre ByRef implicite
it: Parametro ByRef implicito

# ImplicitContainingWorkbookReferenceInspection
source: Implicit reference to the containing Workbook module
cs: Implicitní odkaz na obsahující modul Sešitu
de: Implizite Referenz zum umgebenden Workbook-Modul
fr: Référence implicite au classeur contenant le projet
it: Riferimento implicito al modulo della cartella di lavoro che lo contiene

# ImplicitContainingWorksheetReferenceInspection
source: Implicit reference to containing Worksheet module
cs: Implicitní odkaz na obsahující modul Listu
de: Implizite Referenz zum umgebenden Worksheet-Modul
fr: Référence implicite à la feuille (Worksheet) hôte
it: Riferimento implicito al modulo del foglio di lavoro che lo contiene

# ImplicitDefaultMemberAccessInspection
source: Implicit default member access
cs: Implicitní výchozí členský přístup
de: Impliziter Zugriff auf ein Standardelement
es: Acceso a miembro default implícito
fr: Appel implicite d'un membre par défaut
it: Accesso implicito al membro predefinito

# ImplicitlyTypedConstInspection
source: Implicitly typed Const
cs: Implicitně typovaná konstanta
de: Konstante mit implizit bestimmtem Datentyp
es: Constante tipada implícitamente
fr: Constante implicitement typée
it: Costante di tipo implicito

# ImplicitPublicMemberInspection
source: Implicitly public member
cs: Implicitně veřejný člen
de: Implizite öffentliche Methode
es: Miembro implícitamente público
fr: Membre implicitement public
it: Membro implicitamente pubblico

# ImplicitRecursiveDefaultMemberAccessInspection
source: Implicit recursive default member access
cs: Implicitní rekurzivní výchozí členský přístup
de: Impliziter rekursiver Zugriff auf einen Standardelement
es: Acceso a miembro default implícito recursivo
fr: Appel implicite récursif d'un membre par défaut
it: Accesso ricorsivo implicito al membro predefinito

# ImplicitUnboundDefaultMemberAccessInspection
source: Implicit unbound default member access
cs: Implicitní nevázaný výchozí členský přístup
de: Impliziter nicht gebundener Zugriff auf einen Standardelement
es: Acceso a miembro default implícito sin vincular
fr: Appel implicite et sans liaison d'un membre par défaut
it: Accesso implicito non associato al membro predefinito

# ImplicitVariantReturnTypeInspection
source: Member return type is implicitly 'Variant'
cs: Návratový typ člena je implicitně 'Variant'
de: Rückgabewert der Methode ist implizit 'Variant'
es: El tipo de devolución del miembro es implícitamente 'Variant'
fr: Le membre renvoie implicitement une valeur 'Variant'
it: Il membro ritorna un tipo implicitamente 'Variant'

# IndexedDefaultMemberAccessInspection
source: Indexed default member access
cs: Indexovaný výchozí členský přístup
de: Parametrisierter Zugriff auf einen Standardelement
es: Acceso a miembro default indexado
fr: Appel indexé d'un membre par défaut
it: Accesso indicizzato al membro predefinito

# IndexedRecursiveDefaultMemberAccessInspection
source: Indexed recursive default member access
cs: Indexovaný rekurzivní výchozí členský přístup
de: Parametrisierter rekursiver Zugriff auf einen Standardelement
es: Acceso a miembro default indexado recursivo
fr: Appel indexé récursif d'un membre par défaut
it: Accesso ricorsivo indicizzato al membro predefinito

# IndexedUnboundDefaultMemberAccessInspection
source: Indexed unbound default member access
cs: Indexovaný nevázaný výchozí členský přístup
de: Parametrisierter nicht gebundener Zugriff auf einen Standardelement
es: Acceso a miembro default indexado sin vincular
fr: Appel sans liaison d'un membre par défaut
it: Accesso implicito indicizzato non associato al membro predefinito

# IntegerDataTypeInspection
source: Use of 16-bit integer type
cs: Použití 16-bit čísla typu integer
de: Verwendung von 16-bit Ganzzahl
es: Uso de tipo entero de 16 bits
fr: Utilisation d'un entier 16-bits
it: Uso di un tipo intero a 16-bit

# IsMissingOnInappropriateArgumentInspection
source: Inappropriate use of 'IsMissing' - Parameter is not 'Variant'
cs: Nevhodné použití funkce 'IsMissing' - Parametr není 'Variant'
de: Unpassende Verwendung der 'IsMissing'-Funktion - Parameter ist nicht vom Typ Variant
es: Uso inapropiado de 'IsMissing' - El parámetro no es 'Variant'
fr: Utilisation inappropriée ou incorrecte de la fonction 'IsMissing'
it: Uso inappropriato di 'IsMissing': il parametro non è 'Variant'

# IsMissingWithNonArgumentParameterInspection
source: Inappropriate use of 'IsMissing' - Parameter is local variable
cs: Nevhodné použití funkce 'IsMissing' - Parametr je lokální proměnná
de: Unpassende Verwendung der 'IsMissing'-Funktion - Lokale Variable kann nie fehlen
es: Uso inapropiado de 'IsMissing' - El parámetro es una variable local
fr: Utilisation inappropriée ou incorrecte de la fonction 'IsMissing'
it: Uso inappropriato di 'IsMissing': il parametro è una variabile locale

# KeywordsUsedAsMemberInspection
source: Keyword used as member name
cs: Klíčové slovo použito jako jméno členu
de: Schlüsselwort wird als Methoden- oder Variablenname verwendet
es: Palabra reservada usada como nombre de miembro
fr: Mot-clé utilisé comme nom de membre
it: Parola chiave usata come nome del membro

# LineContinuationBetweenKeywordsInspection
source: Line continuation between keywords
cs: Pokračování řádku mezi klíčovými slovy
de: Zeilenfortsetzung zwischen Schüsselworten
es: Continuación de líneas entre palabras reservadas
fr: Marqueur de continuation entre les mots-clés
it: Carattere di continuazione di riga tra parole chiave

# MemberNotOnInterfaceInspection
source: Member not found
cs: Člen nenalezen
de: Element existiert auf dem Interface nicht
es: Miembro no encontrado
fr: Membre inexistant ou introuvable
it: Membro non trovato

# MisleadingByRefParameterInspection
source: Misleading ByRef parameter modifier
cs: Zavádějící modifikátor parametru ByRef
de: Irreführender ByRef Parametermodifizierer
fr: Modificateur ByRef trompeur
it: Modificatore di parametro ByRef fuorviante

# MissingAnnotationArgumentInspection
source: Missing annotation parameter
cs: Chybějící parametr anotace
de: Fehlender Annotationsparameter
es: Falta el parámetro de anotación
fr: Paramètre d'annotation manquant
it: Parametro di annotazione mancante

# MissingAttributeInspection
source: Missing attribute
cs: Chybějící atribut
de: Fehlendes Attribut
es: Falta atributo
fr: Attribut manquant
it: Attributo mancante

# MissingMemberAnnotationInspection
source: Missing member annotation
cs: Chybějící anotace členu
de: Fehlende Elementannotation
es: Falta la anotación del miembro
fr: Annotation manquante
it: Annotazione membro mancante

# MissingModuleAnnotationInspection
source: Missing module annotation
cs: Chybějící anotace modulu
de: Fehlende Modulannotation
es: Falta la anotación del módulo
fr: Annotation manquante (module)
it: Annotazione del modulo mancante

# ModuleScopeDimKeywordInspection
source: Use of 'Dim' keyword at module level
cs: Použití klíčového slova 'Dim' na úrovni modulu
de: Verwendung von 'Dim' auf Modulebene
es: Uso de la palabra clave 'Dim' a nivel de módulo
fr: Utilisation du mot-clé 'Dim' au niveau module
it: Uso della parola chiave 'Dim' a livello di modulo

# ModuleWithoutFolderInspection
source: Module without '@Folder' annotation
cs: Modul bez '@Folder' anotace
de: Modul ohne '@Folder'-Annotation
es: Módulo sin anotación '@Folder'
fr: Module sans annotation '@Folder'
it: Modulo senza annotazione '@Folder'

# MoveFieldCloserToUsageInspection
source: Scope of variable is broader than it needs to be.
cs: Rozsah proměnné je širší, než je třeba.
de: Der Geltungsbereich der Variable ist größer als notwendig.
es: El alcance de la variable es más amplio de lo que necesita ser.
fr: La portée de la variable est plus grande que nécessaire.
it: L'ambito della variabile è più ampio di quanto deve essere.

# MultilineParameterInspection
source: Parameter declaration is split on multiple lines.
cs: Deklarace parametru je rozdělena na více řádků.
de: Die Parameterdeklaration ist über mehrere Zeilen verteilt.
es: La declaración de parámetros se divide en varias líneas.
fr: Le paramètre est déclaré sur plus d'une ligne.
it: La dichiarazione dei parametri è suddivisa su più righe.

# MultipleDeclarationsInspection
source: Multiple declarations in single instruction
cs: Vícenásobná deklarace v jediné instrukci
de: Anweisung enthält Mehrfachdeklarationen
es: Múltiples declaraciones en una sola instrucción
fr: L'instruction comporte plus d'une déclaration
it: Dichiarazioni multiple in una singola istruzione

# NegativeLineNumberInspection
source: Negative line number
cs: Záporné číslo řádku
de: Negative Zeilennummer
es: Número de línea negativo
fr: Numéro de ligne négatif
it: Numero di riga negativo

# NonBreakingSpaceIdentifierInspection
source: Identifier containing a non-breaking space
cs: Identifikátor obsahující pevnou mezeru
de: Name, der ein geschütztes Leerzeichen enthält
es: Identificador contiene un espacio NBSP
fr: Identifiant contenant un espace insécable (&nbsp;)
it: Identificatore contenente uno spazio non separatore

# NonReturningFunctionInspection
source: Non-returning function or property getter
cs: Funkce, která nic nevrací, nebo property getter
de: Funktion oder Eigenschaft ohne Rückgabewert
es: Función de no devolución o getter de propiedad
fr: Fonction ou accesseur de propriété sans valeur de retour
it: Funzione o getter di proprietà senza ritorno

# ObjectVariableNotSetInspection
source: Object variable assignment requires 'Set' keyword.
cs: Pro přiřazení proměnné objektu je zapotřebí klíčového slova 'Set'.
de: Zuweisung in eine Objektvariable benötigt das 'Set'-Schlüsselwort.
es: La asignación de variables de objeto requiere la palabra clave 'Set'.
fr: L'assignation d'une référence d'objet requiert le mot-clé 'Set'.
it: L'assegnazione della variabile oggetto richiede la parola chiave 'Set'.

# ObjectWhereProcedureIsRequiredInspection
source: Object used where a procedure is required
cs: Objekt použit tam, kde je vyžadována procedura
de: Objekt an Stell einer Prozedur verwendet
es: Objeto usado donde se requiere un procedimiento
fr: Un appel de procédure est attendu, mais un objet est fourni
it: Oggetto utilizzato dove è richiesta una procedura

# ObsoleteCallingConventionInspection
source: Use of 'CDecl' calling convention on Windows
cs: Použití zastaralé 'CDecl' volací konvence
de: Verwendung der 'CDecl' Aufrufkonvention unter Windows
es: Uso de la convención de llamada 'CDecl' en Windows
fr: Utilisation de la convention d'appel 'CDecl' sous Windows
it: Uso della convenzione di chiamata 'CDecl' su Windows

# ObsoleteCallStatementInspection
source: Use of obsolete 'Call' statement
cs: Použití zastaralého 'Call' výrazu
de: Verwendung der veralteten 'Call'-Anweisung
es: Uso de declaración 'Call' obsoleta
fr: Utilisation du mot-clé 'Call'
it: Uso dell'istruzione obsoleta 'Call'

# ObsoleteCommentSyntaxInspection
source: Use of obsolete 'Rem' statement
cs: Použití zastaralého 'Rem' výrazu
de: Verwendung der veralteten 'REM'-Anweisung
es: Uso de la declaración 'Rem' obsoleta
fr: Utilisation du mot-clé 'Rem'
it: Uso dell'istruzione obsoleta 'Rem'

# ObsoleteErrorSyntaxInspection
source: Use of obsolete 'Error' statement
cs: Použití zastaralého 'Error' prohlášení
de: Verwendung der veralteten 'Error'-Anweisung
es: Uso de la declaración 'Error' obsoleta
fr: Utilisation de l'instruction obsolète 'Error'
it: Uso dell'istruzione obsoleta 'Error'

# ObsoleteGlobalInspection
source: Use of obsolete 'Global' access modifier
cs: Použití zastaralého 'Global' access modifikátoru
de: Verwendung der veralteten 'Global'-Zugriffsdeklaration
es: Uso del modificador de acceso 'Global' obsoleto
fr: Utilisation du mot-clé 'Global'
it: Uso del modificatore d'accesso obsoleto 'Global'

# ObsoleteLetStatementInspection
source: Use of obsolete explicit 'Let' statement
cs: Použití zastaralého 'Let' výrazu
de: Verwendung der veralteten 'Let'-Anweisung
es: Uso de la declaración 'Let' obsoleta
fr: Utilisation du mot-clé 'Let'
it: Uso dell'istruzione di assegnazione esplicita obsoleta 'Let'

# ObsoleteMemberUsageInspection
source: Member marked as '@Obsolete' is used
cs: Je použit člen, který je označený jako '@Obsolete'
de: Verwendung eines als '@Obsolete' markierten Members
es: Se utiliza el miembro marcado como '@Obsolete'
fr: Utilisation d'un membre marqué '@Obsolete'
it: Un membro contrassegnato come '@Obsolete' è usato

# ObsoleteTypeHintInspection
source: Obsolete Type hint usage
cs: Použití zastaralé nápovědy Typu
de: Verwendungshinweis für Typ
es: Usa una sugerencia obsoleta
fr: Utilisation d'un indicateur de type
it: Uso del suggerimento di Tipo obsoleto

# ObsoleteWhileWendStatementInspection
source: Use of obsolete 'While...Wend' statement
cs: Použití zastaralého příkazu 'While...Wend'
de: Verwendung der veralteten 'While...Wend'-Anweisung
es: Uso de declaración 'While...Wend' obsoleta
fr: Utilisation de l'instruction obsolète 'While...Wend'
it: Uso dell'istruzione obsoleta 'While...Wend'

# OnLocalErrorInspection
source: On Local Error statement
cs: výraz On Local Error
de: 'On Local Error'-Direktive
es: Sentencia 'On Local Error'
fr: Instruction obsolète 'On Local Error'
it: Istruzione On Local Error

# OptionBaseInspection
source: 'Option Base 1' is specified.
cs: Je specifikováno 'Option Base 1'.
de: 'Option Base 1' ist angegeben.
es: Se especifica 'Option Base 1'.
fr: 'Option Base 1' est spécifié.
it: E' specificato 'Option Base 1'.

# OptionBaseZeroInspection
source: 'Option Base 0' is redundant
cs: 'Option Base 0' je nadbytečná
de: 'Option Base 0' ist redundant
es: 'Option Base 0' es redundante
fr: 'Option Base 0' est redondant
it: 'Option Base 0' è ridondante

# OptionExplicitInspection
source: 'Option Explicit' is not specified.
cs: 'Option Explicit' není specifikován.
de: 'Option Explicit' ist nicht angegeben.
es: 'Option Explicit' no se especifica.
fr: 'Option Explicit' n'est pas spécifiée.
it: 'Option Explicit' non è specificato.

# ParameterCanBeByValInspection
source: Parameter can be passed by value.
cs: Parametr je možné předat jako hodnotu.
de: Parameter kann als Wert übergeben werden.
es: El parámetro se puede pasar por valor.
fr: Le paramètre peut être passé par valeur.
it: Il parametro può essere passato per valore.

# ProcedureCanBeWrittenAsFunctionInspection
source: Procedure can be written as a function.
cs: Proceduru je možno napsat jako funkci.
de: Prozedur kann als Funktion geschrieben werden.
es: El procedimiento puede ser escrito como una función.
fr: La procédure pourrait être une fonction.
it: La procedura può essere scritta come una funzione.

# ProcedureRequiredInspection
source: Object without default member used where a procedure is required
cs: Objekt bez výchozího člena použit tam, kde je vyžadována procedura
de: Objekt ohne Standardelement statt Prozedur verwendet
es: Objeto sin miembro default usado donde se requiere un procedimiento
fr: Un appel de procédure est attendu, mais un objet sans membre par défaut est fourni
it: Oggetto senza membro predefinito utilizzato dove è richiesta una procedura

# RedundantByRefModifierInspection
source: Redundant 'ByRef' modifier
cs: Nadbytečný 'ByRef' modifikátor
de: Redundante 'ByRef'-Markierung
es: Modificador 'ByRef' redundante
fr: Modificateur 'ByRef' redondant
it: Modificatore 'ByRef' ridondante
