Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/Inspections/InspectionInfo.*.resx
Languages: cs, de, es, fr, it

# MisleadingByRefParameterInspection
source: The last parameter (the 'Value' parameter) of property mutators (Let/Set) are always passed ByVal. This is true regardless of the presence or absence of a ByRef or ByVal modifier. Exception: A UserDefinedType must always be passed ByRef even when it is the last parameter of a property mutator.
cs: Poslední parametr (parametr 'Value') mutátorů vlastností (Let/Set) je vždy předán jako ByVal. To platí bez ohledu na přítomnost nebo absenci ByRef/ByVal modifikátorů. Výjimka: UserDefinedType musí být vždy předán jako ByRef, i když se jedná o poslední parametr mutátoru vlastní.
de: Der letzte Parameter (der 'Wert'-Parameter) der Eigenschaftsmutation wird immer als ByVal übergeben. Dies gilt unabhänig der An- oder Abwesenheit eines ByRef oder ByVal Modifizieres. Ausnahme: Ein nutzerdefinierter Type (UserDefinedType) muss immer als ByRef übergeben werden, auch wenn er der letzte Parameter einer Eigenschaftmutation ist.
fr: Le dernier paramètre ('Value' ou 'RHS') d'un membre Property Let ou Property Set est toujours passé par valeur (ByVal), et ce même en présence d'un modificateur ByRef, implicite ou explicite (sauf pour un type UDT).
it: L'ultimo parametro (il parametro 'Value') dei mutatori di proprietà è sempre passato da ByVal. Questo vale indipendentemente dalla presenza o assenza di un modificatore ByRef o ByVal. Eccezione: un UserDefinedType deve sempre essere passato ByRef anche quando è l'ultimo parametro di un mutatore di proprietà.

# MissingAnnotationArgumentInspection
source: An annotation parameter is missing or incorrectly specified. The correct syntax is : '@Annotation([parameter])\nExample: '@Folder("Parent.Child")
cs: Parametr anotace chybí, nebo je chybně specifikován. Správná syntaxe je: '@Annotation([parametr])\nPříklad: '@Folder("Parent.Child")
de: Einer Annotation in einem Kommentar fehlt ein Argument oder sie konnte nicht gelesen werden. Die korrekte Syntax ist: '@Annotation([parameter])'\nBeispiel: '@Folder("Parent.Child")'
es: Falta un parámetro de anotación o está incorrectamente especificado. La sintaxis correcta es: '@Annotation([parámetro]) \nEjemplo:' @Folder("Padre.Hijo")
fr: Un paramètre d'annotation est manquant ou incorrectement spécifié. La syntaxe correcte est: '@Annotation([paramètre])\nExemple: '@Folder("Parent.Enfant")
it: Un parametro di annotazione è mancante o specificato in modo errato. La sintassi corretta è: '@Annotation([parameter])\nExample: '@Folder("Parent.Child")

# MissingAttributeInspection
source: A Rubberduck annotation is specified for a module or member, but the corresponding attribute isn't present. Module attributes and annotations need to be synchronized.
cs: Anotace Rubberducku je specifikována pro modul nebo člen, ale příslušný atribut není přítomen. Atributy modulu a anotace je třeba synchronizovat.
de: Eine Rubberduck-Annotation wurde für ein Modul oder Element festgelegt, aber das zugehörige Attribut fehlt. Die Modul-Attribute und Annotationen sollten synchronisiert werden.
es: Se especifica una anotación de Rubberduck para un módulo o miembro, pero el atributo correspondiente no está presente. Los atributos del módulo y las anotaciones deben estar sincronizados.
fr: Une annotation Rubberduck est spécifiée pour un module ou un membre, mais l'attribut correspondant n'est pas présent. Les attributs et annotations du module doivent être synchronisés.
it: Un'annotazione di Rubberduck è specificata per un modulo o un membro, ma l'attributo corrispondente non è presente. Gli attributi e le annotazioni del modulo devono essere sincronizzati.

# MissingMemberAnnotationInspection
source: Member attributes are not displayed in the VBE. By adding an annotation, you make these attributes more explicit, and Rubberduck can keep annotations and attributes synchronized.
cs: Atributy členu se nezobrazují ve VBE. Přidáním anotace uděláte tyto atributy více explicitní a Rubberduck bude moci držet anotace a atributy synchronizovány.
de: Elementattribute werden von der VBE nicht angezeigt. Durch das hinzufügen einer Annotation werden diese Attribute deutlicher. Außerdem kann Rubberduck die Annotationen und Attribute synchronisieren.
es: Los atributos de los miembros no se muestran en el VBE. Al agregar una anotación, hace que estos atributos sean más explícitos, y Rubberduck puede mantener las anotaciones y los atributos sincronizados.
fr: Les attributs ne sont pas visibles dans l'éditeur. En ajoutant une annotation, ces attributs deviennent plus explicites, et Rubberduck peut assurer la synchronisation des attrbuts avec ces annotations.
it: Gli attributi dei membri non vengono visualizzati in VBE. Aggiungendo un'annotazione, rendi questi attributi più espliciti e Rubberduck può mantenere sincronizzati annotazioni e attributi.

# MissingModuleAnnotationInspection
source: Module attributes are not displayed in the VBE. By adding an annotation, you make these attributes more explicit, and Rubberduck can keep annotations and attributes synchronized.
cs: Atribudy modulu se nezobrazují ve VBE. Přidáním anotace uděláte tyto atributy více explicitní a Rubberduck bude moci držet anotace a atributy synchronizovány.
de: Modulattribute werden von der VBE nicht angezeigt. Durch das hinzufügen einer Annotation werden diese Attribute deutlicher. Außerdem kann Rubberduck die Annotationen und Attribute synchronisieren.
es: Los atributos del módulo no se muestran en el VBE. Al agregar una anotación, hace que estos atributos sean más explícitos, y Rubberduck puede mantener las anotaciones y los atributos sincronizados.
fr: Les attributs ne sont pas visibles dans l'éditeur. En ajoutant une annotation, ces attributs deviennent plus explicites, et Rubberduck peut assurer la synchronisation des attrbuts avec ces annotations.
it: Gli attributi del modulo non vengono visualizzati nel VBE. Aggiungendo un'annotazione, rendi questi attributi più espliciti e Rubberduck può mantenere sincronizzati annotazioni e attributi.

# ModuleScopeDimKeywordInspection
source: The 'Public' keyword can only be used at module level; its counterpart 'Private' can also only be used at module level. 'Dim' however, can be used to declare both procedure and module scope variables. For consistency, it would be preferable to reserve 'Dim' for locals, and thus to use 'Private' instead of 'Dim' at module level.
cs: Klíčové slovo 'Public' lze použít pouze na úrovn modulu; jeho protějšek 'Private' lze také použít pouze na úrovni modulu. 'Dim' lze však deklarovat pro proměnné jak na úrovni modulu, tak na úrovni procedury. Avšak pro lepší konzistenci je preferováno používat 'Dim' pro lokální proměnné a proto na úrovni modulu používejte 'Private' místo 'Dim'.
de: Das Schlüsselwort 'Public' kann nur auf Modulebene verwendet werden; Sein Konterpart 'Private' kann auch nur auf Modulebene verwendet werden. 'Dim' jedoch kann verwendet werden, um sowohl modulweite als auch prozedurweite Variablen zu deklarieren. Um der Konsistenz Willen ist es besser, 'Dim' nur für lokale Variablen zu verwenden, also 'Private' statt 'Dim' auf Modulebene zu verwenden.
es: La palabra clave 'Public' solo se puede utilizar a nivel de módulo; su contraparte 'Privado' también puede usarse solo a nivel de módulo. Sin embargo, 'Dim' se puede usar para declarar las variables de alcance del módulo y del procedimiento. Por coherencia, sería preferible reservar 'Dim' para los locales, y así usar 'Private' en lugar de 'Dim' a nivel de módulo.
fr: Le mot-clé 'Public' peut seulement être utilisé au niveau module; son contraire 'Private' est également seulement permis au niveau module. Toutefois, 'Dim' peut être utilisé autant pour déclarer une variable locale qu'une variable module. Pour fins de constance, il est donc préférable de réserver le mot-clé 'Dim' pour les variables locales, et d'utiliser 'Private' au lieu de 'Dim' au niveau module.
it: La parola chiave 'Public' può essere utilizzata solo a livello di modulo; anche la sua controparte 'Private' può essere utilizzata solo a livello di modulo. Tuttavia, 'Dim' può essere utilizzato per dichiarare le variabili a livello sia della procedura sia del modulo. Per coerenza, sarebbe preferibile riservare 'Dim' per le variabili locali e quindi utilizzare 'Private' invece di 'Dim' a livello di modulo.

# ModuleWithoutFolderInspection
source: Modules without the '@Folder' annotation cannot receive custom groupings in the Code Explorer.
cs: Moduly bez '@Folder' anotace nelze v Code Exploreru uživatelsky seskupovat do skupin.
de: Module ohne '@Folder'-Annotation können im Code Explorer nicht in gesonderte Gruppen unterschieden werden.
es: Los módulos sin la anotación '@Folder' no pueden recibir agrupaciones personalizadas en el Explorador de códigos.
fr: Les modules sans annotation '@Folder' ne peuvent être regroupés dans l'Explorateur de Code.
it: I moduli senza l'annotazione '@Folder' non possono ricevere raggruppamenti personalizzati in Explorer del Codice.

# MoveFieldCloserToUsageInspection
source: A module-level variable used only in one procedure should be declared in that procedure.
cs: Proměnná na úrovni modulu, která je použita jen v jedné proceduře, by měla být deklarovaná v oné proceduře.
de: Eine Variable, die im Modulkopf deklariert wurde aber nur in einer Prozedur verwendet wird, sollte in der Prozedur deklariert werden.
es: Una variable de nivel de módulo utilizada solo en un procedimiento debe declararse en ese procedimiento.
fr: Un champ qui n'est utilisé dans une seule procédure, devrait être déclarée dans cette procédure.
it: Una variabile a livello di modulo utilizzata solo in una procedura dovrebbe essere dichiarata in quella procedura.

# MultilineParameterInspection
source: Consider continuing long signatures between parameters. Splitting a parameter declaration across multiple lines arguably hurts readability.
cs: Rozdělení deklarace parametru na více řádků velmi zraňuje čitelnost. I když je parametr dlouhý, zvažte jeho deklaraci na jeden řádek.
de: Überlege lange Parameterdeklarationen zusammenzuhalten. Das Aufteilen einer Parameterdeklaration über mehrere Zeilen sollte zugunsten der besseren Lesbarkeit vermieden werden.
es: Considere la posibilidad de continuar las firmas largas entre los parámetros. La división de una declaración de parámetros en múltiples líneas podría perjudicar la legibilidad.
fr: Considérez insérer les continuations entre les paramètres d'une longue signature. Séparer la déclaraion d'un paramètre sur plusieurs lignes rend plus difficile la lecture du code.
it: Considerare la possibilità di continuare le firme lunghe tra i parametri. La suddivisione di una dichiarazione di parametro su più righe probabilmente danneggia la leggibilità.

# MultipleDeclarationsInspection
source: Declaring multiple variables in the same instruction is legal, but should be used sparingly. Consider declaring variables closer to their usage, in a single instruction per declaration.
cs: Deklarování více proměnných v té samé instrukci je legální, ale nemělo by se to používat často. Zvažte deklaraci proměnných blíže k jejich použití, v jedné instrukci na jednu deklaraci.
de: Die Deklaration von mehren Variablen in der gleichen Codezeile ist erlaubt, sollte aber sparsam eingesetzt werden. Erwäge die Variablendeklartion in der Nähe der Nutzung als separate Anweisung pro Deklaration.
es: Declarar múltiples variables en la misma instrucción es legal, pero debe usarse con moderación. Considere declarar las variables más cerca de su uso, en una sola instrucción por declaración.
fr: Déclarer plusieurs variables dans la même instruction est légal, mais devrait être utilisé avec modération. Considérez déclarer les variables plus près de leur utilisation, dans une seule déclaration par instruction.
it: La dichiarazione di più variabili nella stessa istruzione è legale, ma dovrebbe essere usata con parsimonia. Considera la possibilità di dichiarare variabili più vicine al loro utilizzo, in una singola istruzione per dichiarazione.

# NegativeLineNumberInspection
source: Negative line numbers are actually input as hex literal and then prettified by VBE. Editing the line again will cause it to turn red since negative line numbers are in fact illegal.
cs: Záporná čísla řádků jsou ve skutečnosti vstup jako hexadecimální písmena, která jsou poté zkrášlena samotným VBE. Opětovná úprava řádku vyústí v její červené vysvícení, protože jsou negativní čísla řádků ve skutečnosti nelegální.
de: Negative Zeilennummern können nur als Hexadezimalzahlen eingegeben werden, welche der VBE in Dezimalzahlen umwandelt. Wird die Programmzeile erneut bearbeitet, macht die negative Zeilennummer die Zeile ungültig.
es: Los números de línea negativos en realidad se ingresan como literal hexadecimal y luego son prectificados por VBE. Volver a editar la línea hará que se vuelva roja, ya que los números de línea negativos son, de hecho, ilegales.
fr: Les numéros de lignes négatifs doivent être saisis avec une valeur hexadécimale, que l'éditeur "corrige". Modifier la ligne causera une erreur de compilation, puisque les numéros de lignes négatifs sont illégaux.
it: I numeri di riga negativi vengono effettivamente inseriti come letterali esadecimali e quindi ottimizzati da VBE. Modificare di nuovo la riga la farà diventare rossa poiché i numeri di riga negativi sono di fatto illegali.

# NonBreakingSpaceIdentifierInspection
source: The identifier contains a non-breaking space which looks very much like just an ordinary space (illegal in an identifier name), which obfuscates the code and makes for a confusing experience. Consider using visible characters for the identifiers.
cs: Identifikátor obsahuje pevnou mezeru, která vypadá jako normální mezera (ilegální v názvu identifikátoru), což znepříjemňuje čitelnost kódu a dělá ho zmatečným. Zvažte použití viditelných znaků pro identifikátory.
de: Der Bezeichner enthält ein geschütztes Leerzeichen, welches wie eine gewöhnliches Leerzeichen aussieht (nicht zulässig in Bezeichnern). Das macht es schwerer den Programmcode zu lesen. Sie sollten in Betracht ziehen stattdessen sichtbare Zeichen zu verwenden.
es: El identificador contiene un espacio de no ruptura que se parece mucho a un espacio ordinario, que concibe el código y crea una experiencia confusa. Considere el uso de caracteres visibles para los identificadores.
fr: L'identifiant contient un espace insécable (&nbsp;), ce qui lui donne l'apparence d'un espace régulier (illégal dans un identifiant), obscurcit le code et rend son utilisation et sa maintenance généralement plus difficile. Considérez utiliser seulement des caractères visibles pour nommer les identifiants.
it: L'identificatore contiene uno spazio non separatore che assomiglia molto a uno spazio normale (illegale nel nome di un identificatore), che offusca il codice e crea un'esperienza confusa. Considera l'idea di utilizzare caratteri visibili per gli identificatori.

# NonReturningFunctionInspection
source: This is likely a bug. The return value of a function or property getter must be assigned before exiting, otherwise the program will not be working with expected results. If a function has no meaningful return value, consider declaring it as a 'Sub' procedure instead.
cs: Zde se jedná nejspíše o bug. Návratná hodnota funkce nebo property getteru musí být přidělena před jejím skončením, jinak program nebude pracovat s očekávanými výsledky. Jestliže nemá funkce smysluplnou návratnou hodnotu, zvažte místo toho její deklaraci jako proceduru 'Sub'.
de: Hier könnte ein Fehler vorliegen. Der Rückgabewert einer Funktion oder Eigenschaft wird nicht zugewiesen. Dies kann zu unvorhersehbaren Verhalten des Codes führen. Wenn die Funktion keinen sinnvollen Rückgabewert hat, sollte sie in eine 'Sub'-Routine umgeschrieben werden.
es: Esto es probablemente un error. El valor de retorno de una función o un captador de propiedades debe asignarse antes de salir, de lo contrario el programa no funcionará con los resultados esperados. Si una función no tiene un valor de retorno significativo, considere declararlo como un procedimiento 'Sub' en su lugar.
fr: Il s'agit possiblement d'un bogue. La valeur de retour d'une fonction ou d'un accesseur de propriété doit être assignée avant la sortie, sans quoi la fonction ne renverra pas de résultat. Si la fonction n'a aucune valeur de retour significative, considérez plutôt une procédure (Sub).
it: Questo è probabilmente un bug. Il valore di ritorno di una funzione o del getter di una proprietà deve essere assegnato prima di uscire, altrimenti il programma non funzionerà con i risultati attesi. Se una funzione non ha un valore di ritorno significativo, considera invece di dichiararla come una procedura 'Sub'.

# ObjectVariableNotSetInspection
source: As far as Rubberduck can tell, this variable is an object variable, assigned without the 'Set' keyword. This causes run-time error 91 'Object or With block variable not set' or 438 'Object doesn't support this property or method' depending on whether the variable has the value 'Nothing' or not.
cs: Rubberduck rozeznává tuto proměnnou jako proměnnou objektu, která je definována bez klíčového slova 'Set'. Tato skutečnost způsobuje run-time chybu 91 'Object or With block variable not set'.
de: Rubberduck hat festgestellt, dass die Variable eine Objektvariable ist, die ohne 'Set'-Schlüsselwort zugewiesen wird. Dies führt zu dem Laufzeitfehler 91 'Objektvariable oder With-Blockvariable nicht festgelegt' oder 438 'Objekt unterstützt diese Eigenschaft oder Methode nicht' abhängig davon, ob die Variable den Wert 'Nothing' hat oder nicht.
es: Por lo que Rubberduck puede decir, esta variable es una variable de objeto, asignada sin la palabra clave 'Set'. Esto causa el error 91 en tiempo de ejecución 'Objeto o variable de bloque no establecida'.
fr: Rubberduck voit cette variable comme étant une référence à un objet, assignée sans le mot-clé 'Set'. Ceci cause une erreur d'exécution (#91 'Object or With block variable not set').
it: Per quanto ne sa Rubberduck, questa variabile è una variabile oggetto, assegnata senza la parola chiave 'Set'. Ciò causa l'errore 91 di runtime 'Oggetto o variabile del blocco With non impostata' o 438 'L'oggetto non supporta questa proprietà o metodo' a seconda che la variabile abbia o meno il valore 'Nothing'.

# ObjectWhereProcedureIsRequiredInspection
source: Using an object with a default member in a place that requires a procedure leads to an implicit invocation of the default member. This is most likely unintentional and negatively affects readability.
cs: Použití objektu s výchozím členem v místě, které vyžaduje proceduru, vede k implicitnímu vyvolání výchozího člena. Toto je s největší pravděpodobností neúmyslné a negativně ovlivňuje čitelnost.
de: Wenn ein Objekt mit einem Standardelement an einer Stelle verwendet wird, die nach einer Prozedur verlangt, wird implizit das Standardelement aufgerufen. Die ist wahrscheinlich nicht beabsichtigt und mindert die Lesbarkeit des Programms.
fr: Un appel de procédure serait attendu, mais le code ne fait que référencer un objet, ce qui résulte en un appel implicite du membre par défaut de cet objet, appel pouvant pour un lecteur éventuel, raisonnablement paraître comme non-intentionnel; l'invocation implicitce de la procédure affecte négativement la lisibilité.
it: L'utilizzo di un oggetto con un membro predefinito in una posizione che richiede una procedura porta a una chiamata implicita del membro predefinito. Questo è molto probabilmente non intenzionale e influisce negativamente sulla leggibilità.

# ObsoleteCallingConventionInspection
source: Windows implementations of Visual Basic only support the StdCall calling convention. The CDecl calling convention is only supported in Macintosh versions of VBA. Use of this keyword in Windows will result in runtime error 49 - 'Bad DLL calling convention'. If this procedure is only intended to be used on Macintosh hosts, it should be conditionally compiled.
cs: Windows implemenace Visual Basic podporuje pouze StdCall volací konvenci a použití CDecl volací konvence je podporováno pouze ve verzích VBA systému Macintosh. Použití tohoto klíčového slova ve Windows může mít za následek chybu runtime 49 - 'Bad DLL calling convention'. Pokud je tato procedura určena pouze pro hostitele systému Macintosh, měla by být podmíněně zkompilována.
de: Windows-Implementierungen von Visual Basic unterstützen nur die StdCall Aufrufkonvention. Die CDecl Aufrufkonvention wird nur von Macintosh-Versionen von VBA unterstützt. Dieses Schlüsselwort unter Windows zu verwenden, wird zum Laufzeitfehler 49 - 'Falsche DLL-Aufrufkonvention' führen. Falls diese Prozedur nur auf Macintosh-Hostanwendungen verwendet werden soll, sollte sie bedingt kompiliert werden.
es: Las implementaciones de Windows de Visual Basic solo son compatibles con la convención de llamada StdCall. La convención de llamada CDecl solo es compatible con las versiones de VBA de Macintosh. El uso de esta palabra clave en Windows resultará en el error 49 en tiempo de ejecución - 'convención de llamada a DLL incorrecta'. Si este procedimiento solo está destinado a ser usado en hosts de Macintosh, debe compilarse condicionalmente.
fr: Visual Basic sous Windows supporte uniquement la convention d'appel StdCall. La convention CDecl n'est supportée seulement que sur Macintosh. L'utilisation de ce mot-clé sous Windows causera l'erreur d'exécution 49 "Bad DLL calling convention". Utiliser un bloc de compilation conditionelle si cette procédure doit s'exécuter sur un Mac.
it: Le implementazioni di Windows di Visual Basic supportano solo la convenzione di chiamata StdCall. La convenzione di chiamata CDecl è supportata solo nelle versioni Macintosh di VBA. L'uso di questa parola chiave in Windows provocherà l'errore di runtime 49 - 'Convenzione di chiamata DLL non valida'. Se questa procedura deve essere utilizzata solo su host Macintosh, dovrebbe essere compilata in modo condizionale.

# ObsoleteCallStatementInspection
source: The 'Call' statement is no longer required to call procedures, and only exists in the language to support legacy code that required it; it can be safely rewritten to an implicit call.
cs: Výraz 'Call' pro volání procedur není zapotřebí a v jazyku existuje pouze pro podporu starých verzí jazyka, které jej potřebují; zde ho však můžete odstranit a volat věci implicitně.
de: Die 'Call'-Anweisung ist nicht mehr zum Aufruf einer Anweisung notwendig. Sie existiert aus Gründen der Abwärtskompatibilität. Sie kann problemlos durch einen impliziten Anweisungsaufruf ersetzt werden.
es: La declaración de 'Call' ya no es necesaria para llamar a procedimientos, y solo existe en el idioma para admitir el código heredado que lo requirió; Se puede reescribir de forma segura a una llamada implícita.
fr: Le mot-clé 'Call' n'est pas requis pour l'appel de procédures, et n'existe que pour permettre au code plus ancien de pouvoir s'exécuter; l'appel peut être réécrit sans le mot-clé.
it: L'istruzione 'Call' non è più necessaria per chiamare le procedure ed esiste nel linguaggio solo per supportare il codice legacy che lo richiedeva; può essere riscritta in modo sicuro in una chiamata implicita.
