Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/Inspections/InspectionInfo.*.resx
Languages: cs, de, es, fr, it

# ObsoleteCommentSyntaxInspection
source: The 'Rem' statement only exists in the language to support legacy code that required it; it can be safely replaced with an apostrophe / single-quote comment.
cs: Výraz 'Rem' v jazyku existuje pouze pro podporu starých verzí jazyka, které jej potřebují; zde ho však můžete bez starostí přepsat na apostrof/jednoduchou uvozovku.
de: Die 'REM'-Anweisung existiert aus Gründen der Abwärtskompatibilität. Sie kann gefahrlos durch ein einfaches Anführungszeichen ersetzt werden.
es: La declaración 'Rem' solo existe en el idioma para admitir el código heredado que lo requirió; se puede reemplazar de forma segura con un comentario de apóstrofe / comilla simple.
fr: Le mot-clé 'Rem' n'est pas requis pour commenter le code, et n'existe que pour permettre au code plus ancien de pouvoir s'exécuter; 'Rem' peut être remplacé par une simple apostrophe.
it: L'istruzione 'Rem' esiste nel linguaggio solo per supportare il codice legacy che lo richiedeva; può essere tranquillamente sostituito con un apostrofo / virgoletta singola di commento.

# ObsoleteErrorSyntaxInspection
source: The 'Error' statement only exists in the language to support legacy code that required it; prefer using 'Err.Raise' instead.
cs: Příkaz 'Error' existuje pouze v jazyce, který podporuje starší kód, který jej vyžadoval; používejte radši 'Err.Raise'.
de: Die 'Error'-Anweisung existiert in der Sprache nur um Legacy-Programme zu unterstützen, die sie benötigten; Bevorzugen Sie stattdessen 'Err.Raise'.
es: La declaración de 'Error' solo existe en el idioma para admitir el código heredado que lo requirió; use 'Err.Raise' en su lugar.
fr: L'instruction 'Error' n'existe que pour permettre au code plus ancien de pouvoir s'exécuter; 'Error' peut être remplacé par 'Err.Raise'.
it: L'istruzione 'Error' esiste nel linguaggio solo per supportare il codice legacy che lo richiedeva; è meglio invece usare 'Err.Raise'.

# ObsoleteGlobalInspection
source: The 'Global' keyword only exists in the language to support legacy code that required it; it can be safely replaced with the 'Public' modifier.
cs: Výraz 'Global' v jazyku existuje pouze pro podporu starých verzí jazyka, které jej potřebují; zde ho můžete bez starostí přepsat na modifikátor 'Public'.
de: Das Schlüsselwort 'Global' existiert aus Gründen der Abwärtskompatibilität. Es kann gefahrlos durch 'Public' ersetzt werden.
es: La palabra clave 'Global' solo existe en el idioma para admitir el código heredado que lo requería; Puede ser reemplazado de forma segura con el modificador 'Public'.
fr: Le mot-clé 'Global' n'existe que pour permettre au code plus ancien de pouvoir s'exécuter; 'Global' peut être remplacé par 'Public'.
it: La parola chiave 'Global' esiste nel linguaggio solo per supportare il codice legacy che la richiedeva; può essere tranquillamente sostituita con il modificatore 'Public'.

# ObsoleteLetStatementInspection
source: The 'Let' statement only exists in the language to support legacy code that required it; it can be safely removed, since modern VBA does not require that keyword for value assignments.
cs: Výraz 'Let' v jazyku existuje pouze pro podporu starých verzí jazyka, které jej potřebují; zde ho můžete bez starostí smazat, protože moderní VBA nepotřebuje klíčové slovo pro přidělení hodnot.
de: Die 'Let'-Anweisung existiert aus Gründen der Abwärtskompatibilität. Sie kann gefahrlos entfernt werden, da das moderne VBA dieses Schlüsselwort nicht mehr zur Werte-Zuweisung benötigt.
es: La declaración 'Let' solo existe en el idioma para admitir el código heredado que lo requería; se puede eliminar de forma segura, ya que el VBA moderno no requiere esa palabra clave para las asignaciones de valor.
fr: Le mot-clé 'Let' n'est pas requis pour assigner une valeur, et n'existe que pour permettre au code plus ancien de pouvoir s'exécuter; 'Let' peut être tout simplement supprimé.
it: L'istruzione 'Let' esiste nel linguaggio solo per supportare il codice legacy che lo richiedeva; può essere rimossa in modo sicuro, poiché il VBA moderno non richiede quella parola chiave per le assegnazioni di valore.

# ObsoleteMemberUsageInspection
source: This member is marked '@Obsolete'. It should no longer be used, there should be a better alternative.
cs: Tato metoda je označena jako '@Obsolete'. Neměla by být nadále používána, měla by existovat lepší alternativa.
de: Dieses Element ist als '@Obsolete' markiert. Er sollte nicht länger verwendet werden: eine bessere Alternative müsste existieren.
es: Este miembro está marcado '@Obsolete'. Ya no se debe usar, debería haber una mejor alternativa.
fr: Ce membre est marqué '@Obsolete'. Il ne devrait plus ètre utilisé, une approche alternative devrait exister.
it: Questo membro è contrassegnato come '@Obsolete'. Non dovrebbe più essere utilizzato, dovrebbe esserci un'alternativa migliore.

# ObsoleteTypeHintInspection
source: Type hint characters only exist in the language to support legacy code that required it; they can be safely replaced in declarations with an "As" type clause that specifies the type explicitly, and they can be omitted in other identifier references.
cs: Type nápovědní písmena v jazyku existují jen pro podporu zastaralého kódu, který je vyžaduje; můžou být bez obav nahrazeny deklaracemi jako "As", které specifikují typ explicitně a mohou být vynechány v jiných referencích identifikátoru.
de: Die Verwendung der Typ-Buchstaben (z.B. $) existiert aus Gründen der Abwärtskompatibilität. Sie kann gefahrlos durch eine 'As'-Typdeklaration ersetzt werden.
es: Los caracteres de sugerencia de tipo solo existen en el idioma para admitir el código heredado que lo requirió; se pueden reemplazar de forma segura en declaraciones con una cláusula de tipo "As" que especifica el tipo explícitamente y se pueden omitir en otras referencias de identificador.
fr: Les indicateurs de type n'existent que pour permettre au code plus ancien de pouvoir s'exécuter, et peuvent être remplacés dans les déclarations par une clause 'As' qui spécifie un type explicitement; ils peuvent généralement être tout simplement omis partout ailleurs.
it: I caratteri di suggerimento del tipo esistono nel linguaggio solo per supportare il codice legacy che lo richiedeva; possono essere tranquillamente sostituiti nelle dichiarazioni con una clausola di tipo "As" che specifica esplicitamente il tipo e possono essere omessi in altri riferimenti a identificatori.

# ObsoleteWhileWendStatementInspection
source: 'While...Wend' loops exist for backward compatibility and have been superseded by the introduction of 'Do While...Loop' blocks, which support the 'Exit Do' exit statement. 'While...Wend' loops cannot be exited other than fulfilling the 'While' condition.
cs: Smyčky 'While...Wend' existují pro zpětnou kompatibilitu a byly nahrazeny zavedením bloků 'Do While...Loop', které podporují příkaz 'Exit Do'. Smyčky 'While...Wend' nelze ukončit jinak než splněním podmínky 'While'.
de: 'While...Wend'-Schleifen sind aus Gründen der Abwärtskompatibilität vorhanden und wurden durch die Einführung von 'Do While...Loop'-Blöcken ersetzt, die die 'Exit Do'-Exit-Anweisung unterstützen. 'While...Wend'-Schleifen können nur beendet werden, wenn die 'While'-Bedingung erfüllt ist.
fr: Les boucles 'While...Wend' existent pour compatibilité avec les anciennes versions de VB, et ont été remplaçées par l'introduction des structures itératives 'Do While...Loop', qui supportent l'instruction 'Exit Do'. Les boucles 'While...Wend' ne peuvent être terminées qu'en remplissant la condition de l'expression 'While'.
it: I cicli 'While ... Wend' esistono per compatibilità con le versioni precedenti e sono stati sostituiti dall'introduzione dei blocchi 'Do While ... Loop', che supportano l'istruzione di uscita 'Exit Do'. Non è possibile uscire dai cicli 'While ... Wend' se non soddisfacendo la condizione 'While'.

# OnErrorGoToMinusOneInspection
source: While this is legal, this is poorly documented "feature" that means something different -- the error state is also cleared in addition to disabling any error handling. However, this can be ambiguous as a negative line label of -1 may end up as a target and excessively complex error handling usually indicates a need of refactoring the procedure.
cs: I když je tato "funkce" legální, je velmi špatně zdokumentována a dělá něco úplně jiného -- chybový stav je také vyčištěn a ještě k tomu je vypnuto jakékoli řešení chyb. Toto může být nejednoznačné, protože záporný řádek -1 může skončit jako cíl pro nadměrně složité zpracování chyb, které většinou potřebuje refaktorování procedury.
de: Hierbei handelt es sich um ein schlecht dokumentiertes Feature: Im Normallfall wird der Fehlerspeicher geleert und jegliche Fehlerbehandlung deaktiviert. Sollte allerdings -1 als Zeilennummer vorhanden sein, kann diese als Marker der zu verwendenden Fehlerbehandlung interpretiert werden.
es: Si bien esto es legal, se trata de una "característica" mal documentada que significa algo diferente: el estado de error también se borra además de deshabilitar cualquier manejo de errores. Sin embargo, esto puede ser ambiguo, ya que una etiqueta de línea negativa de -1 puede terminar como un objetivo y un manejo de errores excesivamente complejo generalmente indica la necesidad de refactorizar el procedimiento.
fr: Bien que légale, cette syntaxe a un effet peu documentée -- toute erreur courante est supprimée, en plus de désactiver la gestion d'erreurs. L'instruction peut également être ambiguë, si la procédure contient effectivement une ligne -1. La stratégie de gestion d'erreurs semble plus complexe que nécessaire et pourrait être à revoir.
it: Sebbene ciò sia legale, questa è una "caratteristica" scarsamente documentata che significa qualcosa di diverso -- anche lo stato di errore viene cancellato oltre a disabilitare qualsiasi gestione degli errori. Tuttavia, questo può essere ambiguo in quanto un'etichetta di riga negativa di -1 può finire come obiettivo e una gestione degli errori eccessivamente complessa di solito indica la necessità di refactoring della procedura.

# OnLocalErrorInspection
source: On Local Error exists only for compatibility with previous versions of Visual Basic, and all Errors are treated as Local regardless of the On Local Error statement. Use of this keyword inaccurately gives the impression that there is a distinction between types of error handling when there is not.
cs: Chyba 'On Local Error' existuje pouze kvůli kompatibilitě s předchozími verzemi Visual Basic a se všemi chybami je zacházeno jako s Lokálními. Chybné použití tohoto klíčového slova může navodit dojem, že existuje rozdíl mezi typy zpracování chyb a přitom nic takového není.
de: Die 'On Local Error'-Direktive existiert nur, um Kompatibilität zu vorigen Versionen von Visual Basic zu wahren. Alle Fehler werden unabhängig von der 'On Local Error'-Direktive als lokale Fehler behandelt. Die Verwendung dieser Direktive vermittelt irrtümlich den Eindruck, es existierten unterschiedliche Fehlerbehandlungstypen.
es: On Local Error existe solo por compatibilidad con versiones anteriores de Visual Basic, y todos los errores se tratan como locales, independientemente de la declaración de On Local Error. El uso incorrecto de esta palabra clave da la impresión de que existe una distinción entre los tipos de manejo de errores cuando no existe.
fr: 'On Local Error' subsiste pour fins de compatibilité avec d'anciennes versions de Visual Basic; toutes les erreurs sont locales. Utiliser ce mot-clé peut donner la fausse impression que plusieurs types d'erreurs et/ou de gestion d'erreurs existent, ce qui n'est pas le cas.
it: On Local Error esiste solo per compatibilità con le versioni precedenti di Visual Basic e tutti gli errori vengono considerati come locali indipendentemente dall'istruzione On Local Error. L'uso improprio di questa parola chiave dà l'impressione che esista una distinzione tra i tipi di gestione degli errori mentre in realtà non esiste.

# OptionBaseInspection
source: Arrays are typically zero-based. This option changes the default lower boundary for implicitly-sized arrays, which can introduce off-by-one errors if one isn't cautious.
cs: Pole typicky začínají nulou. Tato volba změní výchozí spodní hranici pro implicitně definované pole. To může zavést "mimo-o-jednu" typ chyby, pokud na to člověk nedá pozor.
de: Arrays sind normalerweise null-basiert. Diese Option ändert die untere Standardgrenze für impliziert erzeugte Arrays. Dies kann einen 'off-by-one' Fehler erzeugen, wenn sie nicht sorgsam eingesetzt wird.
es: Las matrices son típicamente basadas en cero. Esta opción cambia el límite inferior predeterminado para arreglos de tamaño implícito, que pueden introducir errores off-by-one si uno no es cauteloso.
fr: La limite inférieure des tableaux est typiquement zéro. Cette option change la limite inférieure des tableaux implicitement spécifiés, ce qui peut facilement introduire des erreurs ("off-by-one") par inadvertance.
it: Gli array sono in genere a base zero. Questa opzione modifica il limite inferiore predefinito per gli array di dimensioni implicite e può introdurre errori off-by-one se non si è cauti.

# OptionBaseZeroInspection
source: This is the default setting, it does not need to be specified.
cs: Toto je výchozí nastavení, není třeba jej specifikovat.
de: Dies ist die Standardeinstellung, sie muss nicht spezifiziert werden.
es: Esta es la configuración predeterminada, no es necesario especificarla.
fr: Comme il s'agit du comportement par défaut, nul besoin de le spécifier.
it: Questa è l'impostazione predefinita, non è necessario specificarla.

# OptionExplicitInspection
source: VBA will happily compile a typo: use 'Option Explicit' to prevent successfully compiling an erroneous program.
cs: VBA s úsměvem na tváři zkompiluje typovou chybu: použijte 'Option Explicit', abyste předešli úspěšné kompilaci programu s chybami.
de: VBA kompiliert ohne ohne 'Option Explicit` auch Tippfehlern erfolgreich: Verwenden Sie 'Option Explicit', um zu verhindern, dass ein fehlerhaftes Programm erfolgreich kompiliert wird.
es: VBA alegremente compilará un error tipográfico: use 'Option Explicit' para evitar compilar con éxito un programa erróneo.
fr: VBA n'aura aucun problème à compiler une erreur typographique: utilisez 'Option Explicit' pour prévenir la compilation d'un programme erroné.
it: VBA compilerà tranquillamente un errore di battitura: usa 'Option Explicit' per impedire la corretta compilazione di un programma errato.

# ParameterCanBeByValInspection
source: A parameter that is passed by reference and isn't assigned a new value/reference, could be passed by value instead.
cs: Parametr, který je předán jako reference 'ByRef' a není mu přidělena nová hodnota/reference, může být místo toho předán jako hodnota 'ByVal'.
de: Ein Parameter der als Referenz übergeben wird, aber keine neue Wert- oder Referenzzuweisung erhält, sollte als Wert übergeben werden.
es: Un parámetro que se pasa por referencia y no se le asigna un nuevo valor / referencia, podría pasarse por valor en su lugar.
fr: Un paramètre qui est passé par référence (ByRef) et qui n'est pas assigné, peut être passé par valeur (ByVal).
it: Un parametro che viene passato per riferimento e a cui non è assegnato un nuovo valore / riferimento, potrebbe invece essere passato per valore.

# ParameterNotUsedInspection
source: A parameter is passed into a member that does not use it. Consider removing that parameter.
cs: Parametr je předán členu, který jej nevyužívá. Zvažte odstranění tohoto parametru.
de: Ein Parameter, der der Methode übergeben wird, wird nicht verwendet. Erwäge diesen zu entfernen.
es: Un parámetro se pasa a un miembro que no lo usa. Considere eliminar ese parámetro.
fr: Un paramètre est fourni à un membre qui ne l'utilise pas. Considérez supprimer ce paramètre.
it: Un parametro viene passato a un membro che non lo utilizza. Considera l'idea di rimuovere quel parametro.

# ProcedureCanBeWrittenAsFunctionInspection
source: A procedure that only has one parameter passed by reference that is assigned a new value/reference before the procedure exits, is using a ByRef parameter as a return value: consider making it a function instead.
cs: Procedura, které je způsobem 'ByRef' předán pouze jediný parametr, kterému je před ukončením procedury přiřazena nová hodnota/reference, používá tento ByRef parametr jako návratovou hodnotu: zvažte, zda místo toho nepoužít funkci.
de: Eine Prozedur, die nur einen Parameter als Referenz übergibt, der vor dem Verlassen der Prozedur einen neuen Wert oder Referenz erhält, sollte als Funktion umgeschrieben werden.
es: Un procedimiento que solo tiene un parámetro pasado por referencia al que se le asigna un nuevo valor / referencia antes de que finalice el procedimiento, está utilizando un parámetro ByRef como valor de retorno: en su lugar, considere convertirlo en una función.
fr: Une procédure qui n'a qu'un seul paramètre passé par référence, qui est assigné à une nouvelle valeur dans cette procédure, utilise un paramètre ByRef comme valeur de retour: considérez plutôt une fonction.
it: Una procedura che ha un solo parametro passato per riferimento a cui viene assegnato un nuovo valore / riferimento prima che la procedura termini, utilizza un parametro ByRef come valore di ritorno: considera invece di renderla una funzione.

# ProcedureNotUsedInspection
source: Rubberduck could not find any caller for a procedure. If the procedure is hooked to a macro-button, used as a user-defined function (UDF) or handles an application event that Rubberduck didn't know of you can safely ignore this inspection result; otherwise, consider removing it.
cs: Rubberduck nebyl schopen najít žádné volání pro tuto proceduru. Tuto inspekci můžete ignorovat, pokud je procedura přiřazena některému makro tlačítku, použita jako 'user-defined' funkce (UDF) nebo obstarává událost aplikace, o které Rubberduck neví. Pokud se nejedná o žádnou z těchto věcí, zvažte odstranění procedury.
de: Rubberduck kann keinen Aufruf für die Prozedur finden. Falls diese über eine Markro-Schaltfläche, als benutzerdefinierte Funktion oder als Event-Handler genutzt wird, den Rubberduck nicht kennt, kann dieser Hinweis ignoriert werden. Ansonsten sollte sie entfernt werden.
es: Rubberduck no pudo encontrar ninguna llamada para el procedimiento. Si el procedimiento está conectado a un botón macro, se utiliza como una función definida por el usuario (UDF) o maneja un evento de aplicación que Rubberduck no sabía que puede ignorar este resultado de la inspección; De lo contrario, considere eliminarlo.
fr: Rubberduck n'a pu trouver aucun appelant pour la procédure. Si cette procédure est attachée à un bouton ou une macro, ou utilisée comme une fonction définie par l'utilisateur, ou répond à un événement que Rubberduck n'a pas vu, vous pouvez ignorer ce résultat. Sinon, considérez supprimer la procédure.
it: Rubberduck non è riuscito a trovare alcun chiamante per una procedura. Se la procedura è agganciata a un macro-pulsante, usata come funzione definita dall'utente (UDF) o gestisce un evento dell'applicazione che Rubberduck non conosceva, puoi tranquillamente ignorare questo risultato dell'ispezione; in caso contrario, valutare la possibilità di rimuoverla.

# ProcedureRequiredInspection
source: The VBA compiler does not raise an error if an object variable is used in a place that requires a procedure and the object's declared type does not have a suitable default member. Under almost all circumstances, this leads to a run-time error 91 'Object or With block variable not set' or 438 'Object doesn't support this property or method' depending on whether the object has the value 'Nothing' or not, which is harder to detect and indicates a bug.
cs: Kompilátor VBA nezpůsobí chybu, pokud je proměnná objektu použita na místě, které vyžaduje proceduru a deklarovaný typ objektu nemá vhodný výchozí člen. Toto vede téměř za všech okolností k run-time chybě 91 'Object or With block variable not set' nebo chybě 438 'Object doesn't support this property or method' v závislosti na tom, zda má objekt hodnotu 'Nothing' nebo ne. Toto je těžké detekovat a indikuje to tedy chybu.
de: Der VBA-Compiler gibt keinen Fehler aus, wenn eine Objektvariable an einer Stelle verwendet wird, die eine Prozedur erfordert, und der deklarierte Type des Objekts kein passendes Standardelement hat. In fast allen Fällen führt dies zu einem Laufzeitfehler 91 'Objektvariable oder With-Blockvariable nicht festgelegt' oder 438 'Objekt unterstützt diese Eigenschaft oder Methode nicht' abhängig davon, ob die Variable den Wert 'Nothing' hat oder nicht, der schwerer zu entdecken ist und auf einen Programmierfehler hinweist.
fr: VBA n'indiquera pas d'erreur au moment de la compilation si un objet est utilisé à un endroit qui requerrait un appel de procédure, et que le type de l'objet utilisé ne définit pas de membre par défaut avec un type compatible. Dans la presque totalité des cas ceci causera une erreur à l'exécution. Pour tous les autres cas, un type compatible doit être utilisé.
it: Il compilatore VBA non genera un errore se una variabile oggetto viene utilizzata in un punto che richiede una procedura e il tipo dichiarato dell'oggetto non dispone di un membro predefinito appropriato. In quasi tutte le circostanze, questo porta a un errore di runtime 91 'Oggetto o variabile del blocco With non impostata' o 438 'L'oggetto non supporta questa proprietà o metodo' a seconda che l'oggetto abbia il valore 'Nothing' o meno, che è più difficile da rilevare e indica un bug.

# RedundantByRefModifierInspection
source: By default, all parameters are passed by reference, so it is not necessary to include the 'ByRef' modifier.
cs: Ve výchozím nastavení jsou všechny parametry předávány referencí, takže není nutné uvádět 'ByRef' modifikátor.
de: Alle Parameter werden, falls nicht anders spezifiziert als Referenz übergeben. Es ist also nicht nötig, die 'ByRef'-Markierung zu verwenden.
es: De forma predeterminada, todos los parámetros se pasan por referencia, por lo que no es necesario incluir el modificador 'ByRef'.
fr: Les paramètres sont passés par référence par défaut; il n'est donc pas nécessaire d'inclure le modificateur 'ByRef'.
it: Per impostazione predefinita, tutti i parametri vengono passati per riferimento, quindi non è necessario includere il modificatore 'ByRef'.

# RedundantOptionInspection
source: Being the default/implicit setting for this option, this instruction can be safely omitted.
cs: Protože je pro tuto možnost nastaveno výchozí/implicitní nastavení, může být tato instrukce bezpečně vynechána.
de: Da dies die Standardeinstellung für diese Option ist, kann die Anweisung ohne Nebeneffekte entfernt werden.
fr: Cette instruction correspondant aux paramètres par défaut et peut être supprimée sans effet.
it: Essendo l'impostazione predefinita/implicita per questa opzione, questa istruzione può essere tranquillamente omessa.
