Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/Inspections/InspectionInfo.*.resx
Languages: cs, de, es, fr, it

# ValueRequiredInspection
source: The VBA compiler does not raise an error if an object is used in a place that requires a value type and the object's declared type does not have a suitable default member. Under almost all circumstances, this leads to a run-time error 91 'Object or With block variable not set' or 438 'Object doesn't support this property or method' depending on whether the object has the value 'Nothing' or not, which is harder to detect and indicates a bug.
cs: Kompilátor VBA nezpůsobí chybu, pokud je objekt použit na místě, které vyžaduje typ 'hodnota' a deklarovaný typ objektu nemá vhodný výchozí člen. Toto vede téměř za všech okolností k run-time chybě 91 'Object or With block variable not set' nebo chybě 438 'Object doesn't support this property or method' v závislosti na tom, zda má má objekt hodnotu 'Nothing' nebo ne. Toto je těžké detekovat a indikuje to tedy chybu.
de: Der VBA-Compiler gibt keinen Fehler aus, wenn ein Objekt an einer Stelle verwendet wird, die einen Wert verlangt, und der deklarierte Type des Objekts keinen passendes Standardelement hat. In fast allen Fällen führt dies zu einem Laufzeitfehler 91 'Objektvariable oder With-Blockvariable nicht festgelegt' oder 438 'Objekt unterstützt diese Eigenschaft oder Methode nicht' abhängig davon, ob die Variable den Wert 'Nothing' hat oder nicht, der schwerer zu entdecken ist und auf einen Programmierfehler hinweist.
fr: VBA n'indiquera pas d'erreur au moment de la compilation si un objet est utilisé à un endroit qui requerrait une valeur et que le type de l'objet utilisé ne définit pas de membre par défaut avec un type compatible. Dans la presque totalité des cas ceci causera une erreur à l'exécution. Pour tous les autres cas, un type compatible doit être utilisé.
it: Il compilatore VBA non genera un errore se un oggetto viene utilizzato in una posizione che richiede un tipo di valore e il tipo dichiarato dell'oggetto non dispone di un membro predefinito appropriato. In quasi tutte le circostanze, questo porta a un errore di runtime 91 'Oggetto o variabile del blocco With non impostata' o 438 'L'oggetto non supporta questa proprietà o metodo' a seconda che l'oggetto abbia il valore 'Nothing' o meno, che è più difficile da rilevare e indica un bug.

# VariableNotAssignedInspection
source: Variable is not assigned. If this isn't intended, there's probably a bug. Ignore this inspection result if the variable is assigned in another procedure via a ByRef parameter.
cs: Proměnná není přiřazena. Pokud to není záměrem, jedná se pravděpodobně o bug. Ignorujte výsledek této kontroly, pokud je proměnná přiřazena v jiné proceduře pomocí ByRef parametru.
de: Einer Variable wird kein Wert zugewiesen. Falls das nicht beabsichtigt ist, kann das zu einem Fehler führen. Ignorieren Sie diese Warnung, falls die Variable in einer anderen Prozedur durch einen 'ByRef'-Parameter zugewiesen wird.
es: La variable no está asignada. Si esto no es intencional, probablemente hay un error. Ignore este resultado de la inspección si la variable se asigna en otro procedimiento a través de un parámetro ByRef.
fr: Une variable n'est pas assignée. Si ceci n'est pas intentionnel, il s'agit probablement d'un bogue. Ignorez ce résultat d'inspection si la variable est passée par référence à une procédure.
it: La variabile non è assegnata. Se questo non è previsto, probabilmente c'è un bug. Ignorare questo risultato dell'ispezione se la variabile viene assegnata in un'altra procedura tramite un parametro ByRef.

# VariableNotUsedInspection
source: Variable is not referred to
cs: Neexistují žádné reference k proměnné
de: Variable wird nicht gelesen
es: La variable no es referida
fr: Une variable est déclarée, mais rien n'y réfère
it: La variabile non ha riferimenti

# VariableTypeNotDeclaredInspection
source: A variable whose type isn't explicitly declared, is implicitly 'Variant'. Consider making it an explicit 'Variant' if that's intended, or declare a more specific type.
cs: Proměnná, jejíž typ není explicitně deklarován, je implicitně typu 'Variant'. Pokud to byl váš úmysl, zvažte explicitní deklarování typu 'Variant', nebo deklarujte specifičtější typ.
de: Variable, deren Typ nicht explizit deklariert wurde, erhält implizit den Typ 'Variant'. Überlege die Variable explizit als 'Variant' zu definieren oder eine besseren Typ zu zuweisen.
es: Una variable cuyo tipo no se declara explícitamente, es implícitamente 'Variant'. Considere convertirlo en una 'Variant' explícita si está destinada, o declare un tipo más específico.
fr: Une variable dont le type n'est pas déclaré explicitement, est implicitement de type 'Variant'. Considérez spécifier un type explicitement.
it: Una variabile il cui tipo non è dichiarato esplicitamente è implicitamente 'Variant'. Considera l'idea di renderla una 'Variant' esplicita, se previsto, o di dichiarare un tipo più specifico.

# WriteOnlyPropertyInspection
source: A property that exposes a mutator but no accessor is a design smell and makes a confusing API. Consider exposing a getter, or converting the mutator to a method.
cs: Vlastnost, která exponuje mutátor, avšak žádný accessor, designově smrtí a vytváří matoucí API rozhraní. Zvažte exponování getteru, nebo zkonvertování mutátoru na metodu.
de: Eine Eigenschaft, die eine Änderungsfunktion, aber keine Zugriffsfunktion bereitstellt, führt zu einer unklaren API. Enweder erstelle einen öffentlichen getter oder ändere die Änderungsfunktion in eine Methode ab.
es: Una propiedad que expone un mutador pero que no tiene acceso es un error de diseño y crea una API confusa. Considere la posibilidad de exponer un captador o convertir el mutador en un método.
fr: Une propriété qui expose un mutateur (Let/Set) mais aucun accesseur (Get) constitue généralement un mauvais API. Considérez exposer un accesseur, ou convertissez le mutateur en méthode.
it: Una proprietà che espone un mutatore ma nessuna funzione di accesso è indice di errore nella struttura e crea un'API confusa. Considera l'idea di esporre un getter o di convertire il mutatore in un metodo.

# UseMeaningfulNameInspection
source: Identifier names should indicate what they're used for and should be readable; avoid disemvoweling, numeric suffixes, and 1-2 character names.
cs: Názvy identifikátorů by měly uvádět, pro co jsou používány a měly by být čitelné; vyvarujte se 'disemvowellingu' (odstranění samohlásek), číselných příponám a jménům o délce 1-2 písmen.
de: Bezeicher sollten lesbar sein und ihren Verwendungszweck widerspiegeln. Bezeichner ohne Vokale, mit nummerischem Suffix oder nur 1-2 Buchstaben sollten vermieden werden.
es: Los nombres de los identificadores deben indicar para qué se usan y deben ser legibles; evitar el desmontaje, los sufijos numéricos y los nombres de 1 o 2 caracteres.
fr: Les identifiants devrait indiquer ce pour quoi ils sont utilisés, devraient être lisibles; évitez de suprimer les voyelles, évitez les suffixes numériques, et les noms de 1-2 caractères.
it: I nomi degli identificatori dovrebbero indicare per cosa sono usati e dovrebbero essere leggibili; evitare di togliere tutte le vocali, suffissi numerici e nomi di 1-2 caratteri.

# InvalidAnnotationInspection
source: The annotation could not be bound to a target. Is the annotation misplaced? An annotation meant to be specified at module level cannot be used to annotate members; conversely, annotations meant to be annotate members cannot be used at module level.
cs: Anotaci nelze navázat na požadovaný cíl. Má zde anotace být? Anotaci, kterou je třeba specifikovat na úrovni modulu, nelze použít k anotaci členů; naopak, anotaci, kterou jsou specifikovány členy, nelze použít na úrovni modulu.
de: Die Annotation konnte keinem Ziel zugewiesen werden. Eine Annotation für die Modulebene kann nicht verwendet werden, um Elemente zu annotieren. Eine Annotation für Elemente kann auf Modulebene nicht verwendet werden. Modul- und Elementannotationen sollten nur einmal spezifiziert werden.
fr: L'annotation n'a pu être liée à une cible. Une annotation ciblant un module ne peut être utilisée pour une méthode; une annotation destinée à un membre ne peut être utilisée pour un module.
it: Non è stato possibile associare l'annotazione a una destinazione. L'annotazione è fuori posto? Un'annotazione destinata a essere specificata a livello di modulo non può essere utilizzata per annotare i membri; al contrario, le annotazioni intese come annotazioni di membri non possono essere utilizzate a livello di modulo.

# AnnotationInIncompatibleComponentTypeInspection
source: An annotation was specified in a module of a type that isn't compatible with that annotation. Some annotations can only be used in a module of a specific type; others cannot be used in modules of certain types.
cs: V typu modulu, ve kterém není možno specifikovat anotaci, byla specifikována anotace. Některé anotace lze použít pouze u specifických typech modulů. U jiných toto nelze.
de: Eine Annotation wurde in einer Komponente mit einem zu dieser inkompatiblen Typ verwendet. Manche Annotationen können nur in Komponenten eines spezifischen Typs verwendet werden, andere wiederum nicht in Komponenten bestimmter Typen.
fr: Une annotation est spécifiée dans un module d'un type qui n'est pas compatible avec cette annotation. Certaines annotations peuvent seulement être utilisées dans certains types de modules.
it: È stata specificata un'annotazione in un modulo di un tipo che non è compatibile con tale annotazione. Alcune annotazioni possono essere utilizzate solo in un modulo di un tipo specifico; altre non possono essere utilizzate in moduli di determinati tipi.

# UnrecognizedAnnotationInspection
source: A comment was parsed as a syntactically valid annotation, but not recognized as a supported annotation type.
cs: Komentář byl parsován jako syntakticky platná anotace, ale nebyl rozpoznán jako podporovaný typ anotace.
de: Ein Kommentar wurde als eine syntaktisch zulässige Annotation erkannt, doch kein unterstützter Annotationstyp konnte erkannt werden.
fr: Un commentaire correspond à la syntaxe pour une annotation valide, mais ne correspond à aucunne annotation supportée.
it: Un commento è stato analizzato come annotazione sintatticamente valida, ma non riconosciuto come tipo di annotazione supportato.

# IIfSideEffectInspection
source: All arguments of any function/procedure call are always evaluated before the function is invoked so that their respective values can be passed as parameters. Even so, the IIf Function's behavior is sometimes mis-interpreted to expect that ONLY the 'TruePart' or ONLY the 'FalsePart' expression will be evaluated based on the result of the first argument expression. Consequently, the IIf Function can be a source of unanticipated side-effects and errors if the user does not account for the fact that both the TruePart and FalsePart arguments are always evaluated.
de: Alle Argumente eines Funktions-/Prozeduraufrufes werden immer evaluiert, bevor die Funktion aufgerufen wird, so dass ihre Werte als Parameter übergeben werden. Allerdings führt die 'IIf'-Funktion manchmal zu einer Fehlinterpretation, dass entweder nur der 'Wahr-Teil' oder nur der 'Falsch-Teil' auf der Basis des ersten Argumentes ausgewertet wird. Somit kann die 'IIf'-Funktion eine Quelle von unvorhergesehen Nebeneffekten und Fehlern sein, wenn der Nutzer den Umstand nicht vor Augen hat, dass immer beide Argumente, 'Wahr-Teil' und 'Falsch-Teil', ausgewertet werden.
it: Tutti gli argomenti di qualsiasi chiamata di funzione/procedura sono sempre valutati prima che la funzione sia invocata in modo che i rispettivi valori possano essere passati come parametri. Comunque, il comportamento della funzione IIf a volte viene frainteso credendo che SOLO l'espressione 'ParteVera' o SOLO l'espressione 'ParteFalsa' venga valutata in base al risultato della prima espressione di argomento. Di conseguenza, la funzione IIf può essere una fonte di effetti collaterali ed errori imprevisti se l'utente non tiene conto del fatto che entrambi gli argomenti ParteVera e ParteFalsa sono sempre valutati.

# PublicControlFieldAccessInspection
source: MSForms exposes UserForm controls as public fields; accessing these fields outside the UserForm class breaks encapsulation and needlessly couples code with specific form controls. Consider encapsulating the desired values into their own 'model' class, making event handlers in the form manipulate these 'model' properties, and then the calling code can query this encapsulated state instead of querying form controls.
de: MS Forms legt UserForms-Steuerelemente als öffentliche Felder an. Der Zugriff auf diese Felder außerhalb der UserForm-Klasse bricht die Kapselung und verursacht unnötigen Code mit speziellen Formularsteuerelementen. Überlege, die gewünschten Werte in eigene 'Modell-Klassen' zu kapseln und Ereignishandler innerhalb des Formulars zu verwenden, um diese 'Modelleigenschaften' zu ändern. Der Code kann dann die gekapselten Werte anfragen anstatt der Formularsteuerelemente.
it: MSForms espone i controlli UserForm come campi pubblici; l'accesso a questi campi al di fuori della classe UserForm rompe l'incapsulamento e accoppia inutilmente il codice a controlli su maschera specifici. Considerare di incapsulare i valori desiderati nella propria classe 'modello', facendo in modo che i gestori di eventi nella maschera manipolino queste proprietà del 'modello' e quindi il codice chiamante possa interrogare questo stato incapsulato invece di interrogare i controlli della maschera.

# ReadOnlyPropertyAssignmentInspection
source: In general, the VBE editor catches this type of error and will not compile. However, there are a few scenarios where the error is overlooked by the compiler and an error is generated at runtime. To avoid a runtime error, implement the missing Property or Subroutine.
de: Normalerweise fängt der VBE Editor diesen Fehlertyp und bricht das Kompilieren ab. Allerdings gibt es einige wenige Szenarien, in denen dieser Fehler übergangen und ein Laufzeitfehler ausgelöst wird. Um den Laufzeitfehler zu vermeiden, sollte die fehlende Property oder Subroutine implementiert werden.
it: In generale, l'editor VBE rileva questo tipo di errore e non compila. Tuttavia, esistono alcuni scenari in cui l'errore è ignorato dal compilatore ed è generato un errore in fase di esecuzione. Per evitare un errore durante l'esecuzione, implementare la Proprietà o la Subroutine mancante.

# SuspiciousPredeclaredInstanceAccessInspection
source: While a stateful default instance might be intentional, it is a common source of bugs and should be avoided. Use the 'Me' qualifier to explicitly refer to the current instance and eliminate any ambiguity.
de: Obwohl eine zustandsorientierte (stateful) Standardinstanz eventuell gewünscht ist, ist diese eine beliebte Quelle von Fehlern und sollte vermieden werden. Nutze die 'Me'-Auszeichnung, um die aktuelle Instanz explizit anzusprechen und Zweideutigkeiten zu vermeiden.
it: Sebbene un'istanza predefinita potrebbe essere intenzionale, è una fonte comune di bug e dovrebbe essere evitata. Utilizza il qualificatore 'Me' per fare riferimento esplicitamente all'istanza corrente ed eliminare qualsiasi ambiguità.

# PublicEnumerationDeclaredInWorksheetInspection
source: Copying a worksheet which contains a public Enum declaration will also create a copy of the Enum declaration. The copied declaration will result in an 'Ambiguous name detected' compiler error. Declaring Enumerations in Standard or Class modules avoids unintentional duplication of an Enum declaration.
de: Das Kopieren eines Arbeitsblattes, das eine öffentliche Enumerationsdeklartion enthält, wird auch eine Kopie der Enumerationsdeklaration anlegen. Diese Kopie wird einen 'Ambiguous name detected'-Kompiler-Fehler auslösen. Die Deklaration von Enumerationen in Standard- oder Klassenmodulen vermeidet ungewollte Duplikate einer Enumerationsdeklaration.
it: La copia di un foglio di lavoro che contiene una dichiarazione Enum pubblica creerà anche una copia della dichiarazione Enum. La dichiarazione copiata provocherà un errore del compilatore "Nome ambiguo rilevato". La dichiarazione di enumerazioni nei moduli Standard o di Classe evita la duplicazione involontaria di una dichiarazione Enum.

# UDTMemberNotUsedInspection
source: A User Defined Type (UDT) member is declared but not used. Consider removing the UDT member declaration.
de: Ein UDT (User Defined Type) Element ist deklariert, das allerdings nicht verwendet wird. Es sollte überlegt werden, die Deklaration des UDT Elementes zu löschen.
it: Un membro Tipo Definito dall'Utente è dichiarato ma non usato. Valuta la possibilità di rimuovere la dichiarazione del membro UDT.

# PublicImplementationShouldBePrivateInspection
source: The default (Public) interface of a class module should not expose the implementation of other interfaces or event handler procedures.
de: Das Standard (Public) Interface einer Modul-Klasse sollte nicht die Implementierung anderer Interfaces oder Ereignishandler offenlegen.
it: L'interfaccia predefinita (Public) di un modulo di classe non dovrebbe esporre l'implementazione di altre interfacce o procedure di gestione degli eventi.
