Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/Inspections/InspectionInfo.*.resx
Languages: cs, de, es, fr, it

# EmptyModuleInspection
source: Empty modules and classes either point to not yet implemented functionality or represent unnecessary baggage that can hurt the maintainability of a project.
cs: Prázdné moduly a třídy buďto odkazují na dosud neimplementovanou funkcionalitu, nebo představují zbytečnou zátěž, která může poškodit udržovatelnost projektu.
de: Leere Module und Klassen weisen entweder auf noch nicht implementierte Funktionalitäten hin oder stellen unnötigen Ballast dar, der die Wartbarkeit eines Projekts behindern kann.
es: Los módulos y clases vacíos apuntan a una funcionalidad aún no implementada o representan un equipaje innecesario que puede perjudicar la mantenibilidad de un proyecto.
fr: Les modules et classes vides démontrent des fonctionnalités pas encore implémentées ou représentent un fardeau non nécessaire pouvant nuire à la maintenance du projet.
it: I moduli e le classi vuoti indicano funzionalità non ancora implementate o rappresentano un bagaglio non necessario che può danneggiare la manutenibilità di un progetto.

# EmptyStringLiteralInspection
source: The built-in constant 'vbNullString' is a null string pointer taking up 0 bytes of memory, that unambiguously conveys the intent of an empty string.
cs: Vestavěná konstanta 'vbNullString' je pointer na prázdný řetězec, který si bere 0 bytů paměti, což jednoznačně vyjadřuje úmysl prázdného řetězce.
de: Die eingebaute Konstante 'vbNullString' ist ein Null-String Zeiger, der 0 bytes Arbeitsspeicher benötigt. Dies ist das beabsichtigte Verhalten eines leeren Strings.
es: La constante incorporada 'vbNullString' es un puntero de cadena nulo que ocupa 0 bytes de memoria, que transmite inequívocamente la intención de una cadena vacía.
fr: La constante 'vbNullString' est un pointeur nul de chaîne de caractères qui occupe 0 bytes de mémoire et qui transmet sans ambiguïté l'intention de représenter une chaîne de caractères vide.
it: La costante incorporata 'vbNullString' è un puntatore ad una stringa nulla che occupa 0 byte di memoria, che trasmette in modo inequivocabile l'intento di una stringa vuota.

# EmptyWhileWendBlockInspection
source: An empty 'Loop' block without any executable statements, leaves a maintainer wondering about the intent of the code. Avoid writing code that doesn't need to be written.
cs: Prázdný blok 'Loop' bez jakýchkoli spustitelných příkazů ponechává správce kódu ve zmatku, co takový kód vůbec znamená. Vyhněte se psaní kódu, který nemusí být napsán.
de: Eine leere 'While…Wend'-Schleife ohne ausführbare Anweisungen lässt andere Entwickler über die Absicht des Codes im unklaren. Vermeiden Sie das Schreiben von unnötigem Code.
es: Un bloque 'Loop' sin declaraciones ejecutables, deja a un programador preguntándose sobre la intención del código. Evite escribir código que no necesita ser escrito.
fr: Une boucle 'Loop' vide, qui ne contient aucune instruction exécutable, laisse songeur quant aux intentions de l'auteur. Évitez d'écrire du code qui n'a pas besoin d'être écrit.
it: Un blocco 'Loop' vuoto senza alcuna istruzione eseguibile, lascia un manutentore a chiedersi quale sia l'intento del codice. Evita di scrivere codice che non serve.

# EncapsulatePublicFieldInspection
source: Consider exposing a property instead.
cs: Zvažte místo toho odkrytí property.
de: Erwägen Sie stattdessen, eine Eigenschaft verfügbar zu machen.
es: En su lugar, considere hacer una propiedad disponible.
fr: Considérez exposer plutôt une propriété.
it: Considera invece di esporre una proprietà.

# ExcelMemberMayReturnNothingInspection
source: A procedure that returns an object may return 'Nothing'. That will cause a runtime error 91 - "Object variable or With block variable not set" on subsequent member access. Perform an 'Is Nothing' check after the 'Set' assignment to guard against runtime errors.
cs: Je možné, že procedura vracející objekt, může vrátit 'Nothing'. Toto způsobí runtime chybu 91 - "Proměnná objektu nebo bloku With není nastavena" u přístupu následujícího člena. Proveďte kontrolu na 'Is Nothing' po zadání 'Set', aby se těmto chybám předešlo.
de: Eine Prozedur, die ein Objekt zurückgibt, kann 'Nothing' zurückgeben. Dies wird bei darauffolgenden Elementzugriff zum Laufzeitfehler 91 - 'Objektblockvariable oder With-Blockvariable nicht festgelegt' führen. Prüfen sie mit 'Is Nothing' nach dem 'Set', um einen Laufzeitfehler auszuschließen.
es: Un procedimiento que devuelve un objeto puede devolver "Nothing". Eso causará un error 91 en tiempo de ejecución - "Variable de objeto o variable de bloque no declarada" en el acceso subsiguiente del miembro. Realice una verificación 'Is Nothing' después de la asignación 'Set' para protegerse contra los errores en tiempo de ejecución.
fr: Une procédure qui renvoie une référence à un objet peut renvoyer une référence nulle 'Nothing'. Ceci causerait l'erreur d'exécution 91 "Object variable or With block variable not set".
it: Una procedura che restituisce un oggetto può restituire 'Nothing'. Ciò causerà un errore di runtime 91 - 'Oggetto o variabile del blocco With non impostata' al successivo accesso al membro. Eseguire un controllo 'Is Nothing' dopo l'assegnazione 'Set' per evitare errori di runtime.

# ExcelUdfNameIsValidCellReferenceInspection
source: Functions that are visible to Excel as User-Defined Functions will return a '#REF!' error when used on a Worksheet if they match the name of a valid cell reference. If the function is intended to be used as a UDF, it must be renamed. If the function is not intended to be used as a UDF, it should be scoped as 'Private' or moved out of a standard Module.
cs: Funkce, které jsou pro Excel viditelné jako funkce 'definované uživatelem', vrátí chybu 'REF!', pokud jsou použity ve Worksheetu a jestli odpovídají názvu platného odkazu na buňku. Pokud je funkce zamyšlena k použití jako UDF, musí být přejmenována. Není-li tato funkce míněna jako UDF, měla by být zařazena jako 'Privátní' nebo přesunuta pryč ze standardního modulu.
de: Funktionen, die für EXCEL als benutzerdefinierte Funktionen sichtbar sind, werden einen '#REF!'-Fehler erzeugen, wenn sie in einem Arbeitsblatt verwendet werden, in dem ihr Name dem einer korrekten Zellreferenz entspricht. Wenn die Funktion als benutzerdefinierte Funktion gedacht ist, muss sie umbenannt werden. Wenn die Funktion nicht als benutzerdefinierte Funktion gedacht ist, sollte sie 'Private' deklariert oder aus einem Standardmodul herausgenommen werden.
es: Las funciones que son visibles para Excel como funciones definidas por el usuario devolverán un '#REF!' error cuando se utiliza en una hoja de trabajo si coinciden con el nombre de una referencia de celda válida. Si la función está destinada a ser utilizada como un UDF, debe cambiar su nombre. Si la función no está diseñada para ser utilizada como un UDF, debe tener un ámbito como 'Privado' o retirarse de un Módulo estándar.
fr: Les fonctions qui sont visibles en tant que fonctions définies par l'utilisateur dans Excel, renverront une erreur '#REF!' lorsqu'utilisées dans une feuille de calcul si leur nom correspond à une référence de cellule valide. Si la fonction doit être utilisée comme fonction définie par l'utilisateur, elle doit être renommée. Sinon, sa visibilité devrait être réduite à 'Private', ou alors la fonction doit être déplacée vers un autre type de module.
it: Le funzioni visibili in Excel come funzioni definite dall'utente restituiranno un errore '#REF!' quando sono utilizzate su un foglio di lavoro se corrispondono al nome di un riferimento di cella valido. Se la funzione deve essere utilizzata come UDF, deve essere rinominata. Se la funzione non è concepita per essere utilizzata come UDF, dovrebbe essere definita come 'Private' o spostata da un modulo standard.

# FunctionReturnValueAlwaysDiscardedInspection
source: A member is written as a function, but always used as a procedure. Consider converting the 'Function' into a 'Sub'.
cs: Člen je definován jako funkce, ale ve všech případech je použit jako procedura. Zamyslete se nad zkonvertováním 'Function' na 'Sub'.
de: Ein Element ist als Funktion geschrieben, wird aber überall wie eine Prozedur verwendet. Sie sollten in Erwägung ziehen die 'Function' in ein 'Sub' zu konvertieren.
fr: Un membre est défini comme étant une fonction, mais son utilisation ne diffère en rien d'une procédure 'Sub' standard. Considérez convertir cette function en procédure.
it: Un membro è scritto come una funzione, ma è sempre utilizzato come una procedura. Valuta la possibilità di convertire la 'Function' in 'Sub'.

# FunctionReturnValueDiscardedInspection
source: The return value of a function gets discarded, i.e. the function is used like a 'Sub' procedure. This is either an oversight or the function is used for its side-effects, whose existence would also be a code smell.
cs: Vrácená hodnota z funkce je zahozena, tzn. funkce je použita jako 'Sub' procedura. Toto je buď nepozornost, nebo je funkce použita pro její vedlejší účinek, což zavání špatným kódem.
de: Der Rückgabewert einer Funktion wird verworfen, d.h. die Funktion wird wie eine Prozedur verwendet. Dies ist entweder ein Versäumnis oder die Funktion wird wegen ihrer Nebenwirkungen verwendet, deren Existenz in der Regel selber problematisch wäre.
fr: La valeur renvoyée par une fonction est ignorée; la fonction est utilisée comme une procédure ('Sub'). Ceci peut être le résultat d'un simple oubli, ou alors la fonction est utilisée pour ses effets secondaires, l'existence desquels peut constituer un 'code smell'.
it: Il valore di ritorno di una funzione viene scartato, ovvero la funzione viene utilizzata come una procedura 'Sub'. O si tratta di una svista o la funzione viene utilizzata per altre finalità, la cui esistenza sarebbe anche un segnale d'allarme.

# HostSpecificExpressionInspection
source: Bracketed expressions are evaluated by the host application at runtime, which means VBA can't validate the expression at compile-time. Consider using the host application's object model instead.
cs: Závorkové výrazy jsou vyhodnoceny hostitelskou aplikací při běhu (run-time), což znamená, že je VBA nemůže v okamžiku kompilace ověřit. Zvažte místo toho využití objektového modelu hostitelské aplikace.
de: Geklammerte Ausdrücke werden von der Hostanwendung zur Laufzeit ausgewertet, was bedeutet, dass VBA den Ausdruck nicht zur Kompilierzeit validieren kann. Erwägen sie, das hostspezifische Objektmodell zu verwenden.
es: La aplicación host evalúa las expresiones entre corchetes en tiempo de ejecución, lo que significa que VBA no puede validar la expresión en tiempo de compilación. Considere usar el modelo de objetos de la aplicación host en su lugar.
fr: L'expression est évaluée par l'application hôte au moment de l'exécution, ce qui implique que VBA ne peut valider l'expression lors de la compilation. Considérez utiliser plutôt le modèle d'objet de l'application hôte.
it: Le espressioni tra parentesi vengono valutate dall'applicazione host in fase di esecuzione, il che significa che VBA non può convalidare l'espressione in fase di compilazione. Considerare invece l'utilizzo del modello a oggetti dell'applicazione host.

# HungarianNotationInspection
source: Hungarian notation makes code less readable, and is redundant when strongly typed variables and meaningful names are used.
cs: Maďarská notace způsobuje menší čitelnost kódu a je zbytečná, pokud jsou proměnné psané velmi jasnou a konkrétní formou.
de: 'Ungarische Notation' macht Code weniger lesbar und ist redundant, sobald stark typisierte Variablen und aussagekräftige Namen verwendet werden.
es: La notación húngara hace que el código sea menos legible, y es redundante cuando se usan variables fuertemente tipificadas y nombres significativos.
fr: La notation hongroise rend le code plus difficile à lire, et est redondante lorsque les variables ont un type explicite et que des identifiants éloquents sont utilisés.
it: La notazione ungherese rende il codice meno leggibile ed è ridondante quando si utilizzano variabili fortemente tipizzate e nomi significativi.

# ImplementedInterfaceMemberInspection
source: A class module that is meant to be used as interface for concrete classes should generally be abstracted of any implementations. If it is your intention to use this class module as a concrete type, you can safely ignore this inspection result.
cs: Modul třídy, který je používán jako interface pro konkrétní třídy, by měl být obecně zbaven všech implementací. Pokud je váš úmysl použít tento modul třídy jako konkrétní typ, můžete tento výsledek inspekce zvesela ignorovat.
de: Eine Klasse, die dafür gedacht ist von anderen Klassen als Interface genutzt zu werden, sollte gewöhnlicher Weise keine Implementierungen enthalten. Falls die Intention ist diese Klasse direkt als konkrete Klasse zu verwenden, kann dieses Inspektionsresultat ignoriert werden.
fr: Un module de classe dont le but est de définir une interface abstraite, ne devrait pas comporter d'implémentations. Si l'intention est effectivement d'utiliser cette class comme un type concret, veuillez ignorer ce message.
it: Un modulo di classe che deve essere utilizzato come interfaccia per classi concrete dovrebbe generalmente essere astratto da qualsiasi implementazione. Se è tua intenzione utilizzare questo modulo di classe come un tipo concreto, puoi tranquillamente ignorare questo risultato dell'ispezione.

# ImplicitActiveSheetReferenceInspection
source: Implicit references to the active sheet make the code frail and harder to debug. Consider making these references explicit when they're intended, and prefer working off object references. Ignore if the member call is referring to a type Rubberduck can't resolve.
cs: Implicitní reference na aktivní sešit dělá kód slabým a obtížnějším pro debugování. Zvažte explicitní zapisování referencí tam, kde to máte v úmyslu a upřednostňujte zpracování referencí objektů. Ignorujte, pokud volaný člen referujte k Typu, který Rubberduck nedokáže zpracovat.
de: Implizite Referenzen zum aktuellen Tabellenblatt macht den Code anfällig und schwieriger zu debuggen. Erwäge die Referenz explizit anzugeben oder vorzugsweise mit Objektreferenzen zu arbeiten. Ignoriere wenn der Methodenaufruf sich auf einen Typ bezieht, den Rubberduck nicht auflösen kann.
es: Las referencias implícitas a la hoja activa hacen que el código sea frágil y más difícil de depurar. Considere hacer estas referencias explícitas cuando estén destinadas y prefiera trabajar con referencias de objetos. Ignorar si la llamada del miembro hace referencia a un tipo que Rubberduck no puede resolver.
fr: Les références implicites à la feuille active rendent le code plus fragile et plus difficile à déboguer. Considérez rendre ces références explicites lorsqu'elles sont intentionelles, et préférez l'utilisations de références d'objets. Ignorez ce résultat si l'appel réfère à un type que Rubberduck n'a pu résoudre.
it: I riferimenti impliciti al foglio attivo rendono il codice fragile ed è più difficile eseguire il debug. Considera l'idea di rendere espliciti questi riferimenti quando sono voluti e prediligi l'uso di riferimenti agli oggetti. Ignora se la chiamata del membro si riferisce a un tipo che Rubberduck non può risolvere.

# ImplicitActiveWorkbookReferenceInspection
source: Implicit references to the active workbook make the code frail and harder to debug. Consider making these references explicit when they're intended, and prefer working off object references. Ignore if the member call is referring to a type Rubberduck can't resolve.
cs: Implicitní reference na aktivní 'workbooku' dělá kód slabým a obtížnějším pro debugování. Zvažte explicitní zapisování referencí tam, kde to máte v úmyslu a upřednostňujte zpracování referencí objektů. Ignorujte, pokud volaný člen referujte k Typu, který Rubberduck nedokáže zpracovat.
de: Implizite Referenzen zur aktuellen Arbeitsmappe macht den Code anfällig und schwieriger zu debuggen. Erwäge die Referenz explizit anzugeben oder vorzugsweise mit Objektreferenzen zu arbeiten. Ignoriere wenn der Methodenaufruf sich auf einen Typ bezieht, den Rubberduck nicht auflösen kann.
es: Las referencias implícitas al libro de trabajo activo hacen que el código sea frágil y más difícil de depurar. Considere hacer estas referencias explícitas cuando estén destinadas y prefiera trabajar con referencias de objetos. Ignorar si la llamada del miembro hace referencia a un tipo que Rubberduck no puede resolver.
fr: Les références implicites au classeur actif rendent le code plus fragile et plus difficile à déboguer. Considérez rendre ces références explicites lorsqu'elles sont intentionelles, et préférez l'utilisations de références d'objets. Ignorez ce résultat si l'appel réfère à un type que Rubberduck n'a pu résoudre.
it: I riferimenti impliciti alla cartella di lavoro attiva rendono il codice fragile ed è più difficile eseguire il debug. Considera l'idea di rendere espliciti questi riferimenti quando sono voluti e prediligi l'uso di riferimenti agli oggetti. Ignora se la chiamata del membro si riferisce a un tipo che Rubberduck non può risolvere.

# ImplicitByRefModifierInspection
source: Parameters are passed by reference unless specified otherwise, which can be confusing and bug-prone. Prefer passing parameters by value, and specify ByRef explicitly when passing parameters by reference.
cs: Pokud není specifikováno jinak, parametry jsou předány referencemi, což může být matoucí a náchylné k bugům. Preferujte předání parametrů jako hodnotu a specifikujte ByRef explicitně jen tehdy, pokud potřebujete předat parametr jako referenci.
de: Parameter werden, falls nicht anders spezifiziert, als Referenz übergeben. Dies kann verwirrend sein und Bugs hervorrufen. Bevorzugen Sie die Übergabe von Parametern als Werte und spezifizieren Sie eine Referenzübergabe explizit als ByRef.
es: Los parámetros se pasan por referencia a menos que se especifique lo contrario, lo que puede ser confuso y propenso a errores. Prefiera pasar parámetros por valor y especifique ByRef explícitamente cuando pase parámetros por referencia.
fr: Les paramètres sont passés par référence à moins d'avis contraire explicite, ce qui peut être confondant et fragiliser le code. Préférez passer les paramètres par valeur, et spécifiez 'ByRef' explicitement quand des paramètres doivent être passés par référence.
it: I parametri sono passati per riferimento se non diversamente specificato, il che può creare confusione e causare bug. Preferire il passaggio di parametri per valore e specificare ByRef in modo esplicito quando si passano i parametri per riferimento.

# ImplicitContainingWorkbookReferenceInspection
source: Implicit references to workbook members inside a workbook document module can be mistaken for implicit references to the active workbook, which is the behavior in all other modules. By explicitly qualifying these member calls with 'Me', the ambiguity can be resolved. If the intent was to refer to the active workbook, qualify with 'ActiveWorkbook' to prevent a bug.
cs: Implicitní odkazy na členy sešitu uvnitř modulu dokumentu sešitu lze chybně zaměnit za implicitní odkazy na aktivní sešit, což je normální chování ve všech ostatních modulech. Tím, že explicitně kvalifikujete tato volání členů s 'Me', lze vyřešit tuto dvojznačnost. Pokud byl záměr odkazovat na aktivní sešit, abyste předešli chybám, kvalifikujte volání na 'ActiveWorkbook'.
de: Implizite Referenzen zu Elementen eines Workbooks in einem Workbook-Modul können mit Referenzen zum aktiven Workbook verwechselt werden, da dies das Verhalten für solche Referenzen ist überall außerhalb von Workbook-Modulen. Die Uneindeutigkeit kann aufgelöst werden, indem die Referenzen mit 'Me' qualifiziert werden. Sollte eine Referenz zum aktiven Workbook beabsichtigt gewesen sein, sollte der Elementzugriff explizit mit 'ActiveWorkbook' qualifiziert werden.
fr: Les références implicites au classeur hôte dans un module de type 'Workbook' sont faciles à méprendre pour des références implicites au classeur actif (ActiveWorkbook). Qualifier l'appel avec 'Me' enlève cette ambiguité. Si l'intention est de référencer le classeur actif, qualifier avec 'ActiveWorkbook' pour prévenir un bogue.
it: I riferimenti impliciti ai membri della cartella di lavoro all'interno di un documento del modulo della cartella di lavoro possono essere errori per i riferimenti impliciti alla cartella di lavoro attiva, che è il comportamento in tutti gli altri moduli. Qualificando esplicitamente queste chiamate dei membri con Me, l'ambiguità può essere risolta.

# ImplicitContainingWorksheetReferenceInspection
source: Implicit references to worksheet members inside a worksheet document module can be mistaken for implicit references to the active worksheet, which is the behavior in all other modules. By explicitly qualifying these member calls with 'Me', the ambiguity can be resolved. If the intent is to refer to the active worksheet, qualify with 'ActiveSheet' to prevent a bug.
cs: Implicitní odkazy na členy listu uvnitř modulu dokumentu listu lze chybně zaměnit za implicitní odkazy na aktivní list, což je normální chování ve všech ostatních modulech. Tím, že explicitně kvalifikujete tato volání členů s 'Me', lze vyřešit tuto dvojznačnost. Pokud byl záměr odkazovat na aktivní list, abyste předešli chybám, kvalifikujte volání na 'ActiveSheet'.
de: Implizite Referenzen zu Elementen eines Worksheets in einem Worksheet-Modul können mit Referenzen zum aktiven Worksheet verwechselt werden, da dies das Verhalten für solche Referenzen ist überall außerhalb von Worksheet-Modulen. Die Uneindeutigkeit kann aufgelöst werden, indem die Referenzen mit 'Me' qualifiziert werden. Sollte eine Referenz zum aktiven Worksheet beabsichtigt gewesen sein, sollte der Elementzugriff explizit mit 'ActiveSheet' qualifiziert werden.
fr: Les références implicites à la feuille hôte dans ce même module peuvent facilement être méprises pour des références à la feuille active (ActiveSheet). Qualifier l'appel avec 'Me' enlève l'ambiguité. Si l'intention est de référer à la feuille active, qualifier l'appel avec 'ActiveSheet' pour prévenir un bogue.
it: I riferimenti impliciti ai membri del foglio di lavoro all'interno di un documento del modulo del foglio di lavoro possono essere errori per i riferimenti impliciti al foglio di lavoro attivo, che è il comportamento in tutti gli altri moduli. Qualificando esplicitamente queste chiamate dei membri con Me, l'ambiguità può essere risolta.
