Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/Inspections/InspectionInfo.*.resx
Languages: cs, de, es, fr, it

# SelfAssignedDeclarationInspection
source: An auto-instantiated object variable declaration at procedure scope changes how nulling the reference works, which can lead to unexpected behavior.
cs: Deklarace proměnné objektu s automatickým instancí v rozsahu procedur mění, jak funguje nulling reference, což může vést k neočekávanému chování.
de: Eine selbstzugewiesene Objektvariablendeklaration in einer Prozedur kann das Verhalten beim Nulling verändern. Dies kann zu unvorhergesehen Verhalten des Codes führen.
es: Una declaración de variable de objeto auto-instanciada en el ámbito del procedimiento cambia cómo funciona la anulación de la referencia, lo que puede llevar a un comportamiento inesperado.
fr: Une variable objet assignée lors de sa déclaration dans une procédure, modifie comment VBA gère cet objet, ce qui peut mener à un comportement inattendu.
it: Una dichiarazione di variabile oggetto istanziata automaticamente nell'ambito della procedura cambia il funzionamento dell'annullamento del riferimento, il che può portare a un comportamento imprevisto.

# SetAssignmentWithIncompatibleObjectTypeInspection
source: The VBA compiler does not raise an error if an object is set assigned to a variable with an incompatible declared object type, i.e. with an object type that is neither the same type, a supertype nor a subtype. Under almost all circumstances such an assignment leads to a run-time error, which is harder to detect and indicates a bug. In all other situations the code can be changed to use only assignments between compatible declared types.
cs: Kompilátor VBA nezpůsobí chybu, pokud je objekt přiřazen k proměnné s nekompatibilním deklarovaným typem objektu, tj. s typem, který není ani ten samý typ, supertyp ani subtyp. Téměř za všech okolností takové přirazení vede k chybě run-time, kterou je těžší detekovat a tento kód tedy indikuje chybu. Ve všech ostatních situacích lze kód změnit tak, aby používal pouze přiřazení mezi kompatibilními deklarovanými typy.
de: Der VBA-Compiler gibt keinen Fehler aus, wenn ein Objekt einer Variables Set-zugewiesen wird mit einem inkompatiblen Objekttype, d.h. deren Typ weder identisch, ein Subtyp noch ein Supertyp ist. In fast allen Fällen führt dies zu einem Laufzeitfehler, der schwerer zu entdecken ist und auf einen Programmierfehler hinweist. In allen anderen Fällen kann der Quallcode so geändert werden, dass er ausschließlich Zuweisungen zwischen kompatiblen deklarierten Typen verwendet.
fr: VBA n'indiquera pas d'erreur au moment de la compilation si un objet est assigné à une variable avec un type incompatible au type déclaré. Dans la presque totalité des cas ceci causera une erreur à l'exécution. Pour tous les autres cas, un type compatible doit être utilisé.
it: Il compilatore VBA non genera un errore se un oggetto è assegnato a una variabile con un tipo di oggetto dichiarato incompatibile, cioè con un tipo di oggetto che non è né lo stesso tipo, né un supertipo né un sottotipo. In quasi tutte le circostanze una tale assegnazione porta a un errore di runtime, che è più difficile da rilevare e indica un bug. In tutte le altre situazioni il codice può essere modificato per utilizzare solo assegnazioni tra tipi dichiarati compatibili.

# ShadowedDeclarationInspection
source: Two declarations are in scope and have the same identifier name. Consider using fully qualified identifier names, otherwise only one of them will be available to use.
cs: V jednom a tom samém scopu existují 2 deklarace, které mají stejný název identifikátoru. To znamená, že bude k dispozici pouze jedna z nich.
de: Zwei Deklarationen sind aktiv und haben denselben Namen. Dies bedeutet, dass nur eine von ihnen zur Verwendung verfügbar ist.
es: Dos declaraciones están dentro del alcance y tienen el mismo nombre de identificador. Esto significa que solo uno de ellos estará disponible para usar.
fr: Deux déclarations ont le même nom dans le même espace-nom: une seule d'entre elles peut être utilisée.
it: Due dichiarazioni nell'ambito di validità hanno lo stesso nome identificativo. Prendi in considerazione l'utilizzo di nomi di identificatori completi, altrimenti solo uno di essi sarà disponibile per l'uso.

# SheetAccessedUsingStringInspection
source: Excel already defines a globally scoped object variable with this reference. Consider using the sheet's 'CodeName' property.
cs: Aplikace Excel již definuje globálně vymezená objektové proměnné s touto referencí. Zvažte použití vlastnosti listu: 'CodeName'.
es: Excel ya define una variable de objeto de ámbito global con esta referencia. Considere usar la propiedad 'CodeName' de la hoja.
fr: Excel définit une variable objet globale avec cette référence. Considérez utiliser le nom de code ('CodeName') de la feuille.
it: Excel definisce già una variabile oggetto con ambito globale con questo riferimento. Prendi in considerazione l'utilizzo della proprietà 'CodeName' del foglio.

# StepIsNotSpecifiedInspection
source: Step of the for-next loop is not specified. This might be unintentional.
cs: V cyklu for-next není specifikován krok. Tohle může být neúmyslné.
de: 'Step' der 'For-Next'-Schleife ist nicht angegeben. Dies könnte versehentlich sein.
es: Step del bucle for-next no está especificado. Esto podría ser involuntario.
fr: La clause 'Step' d'une boucle 'For...Next' est implicite.
it: Il passo del ciclo for-next non è specificato. Questo potrebbe non essere intenzionale.

# StepOneIsRedundantInspection
source: 1 is the default step in a for-next loop and therefore is redundant.
cs: V cyklu for-next je krok 1 jako výchozí a tudíž je nadbytečné ho definovat.
de: 1 ist der Standardwert für 'Step' in einer 'For-Next'-Schleife und daher redundant.
es: 1 es el Step predeterminado en un bucle 'For ... Next' y, por lo tanto, es redundante.
fr: 1 est la valeur d'incrémentation par défaut pour toute boucle 'For...Next'.
it: 1 è il passo predefinito in un ciclo for-next e quindi è ridondante.

# StopKeywordInspection
source: The 'Stop' keyword halts execution and brings up the debugger. Avoid its use in distributed code.
cs: Klíčové slovo 'Stop' pozdrží exekuci kódu a aktivuje debugger. Vyhněte se tomuto v distribuovanému kódu.
de: Das Schlüsselwort 'Stop' unterbricht die Ausführung und ruft den Debugger auf. Vermeiden Sie die Verwendung in verteiltem Code.
es: La palabra clave 'Stop' detiene la ejecución y abre el depurador. Evita su uso en código distribuido.
fr: Le mot-clé 'Stop' halte l'exécution et ouvre l'éditeur VBA; évitez de livrer du code qui l'utilise.
it: La parola chiave 'Stop' interrompe l'esecuzione e fa apparire il debugger. Evita il suo utilizzo nel codice distribuito.

# SuperfluousAnnotationArgumentInspection
source: An annotation has more arguments than allowed; superfluous arguments are ignored.
cs: Anotace má více argumentů, než je povoleno; nadbytečné argumenty jsou ignorovány.
de: Eine Annotation hat mehr Argumente als erlaubt. Die überzähligen Argumente werden ignoriert.
fr: Une annotation a plus d'arguments que permis; les arguments superflus seront ignorés.
it: Un'annotazione ha più argomenti di quelli consentiti; gli argomenti superflui sono ignorati.

# SuspiciousLetAssignmentInspection
source: Whenever both sides of an assignment without Set are objects, there is an assignment from the default member of the RHS to the one on the LHS. Although this might be intentional, in many situations it will just mask an erroneously forgotten Set.
cs: Kdykoli jsou obě strany přiřazení bez 'Set' typu Objekt, existuje přiřazení od výchozího člena RHS k druhému - LHS. I když by toto mohlo být úmyslné, v mnoha situacích to jen maskuje chybně zapomenuté klíčové slovo 'Set'.
de: Wenn beide Seiten einer Zuweisung ohne Set Objekte sind, kommt es zu einer Zuweisung vom Standardelement der rechten Seite zu dem der linken. Auch wenn dies manchmal beabsichtigt sein kann, verschleiert es meistens, dass Set fehlerhafter Weise vergessen wurde.
fr: Un appel implicite d'un membre par défaut exécute du code de façon implicite (et parfois, sournoise). Même pour accéder à une collection à l'aide d'un index - rendre tous les appels explicites améliore généralement la lisibilité.
it: Ogni volta che entrambi i termini di un'assegnazione senza Set sono oggetti, c'è un'assegnazione dal membro predefinito dell'RHS a quello dell'LHS. Sebbene ciò possa essere intenzionale, in molte situazioni maschererà semplicemente un Set dimenticato per errore.

# UnassignedVariableUsageInspection
source: This is likely a bug. A variable is being referred to, but is never assigned.
cs: Zde se jedná nejspíše o bug. Proměnná je referována, avšak nikdy jí není nic přiděleno.
de: Hier könnte ein Fehler vorliegen. Eine Variable wird referenziert aber ihr wird kein Wert zugewiesen.
es: Esto es probablemente un error. Se hace referencia a una variable, pero nunca se asigna.
fr: Probablement un bogue: une variable est utilisée avant d'être assignée.
it: Questo è probabilmente un bug. Si fa riferimento a una variabile, ma non viene mai assegnata.

# UndeclaredVariableInspection
source: Code that uses undeclared variables does not compile when Option Explicit is specified. Undeclared variables are always Variant, a data type that incurs unnecessary overhead and storage.
cs: Kód, ve kterém se nacházejí nedeklarované proměnné, a přitom je specifikována volba 'Option Explicit', nelze úspěšně zkompilovat. Nedeklarované proměnné jsou vždy typu Variant, datový typ, který způsobuje zbytečné nároky na výkon a paměť.
de: Code, der undeklarierte Variablen verwendet, kompiliert nicht wenn 'Option Explicit' spezifiziert wird. Undeklarierte Variablen sind immer vom Typ 'Variant', was unnötige Zusatzkosten in Ausführungszeit und Speicherverbauch verursacht.
es: El código que utiliza variables no declaradas no se compila cuando se especifica Option Explicit. Las variables no declaradas siempre son Variant, un tipo de datos que incurre en gastos generales y almacenamiento innecesarios.
fr: Un module utilisant des variables non déclarées ne peut pas être compilé si Option Explicit est présent. Les variables non déclarées sont toujours Variant, un type qui occupe plus d'espace et requiert plus de traitement que nécessaire.
it: Il codice che utilizza variabili non dichiarate non viene compilato quando viene specificato Option Explicit. Le variabili non dichiarate sono sempre Variant, un tipo di dati che incorre in overhead e archiviazione non necessari.

# UnderscoreInPublicClassModuleMemberInspection
source: A class module that contains members with underscores cannot be implemented by other classes. The underscore is used as a separator between the interface/object name and the implemented member name: having an underscore in the member name confuses the compiler, which then refuses to compile the project. Avoid underscores in public member names by following a 'PascalCase' naming convention.
cs: Modul třídy, který obsahuje členy s podtržítky, nemůže být implementován jinými třídy. Podtržítko je používáno jako oddělovač mezi názvem rozhraní/objektem a implementovaným jménem členu: podtržítko v názvu člena zmate kompilátor, který pak odmítá zkompilování projektu. Vyhněte se podtržítkům v názvech veřejných členů a řiďte se konvencí pojmenování dle 'PascalCase'.
de: Ein Klassenmodul, das Element(e) mit Unterstrichen im Namen beinhaltet, kann nicht von anderen Klassen implementiert werden. Der Unterstrich ist als Trennzeichen zwischen Interface-/Objektname und dem Namen des implementierten Members definiert. Ein Unterstrich im Elementnamen verwirrt den Compiler, der eine Übersetzung des Projektes dann verweigert. Die 'PascalCase'-Namenskonvention erlaubt, Unterstriche in Elementnamen zu vermeiden.
es: Un módulo de clase que contiene miembros con guiones bajos no puede ser implementado por otras clases. El guión bajo se usa como separador entre la interfaz/nombre de objeto y el nombre de miembro implementado: tener un guión bajo en el nombre de miembro confunde el programador, que luego se niega a compilar el proyecto. Evite los guiones bajos en los nombres de miembros públicos siguiendo una convención de nomenclatura 'PascalCase'.
fr: Un module de classe qui contient un ou des membres dont le nom comporte un caractère de soulignement, ne peut être implémenté par d'autres classes. Ce caractère est utilisé par Visual Basic pour séparer le nom d'une interface et celui d'un membre de cette interface; la compilation échouera si le membre contient un caractère de soulignement.
it: Un modulo di classe che contiene membri con il trattino basso non può essere implementato da altre classi. Il carattere trattino basso viene utilizzato come separatore tra il nome dell'interfaccia / oggetto e il nome del membro implementato: avere un carattere trattino basso nel nome del membro confonde il compilatore, che quindi si rifiuta di compilare il progetto. Evita i caratteri trattino basso nei nomi dei membri pubblici seguendo una convenzione di denominazione 'PascalCase'.

# UnhandledOnErrorResumeNextInspection
source: Error handling should be restored after using 'On Error Resume Next'.
cs: Manipulace s chybami by měla být obnovena po použití 'On Error Resume Next'.
de: Fehlerbehandlung sollte nach Verwendung von 'On Error Resume Next' wiederhergestellt werden.
es: El manejo de errores se debe restaurar después de usar 'On Error Resume Next'.
fr: La gestion d'erreurs devrait être restaurée après l'utilisation de 'On Error Resume Next'.
it: La gestione degli errori dovrebbe essere ripristinata dopo aver utilizzato 'On Error Resume Next'.

# UnreachableCaseInspection
source: A 'Case' condition either always evaluates to False, causes a run-time error, or the cumulative effect of prior 'Case' statements represents all possible values or a superset of the 'Case' statement's values. As a result, the 'Case' block will never execute and is "dead code", or the 'Case' statement is a run-time error waiting to happen. Consider removing, reordering, or modifying the 'Case' statement.
cs: Podmínka 'Case' se buď vždy vyhodnotí jako False, způsobí run-time chybu, nebo nakumulovaný efekt předchozích 'Case' výrazů představuje všechny možné hodnoty nebo nadmnožinu hodnot výrazu 'Case'. Důsledkem toho je, že se 'Case' blok nikdy nevykoná a je tedy "mrtvý kód", nebo je výraz 'Case' velmi náchylná k run-time chybě, která s velkou pravděpodobností nastane. Zvažte odstranění, změnu pořadí nebo úpravu výrazu 'Case'.
de: Eine Bedingung in einem Case-Ausdruck ist entweder nie erfüllt, verursacht einen Laufzeitfehler oder kann nicht erfüllt werden, da die vorherigen Case-Ausdrücke bereits alle zulässigen Werte abdecken. Infolgedessen wird der Code in dem Case-Zweig nie ausgeführt und stellt "toten Code" dar oder der Case-Ausdruck stellt sogar einen Laufzeitfehler dar, der nur darauf wartet irgendwann aufzutreten. Der Case-Zweig sollte entweder gelöscht, verändert oder an eine andere Stelle verschoben werden.
fr: Une condition est toujours fausse, cause une erreur d'exécution, ou les effets cumulatifs de conditions précédentes représentent toutes les valeurs possibles, bref la condition a déjà été évaluée et ce bloc 'Case' est effectivement inatteignable.
it: Una condizione 'Case' o restituisce sempre False, causando un errore in fase di esecuzione, o l'effetto cumulativo delle precedenti istruzioni 'Case' rappresenta tutti i valori possibili o un sovrainsieme dei valori dell'istruzione 'Case'. Di conseguenza, il blocco 'Case' non sarà mai eseguito ed è "codice inattivo" oppure l'istruzione 'Case' è un errore in fase di esecuzione in attesa di verificarsi. Valuta la possibilità di rimuovere, riordinare o modificare l'istruzione 'Case'.

# UntypedFunctionUsageInspection
source: A string-returning equivalent function exists and should preferably be used to avoid implicit type conversions. If the parameter can be null, ignore this inspection result; passing a null value to a function expecting a string would raise a type mismatch runtime error.
cs: Existuje ekvivalentní funkce, která vrací typ řetězec a měla by být přednostně použita z důvodu vyvarování se implicitního zkonvertování typu. Jestliže může být parametr prázdný, ignorujte výsledek této inspekce; předání prázdné hodnoty funkci, která očekává řetěz, by vyvolalo "type mismatch" chybu za chodu programu.
de: Es gibt eine äquivalente Funktion, die einen String zurückgibt. Diese sollte bevorzugt genutzt werden, um implitizite Typumwandlungen zu vermeiden. Falls der Parameter 'null' sein kann, bitte dieses Auftreten ignorieren. 'null' an die Funktion zu übergeben, die einen String erwartet würde zu einem "Type Mismatch"-Laufzeitfehler führen.
es: Existe una función equivalente que devuelve una cadena de caracteres y debería usarse preferiblemente para evitar conversiones de tipos implícitas. Si el parámetro puede ser nulo, ignore el resultado de esta inspección; pasar un valor nulo a una función que espera una cadena provocaría un error de tiempo de ejecución de falta de coincidencia de tipo.
fr: Une fonction équivalente retourne une valeur 'String' et devrait préférablement être utilisée afin d'éviter les conversions implicites. Si le paramètre peut être nul, ignorer ce résultat; passer une valeur nulle à cette fonction causerait une erreur d'exécution 'type mismatch'.
it: Esiste una funzione equivalente che restituisce una stringa e dovrebbe essere utilizzata preferibilmente per evitare conversioni di tipo implicite. Se il parametro può essere nullo, ignorare questo risultato dell'ispezione; il passaggio di un valore nullo a una funzione che prevede una stringa genererebbe un errore di runtime di mancata corrispondenza del tipo.

# UseOfBangNotationInspection
source: Bang notation, formally known as dictionary access expression, looks like it is strongly typed. However, it is actually a stringly-typed access to the parameterized default member of the object it is used on.
cs: Vykřičníková notace, formálně známá jako výraz přístupu ke slovníku, vypadá, že je silně zadaná. Ve skutečnosti je to však striktně zadaný přístup k parametrizovanému výchozímu členu objektu, na kterém je použit.
de: Die Ausrufezeichennotation erweckt den Eindruck, dass es sich um einen Zugriff handelt, der Typchecks unterliegt. Allerdings handelt es sich lediglich um einen Zugriff auf den Standardmember des Objekts, auf das sie angewendet wird, bei dem das Argument als Zeichenkette übergeben wird.
fr: La notation "Bang", ce point d'exclamation que l'on retrouve partout sur Internet, ressemble à du code ordinaire. Toutefois, il s'agit en fait d'une chaîne de caractères servant d'argument à un appel implicite du membre par défaut de l'objet utilisé.
it: La notazione con il punto escalmativo, formalmente nota come espressione di accesso al dizionario, solo apparentemente è fortemente tipizzata. Si tratta in realtà di un accesso di tipo stringa al membro parametrizzato come predefinito dell'oggetto su cui viene utilizzata.

# UseOfRecursiveBangNotationInspection
source: Bang notation, formally known as dictionary access expression, looks like it is strongly typed. However, it is actually a stringly-typed access to the parameterized default member of the object it is used on. This is especially misleading if the parameterized default member is not on the object itself and can only be reached by calling the parameterless default member first.
cs: Vykřičníková notace, formálně známá jako výraz přístupu ke slovníku, vypadá, že je silně zadaná. Ve skutečnosti je to však striktně zadaný přístup k parametrizovanému výchozímu členu objektu, na kterém je použit. Obzvláště zavádějící, pokud výchozí parametrizovaný člen není na samotném objektu a lze jej vyvolat pouze zavoláním výchozího člena bez parametrů.
de: Die Ausrufezeichennotation erweckt den Eindruck, dass es sich um einen Zugriff handelt, der Typprüfungen unterliegt. Allerdings handelt es sich lediglich um einen Zugriff auf das Standardelement des Objekts, auf das sie angewendet wird, bei dem das Argument als Zeichenkette übergeben wird. Dies ist besonders verwirrend, wenn das Standardelement des Objekts selber keine Zeichenkette akzeptiert und deshalb ein rekursiver Zugriff auf das parameterlose Standardelement erfolgen muss.
fr: La notation "Bang", ce point d'exclamation que l'on retrouve partout sur Internet, ressemble à du code ordinaire. Toutefois, il s'agit en fait d'une chaîne de caractères servant d'argument à un appel implicite du membre par défaut de l'objet utilisé.
it: La notazione con il punto escalmativo, formalmente nota come espressione di accesso al dizionario, solo apparentemente è fortemente tipizzata. Si tratta in realtà di un accesso di tipo stringa al membro parametrizzato come predefinito dell'oggetto su cui viene utilizzata. Ciò è particolarmente fuorviante se il membro parametrizzato come predefinito non si trova sull'oggetto stesso e può essere raggiunto solo chiamando prima il membro predefinito senza parametri.

# UseOfUnboundBangNotationInspection
source: Bang notation, formally known as dictionary access expression, looks like it is strongly typed. However, it is actually a stringly-typed access to the parameterized default member of the object it is used on. This is especially misleading the default member cannot be determined at compile time.
cs: Vykřičníková notace, formálně známá jako výraz přístupu ke slovníku, vypadá, že je silně zadaná. Ve skutečnosti je to však striktně zadaný přístup k parametrizovanému výchozímu členu objektu, na kterém je použit. Obzvláště zavádějící, že není možné určit výchozího člena při kompilaci.
de: Die Ausrufezeichennotation erweckt den Eindruck, dass es sich um einen Zugriff handelt, der Typchecks unterliegt. Allerdings handelt es sich lediglich um einen Zugriff auf das Standardelement des Objekts, auf das sie angewendet wird, bei dem das Argument als Zeichenkette übergeben wird. Dies ist besonders verwirrend, wenn das Standardelement nicht zum Zeitpunkt des Kompilierens ermittelt werden kann.
fr: La notation "Bang", ce point d'exclamation que l'on retrouve partout sur Internet, ressemble à du code ordinaire. Toutefois, il s'agit en fait d'une chaîne de caractères servant d'argument à un appel implicite du membre par défaut de l'objet utilisé.
it: La notazione con il punto escalmativo, formalmente nota come espressione di accesso al dizionario, solo apparentemente è fortemente tipizzata. Si tratta in realtà di un accesso di tipo stringa al membro parametrizzato come predefinito dell'oggetto su cui viene utilizzata. Ciò è particolarmente fuorviante: il membro predefinito non può essere determinato in fase di compilazione.
