Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/Inspections/InspectionResults.*.resx
Languages: cs, de, es, fr, it

# UnreachableCaseInspection_InherentlyUnreachable
source: 'Case' statement Range Clauses must be expressed '[x] To [y]' where [x] is less than or equal to [y]'.
cs: Výraz 'Case' klauzule Range musí být vyjádřen '[x] To [y]' kde [x] je méně nebo rovno [y].
de: Bereichsbedingungen in Case-Ausdrücken müssen von der Form '[x] T [y]' sein, wobei [x] kleiner oder gleich [y] ist.
es: La sentencia rango del 'Case' debe expresarse como '[x] To [y]' donde [x] es menor o igual que [y]'.
fr: Les plages de valeurs d'un bloc 'Case' doivent être exprimés sous la forme '[x] To [y]', où [x] est plus petit ou égal à [y].
it: Le clausole 'Case' con istruzione Range devono essere espresse '[x] To [y]' dove [x] è minore o uguale a [y]'.

# FunctionReturnValueDiscardedInspection
source: Return value of function '{0}' gets discarded.
cs: Návratová hodnota funkce '{0}' je zahozena.
de: Der Rückgabewert der Funktion '{0}' wird verworfen.
es: El valor de retorno de la función '{0}' se descarta.
fr: La valeur renvoyée par la fonction '{0}' est ignorée.
it: Il valore restituito della funzione '{0}' viene scartato.

# ImplicitlyTypedConstInspection
source: Constant '{0}' is implicitly typed.
cs: Konstanta '{0}' je implicitně typována.
de: Der Datentyp der Konstante '{0}' ist implizit bestimmt.
es: Constante '{0}' tipada implícitamente.
fr: La constante '{0}' est implicitement typée.
it: La costante '{0}' ha un tipo implicito.

# SuperfluousAnnotationArgumentInspection
source: The annotation '{0}' was expected to have less arguments.
cs: Anotace '{0}' očekávala méně argumentů.
de: Die Annotation '{0}' erwartet weniger Argumente.
es: Se esparaba que la anotación '{0}' tuviera menos argumentos.
fr: L'annotation '{0}' demande moins d'arguments que ce qui est spécifié.
it: L'annotazione '{0}' avrebbe dovuto contenere meno argomenti.

# ImplicitContainingWorkbookReferenceInspection
source: Member '{0}' implicitly references the containing workbook document module.
cs: Člen '{0}' implicitně odkazuje na modul dokumentu, který obsahuje sešit.
de: Element '{0}' referenziert implizit auf das umgebende Workbook-Modul.
fr: Le membre '{0}' référencie implicitement le classeur contenant le projet.
it: Il membro '{0}' fa riferimento implicitamente al documento del modulo della cartella di lavoro che lo contiene.

# ImplicitContainingWorksheetReferenceInspection
source: Member '{0}' implicitly references the containing worksheet document module.
cs: Člen '{0}' implicitně odkazuje na modul dokumentu, který obsahuje list.
de: Element '{0}' referenziert implizit auf das umgebende Worksheet-Modul.
fr: Le membre '{0}' référencie implicitement la feuille hôte.
it: Il membro '{0}' fa riferimento implicitamente al documento del modulo del foglio di lavoro che lo contiene.

# MisleadingByRefParameterInspection
source: Misleading ByRef modifier used for parameter '{0}' ({1}).
cs: Modifikátor ByRef použitý pro parametr '{0}' členu '{1}' je zavádějící.
de: Irreführender ByRef Modifizierer für den Parameter '{0}' ({1}) benutzt.
fr: Modificateur ByRef trompeur pour le paramètre '{0}' ({1}).
it: Modificatore fuorviante ByRef utilizzato per il parametro '{0}' ({1}).

# InvalidAnnotationInspection
source: Annotation '{0}' is invalid in this context.
cs: Anotace '{0}' je v tomto kontextu ilegální.
de: Die Annotation '{0}' ist in diesem Kontext nicht zulässig.
fr: Annotation '{0}' invalide dans ce contexte.
it: L'annotazione '{0}' non è valida in questo contesto.

# UnrecognizedAnnotationInspection
source: '{0}' is not a recognized Rubberduck annotation (yet?)
cs: '{0}' není rozpoznán jako Rubberduck anotace (zatím?)
de: '{0}' ist keine von Rubberduck unterstützte Annotation
fr: '{0}' n'est pas [encore?] une annotation que Rubberduck reconnaît
it: '{0}' non è (ancora?) un'annotazione di Rubberduck conosciuta

# InvalidAnnotationInspection_NotInRequiredComponentType
source: Annotation '{0}' is used in a '{1}', but is only valid in a '{2}'.
cs: Anotace '{0}' je použita v '{1}', ale platná je pouze v '{2}'.
de: Die Annotation '{0}' wurde in einer Komponente des Typs '{1}' verwendet, kann aber nur in Komponenten des Typs '{2}' verwendet werden.
fr: L'annotation '{0}' est utilisée dans un '{1}', mais n'est seulement valide dans un '{2}'.
it: L'annotazione '{0}' è usata in un '{1}', ma è valida solo in un '{2}'.

# InvalidAnnotationInspection_IncompatibleComponentType
source: Annotation '{0}' cannot be used in a '{1}'.
cs: Anotace '{0}' nemůže být použita v '{1}'.
de: Die Annotation '{0}' kann nicht in einer Komponente des Typs '{1}' verwendet werden.
fr: L'annotation '{0}' ne peut être utilisée dans un '{1}'.
it: L'annotazione '{0}' non può essere usata in un '{1}'.

# ParameterNotUsedInspection
source: Parameter '{0}' is not used.
de: Parameter '{0}' wird nicht verwendet.
it: Il parametro '{0}' non è usato.

# IIfSideEffectInspection
source: '{0}' invoked by 'IIf' Function
de: '{0}' wird durch die 'IIf'-Funktion aufgerufen
it: '{0}' invocato dalla Funzione 'IIf'

# PublicControlFieldAccessInspection
source: Control '{0}.{1}' is being accessed from outside its parent form.
de: Auf das Steuerelement '{0}.{1}' wird von außerhalb seines Eltern(Parent)-Formulars zugegriffen.
it: Accesso al controllo '{0}.{1}' dall'esterno della maschera parent.

# ReadOnlyPropertyAssignmentInspection
source: Attempt to assign Read-Only Property '{0}'
de: Versuch, die "Nur Lesen"-Eigenschaft '{0}' zu verändern.
it: Tentativo di assegnazione alla Proprietà di Sola Lettura '{0}'

# PublicImplementationShouldBePrivateInspection
source: Member '{0}' should be Private
de: Element '{0}' sollte 'Private' sein.
it: Il Membro {0} dovrebbe essere Private

# SuspiciousPredeclaredInstanceAccessInspection
source: Identifier '{0}' in '{1}' is suspiciously referring to the default instance of that class type.
de: Bezeichnung '{0}' in '{1}' verweist verdächtigerweise auf die Standardinstanz dieses Klassentyps.
it: L'identificatore '{0}' in '{1}' si riferisce in modo sospetto all'istanza predefinita di quel tipo di classe.

# PublicEnumerationDeclaredInWorksheetInspection
source: The public enumeration '{0}' should be declared within a Standard or Class module
de: Die öffentliche (Public) Enumeration '{0}' sollte in einem Standard- oder Klassenmodule erfolgen
it: L'enumerazione pubblica '{0}' dovrebbe essere dichiarata all'interno di un modulo Standard o di Classe
