Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/Inspections/InspectionInfo.*.resx
Languages: cs, de, es, fr, it

# ImplicitDefaultMemberAccessInspection
source: Default member accesses hide away the actually called member. This is especially misleading if there is no indication in the expression that such a call is made. It can cause errors in which a member was forgotten to be called to go unnoticed.
cs: Výchozí přístupy členů skryjí skutečně volaného člena. To je obzvláště zavádějící, pokud ve výrazu není žádný náznak, že je takové volání uskutečňováno. Toto může způsobit chyby, při kterých přejde bez povšimnutí, že bylo zapomenuto zavolat člena.
de: Zugriffe auf Standardelemente verstecken, welches Element aufgerufen wird. Dies ist besonders verwirrend, wenn in dem Ausdruck selber keine Indikation vorhanden ist, dass ein solcher Zugriff erfolgt. Dies kann dazu führen, dass Fehler durch vergessene Elementaufrufe nicht erkannt werden.
fr: Un appel implicite d'un membre par défaut exécute du code de façon implicite (et parfois, sournoise). Même pour accéder à une collection à l'aide d'un index - rendre tous les appels explicites améliore généralement la lisibilité.
it: Gli accessi ai membri predefiniti nascondono il membro effettivamente chiamato. Ciò è particolarmente fuorviante se non vi è alcuna indicazione nell'espressione che tale chiamata sia stata effettuata. Può causare errori in cui un membro è stato dimenticato di essere chiamato passando inosservato.

# ImplicitlyTypedConstInspection
source: If the 'As' type clause for a 'Const' declaration isn't included it is implicitly typed. Include an explicit ' As <Type>' replacing '<Type>' with the correct data type to explicitly type your constant value.
cs: Pokud není definována klausule typu 'As' pro deklaraci 'Const', použije se implicitní typ. Explicitně definujte ' As <Type>', kde '<Type>' je korektní data typ hodnoty konstanty.
de: Wird keine Typdeklaration verwendet wird der Datentyp einer Konstante implizit bestimmt. Erwägen Sie eine explizite 'As <Datentyp>'-Deklaration zu verwenden um die Lesbarkeit zu verbessern, wobei '<Datentyp>' der erwünschte Datentyp der Konstante ist.
fr: Lorsque la clause 'As' de la déclaration de constante 'Const' n'est pas spécifiée, le type est implicite et dérivé du type de la valeur assignée. Préférez les déclarations explicites, en incluant une clause 'As <Type>', où '<Type>' est le type explicite à utiliser pour cette déclaration.
it: Se la clausola di tipo 'As' per una dichiarazione 'Const' non è inclusa, il tipo è implicito. Includere un 'As <Type>' esplicito sostituendo '<Type>' con il tipo di dati corretto per esplicitare il tipo del valore della costante.

# ImplicitPublicMemberInspection
source: Module members are public by default, which can be counter-intuitive. Consider specifying explicit access modifiers to avoid ambiguity.
cs: Členové modulu jsou ve výchozím nastavení veřejní, což může být oproti očekávání. Zvažte použití explicitních přístupových modifikátorů, aby se kód zbavil nejednoznačosti.
de: Die Methoden eines Moduls sind standardmäßig öffentlich, was irreführend sein kann. Besser ist es, den Gültigkeitsbereich der Methoden explizit zu definieren.
es: Los miembros del módulo son públicos por defecto, lo que puede ser contraintuitivo. Considere la posibilidad de especificar modificadores de acceso explícitos para evitar la ambigüedad.
fr: Les membres d'un module sont publics par défaut, ce qui peut être contre-intuitif. Considérez spécifier les modificateurs d'accès explicitement pour éviter toute ambiguïté.
it: I membri del modulo sono pubblici per impostazione predefinita, mentre si può pensare il contrario. Considerare la possibilità di specificare modificatori di accesso esplicito per evitare ambiguità.

# ImplicitRecursiveDefaultMemberAccessInspection
source: Default member accesses hide away the actually called member. This is especially misleading if there is no indication in the expression that such a call is made and the final default member is not on the interface of the object itself. In particular, this can cause errors in which a member was forgotten to be called to go unnoticed.
cs: Výchozí přístupy členů skryjí skutečně volaného člena. To je obzvláště zavádějící, pokud ve výrazu neexistuje žádný náznak, že je takové volání uskutečněno a konečný výchozí člen není součástí interface nebo samotného objektu. Zejména to může způsobit chyby, při kterých přejde bez povšimnutí, že bylo zapomenuto zavolat člena.
de: Zugriffe auf das Standardelement verstecken, welches Element aufgerufen wird. Dies ist besonders verwirrend, wenn in dem Ausdruck selber keine Indikation vorhanden ist, dass ein solcher Zugriff erfolgt, und zudem das Standardelement nicht auf dem Interface des Objekts selber zu finden ist. Dies kann dazu führen, dass Fehler durch vergessene Elementaufrufe nicht erkannt werden.
fr: Un appel implicite d'un membre par défaut exécute du code de façon implicite (et parfois, sournoise). Même pour accéder à une collection à l'aide d'un index - rendre tous les appels explicites améliore généralement la lisibilité.
it: Gli accessi ai membri predefiniti nascondono il membro effettivamente chiamato. Ciò è particolarmente fuorviante se non vi è alcuna indicazione nell'espressione che tale chiamata viene effettuata e il membro predefinito finale non si trova sull'interfaccia dell'oggetto stesso. In particolare, questo può causare errori in cui un membro è stato dimenticato di essere chiamato passando inosservato.

# ImplicitUnboundDefaultMemberAccessInspection
source: Default member accesses hide away the actually called member. This is especially misleading if there is no indication in the expression that such a call is made and if the default member cannot be determined from the declared type of the object. As a consequence, errors in which a member was forgotten to be called can go unnoticed and should there not be a suitable default member at runtime, an error 438 'Object doesn't support this property or method' will be raised.
cs: Výchozí přístupy členů skryjí skutečně volaného člena. To je obzvláště zavádějící, pokud ve výrazu neexistuje žádný náznak, že je takové volání uskutečněno a pokud výchozí člen nemůže být určen z deklarovaného typu objektu. V důsledku toho mohou vzniknout chyby, při kterých přejde bez povšimnutí, že bylo zapomenuto zavolat člena a pokud se v průběhu run-time nevyskytne vhodný výchozí člen, objeví se chyba 438 'Object doesn't suport this property or method'.
de: Zugriffe auf das Standardelemente verstecken, welches Element aufgerufen wird. Dies ist besonders verwirrend, wenn in dem Ausdruck selber keine Indikation vorhanden ist, dass ein solcher Zugriff erfolgt, und zudem das Standardelement erst zur Laufzeit ermittelt werden kann. Dies kann dazu führen, dass Fehler durch vergessene Elementaufrufe nicht erkannt werden. Sollte weiterhin zur Laufzeit kein Standardelement auf dem Objekt existsieren, so kommt es zu einem Fehler 438 'Objekt unterstützt diese Eigenschaft oder Methode nicht'.
fr: Un appel implicite d'un membre par défaut exécute du code de façon implicite (et parfois, sournoise). Même pour accéder à une collection à l'aide d'un index - rendre tous les appels explicites améliore généralement la lisibilité.
it: Gli accessi ai membri predefiniti nascondono il membro effettivamente chiamato. Ciò è particolarmente fuorviante se non vi è alcuna indicazione nell'espressione che tale chiamata viene effettuata e se il membro predefinito non può essere determinato dal tipo dichiarato dell'oggetto. Di conseguenza, con errori in cui un membro è stato dimenticato di essere chiamato passando inosservato e se non ci fosse un membro predefinito adatto in fase di esecuzione, verrà generato un errore 438 'L'oggetto non supporta questa proprietà o metodo'.

# ImplicitVariantReturnTypeInspection
source: Members with a return value implicitly return a 'Variant' unless specified otherwise. Consider returning an explicit 'Variant' when the return type isn't known, or specify it explicitly.
cs: Pokud není specifikováno jinak, členové vrátí implicitně hodnotu typu 'Variant'. Zvažte zápis explicitního vrácení typu 'Variant', pokud není znám typ vracející hodnoty, nebo ho explicitně specifikujte.
de: Methoden mit einem Rückgabewert geben, wenn nicht anders angegeben, implizit 'Variant' zurück. Überlege, ob es nicht besser ist, den Rückgabewert explizit als 'Variant' zu definieren, wenn der Typ des Rückgabewertes nicht bekannt ist.
es: Los miembros con un valor de retorno devuelven implícitamente un 'Variant' a menos que se especifique lo contrario. Considere devolver un 'Variant' explícito cuando no se conozca el tipo de retorno, o especifíquelo explícitamente.
fr: Les membres qui renvoient une valeur, renvoient implicitement une valeur de type 'Variant' à moins qu'un type explicite ne soit spécifié. Considérez renvoyer un 'Variant' explicite quand le type est inconnu, ou spécifiez le type explicitement.
it: I membri che restituiscono un valore implicitamente restituiscono un 'Variant' se non diversamente specificato. Prendi in considerazione la restituzione di un 'Variant' esplicito quando il tipo restituito non è noto o specificalo esplicitamente.

# IndexedDefaultMemberAccessInspection
source: A default member access hides away which member is actually called. Although it is apparent that some call is made in the case of an indexed default member access being explicit is usually better for readability.
cs: Výchozí členský přístup skryje, který člen je skutečně volán. I když je zřejmé, že se některé volání provádí v případě, že je indexovaný výchozí členský přístup explicitní, což je obvykle lepší pro čitelnost.
de: Zugriffe auf Standardelemente verstecken, welches Element aufgerufen wird. Auch wenn im Fall eines paramtrisierten Zugriffs ersichtlich ist, dass ein Zugriff erfolgt, so ist es in der Regel für die Lesbarkeit zuträglich, explizit zu sein.
fr: Un appel implicite d'un membre par défaut exécute du code de façon implicite (et parfois, sournoise). Même pour accéder à une collection à l'aide d'un index - rendre tous les appels explicites améliore généralement la lisibilité.
it: Un accesso al membro predefinito nasconde quale membro è effettivamente chiamato. Sebbene sia evidente che ci sia una chiamata nel caso di accesso indicizzato ad un membro predefinito, esplicitarlo di solito è meglio per la leggibilità.

# IndexedRecursiveDefaultMemberAccessInspection
source: A default member access hides away which member is actually called. Although it is apparent that some call is made in the case of an indexed default member access being explicit is usually better for readability. This especially holds if the accessed default member is not on the interface of the object itself but has to be resolved via a chain of default member calls.
cs: Výchozí přístup člena skryje, který člen je skutečně volán. I když je zřejmé, že se některé volání provádí v případě, že je indexovaný výchozí přístup člena explicitní, je obvykle lepší pro čitelnost. To platí zejména případě, že přistupovaný výchozí člen není interface samotného objektu, ale musí být vyřešen prostřednictvím řetězce výchozích členských volání.
de: Zugriffe auf Standardelemente verstecken, welches Element aufgerufen wird. Auch wenn im Fall eines paramtrisierten Zugriffs ersichtlich ist, dass ein Zugriff erfolgt, so ist es in der Regel für die Lesbarkeit zuträglich explizit zu sein. Dies trifft besonders zu, wenn das Standardelement nicht auf dem Interface des Objekts selber zu finden ist uns stattdessen mittels einer Kette von Standardelementzugriffen erreicht werden muss.
fr: Un appel implicite d'un membre par défaut exécute du code de façon implicite (et parfois, sournoise). Même pour accéder à une collection à l'aide d'un index - rendre tous les appels explicites améliore généralement la lisibilité.
it: Un accesso al membro predefinito nasconde quale membro è effettivamente chiamato. Sebbene sia evidente che ci sia una chiamata nel caso di accesso indicizzato ad un membro predefinito, eplicitarlo di solito è meglio per la leggibilità. Ciò vale soprattutto se il membro predefinito a cui si accede non si trova sull'interfaccia dell'oggetto stesso ma deve essere risolto tramite una catena di chiamate ai membri predefiniti.

# IndexedUnboundDefaultMemberAccessInspection
source: A default member access hides away which member is actually called. Although it is apparent that some call is made in the case of an indexed default member access being explicit is usually better for readability. This is especially true if the default member cannot be determined at compile time. In addition, should there not be a suitable default member at runtime, an error 438 'Object doesn't support this property or method' will be raised.
cs: Výchozí přístup člena skryje, který člen je skutečně volán. I když je zřejmé, že se některé volání provádí v případě, že je indexovaný výchozí přístup člena explicitní, je obvykle lepší pro čitelnost. To platí zejména v případě, kdy výchozí člen nemůže být určen při kompilaci. Dále, pokud by při run-time neexistoval vhodný výchozí člen, bude vyvolána chyba 438 'Object doesn't support this property ormethod'.
de: Zugriffe auf Standardelemente verstecken, welches Element aufgerufen wird. Auch wenn im Fall eines paramtrisierten Zugriffs ersichtlich ist, dass ein Zugriff erfolgt, so ist es in der Regel für die Lesbarkeit zuträglich explizit zu sein. Dies trifft insbesondere zu, wenn das Standardelement erst zur Laufzeit ermittelt werden kann. Sollte dann kein passendes Standardelement existieren, kommt es zu einem Fehler 438 'Objekt unterstützt diese Eigenschaft oder Methode nicht'.
fr: Un appel implicite d'un membre par défaut exécute du code de façon implicite (et parfois, sournoise). Même pour accéder à une collection à l'aide d'un index - rendre tous les appels explicites améliore généralement la lisibilité.
it: Un accesso al membro predefinito nasconde quale membro è effettivamente chiamato. Sebbene sia evidente che ci sia una chiamata nel caso di accesso indicizzato ad un membro predefinito, eplicitarlo di solito è meglio per la leggibilità. A maggior ragione se il membro predefinito non può essere determinato in fase di compilazione. Inoltre, se non c'è un membro predefinito adatto in fase di esecuzione, sarà generato un errore 438 'L'oggetto non supporta questa proprietà o metodo'.

# IntegerDataTypeInspection
source: The maximum value of a 16-bit signed integer is 32,767 - using a 32-bit (Long) integer data type where possible can help prevent 'Overflow' run-time errors, and is better handled by modern CPUs.
cs: Maximální hodnota 16-bitového (Int) integeru je 32,769 - použitím 32-bit (Long) integeru všude, kde je možné, pomůžete předejít 'Overflow' run-time chybě a je lépe zpracováno moderními CPU.
de: Der größte Wert einer vorzeichenbehafteten 16-bit Ganzzahl ist 32.767 - Eine 32-bit Ganzzahl (Long) zu verwenden, wo es möglich ist, kann Überlauffehler zur Laufzeit verhindern und ist für moderne CPUs einfacher.
es: El valor máximo de un entero con signo de 16 bits es 32.767: el uso de un tipo de datos de entero de 32 bits (Long) siempre que sea posible puede ayudar a prevenir errores de "Desbordamiento" en el tiempo de ejecución, y es mejor manejado por las CPU modernas.
fr: La valeur maximale d'un nombre entier 16-bits signé est de 32,767 - utiliser un entier 32-bit (Long) où c'est possible, aide à prévenir certaines erreurs 'Overflow'. Les processurs modernes travaillent aussi plus efficacement avec des entiers 32-bits.
it: Il valore massimo di un intero con segno a 16 bit è 32.767 - l'utilizzo di un tipo di dati intero a 32 bit (Long) ove possibile può aiutare a prevenire errori di runtime di 'Overflow' ed è gestito meglio dalle moderne CPU.

# IsMissingOnInappropriateArgumentInspection
source: IsMissing is only intended to be called on optional arguments, and will only return correct results if the type of the argument is 'Variant' with no explicit default value. All other uses will return 'False'.
cs: IsMissing je určeno pouze pro volání volitelných argumentů a správné výsledky vrátí pouze v případě, jestliže je typ argumenty 'Variant' bez explicitní výchozí hodnoty. Všechna jiná použití vrátí 'False'.
de: 'IsMissing' ist nur dafür gedacht, auf optionalen Argumenten aufgerufen zu werden und wird nur bei Variant-Argumenten ohne Standardwert korrekte Ergebnisse liefern. Jegliche andere Verwendung wird 'False' zurückliefern.
es: IsMissing solo está destinado a ser invocado en argumentos opcionales, y solo devolverá resultados correctos si el tipo del argumento es 'Variant' sin un valor predeterminado explícito. Todos los demás usos devolverán 'False'.
fr: 'IsMissing' ne doit être utilisé qu'avec un paramètre optionnel, et ne renverra de résultats corrects que si le type du paramètre est 'Variant'. Pour tout autre type, la fonction retournera 'False'.
it: IsMissing deve essere chiamato solo su argomenti opzionali e restituirà risultati corretti solo se il tipo di argomento è 'Variant' senza un valore predefinito esplicito. Tutti gli altri usi restituiranno 'False'.

# IsMissingWithNonArgumentParameterInspection
source: IsMissing is only intended to be called on arguments of the containing procedure, and almost all other usages will return 'False'. Passing any other expression to the function is the equivalent to 'VarType({expression}) = vbError', and in rare circumstances can cause the host application to crash.
cs: 'IsMissing' je určen pouze k tomu, aby byl volán argumenty procedury a téměř všechny ostatní vrátí 'False'. Předávání jakéhokoli jiného výrazu do funkce je ekvivalentní k 'VarType({expression}) = vbError' a ve vzácných případech může způsobit selhání hostitelské aplikace.
de: 'IsMissing' ist nur dafür gedacht, auf Argumenten der umgebenden Prozedur aufgerufen zu werden. Beinahe jegliche andere Verwendung wird 'False' zurückgeben. Einen anderen Ausdruck an diese Funktion zu übergeben ist äquvalent zu 'VarType({Ausdruck}) = vbError', und kann in seltenen Fällen zum Absturz der Hostanwendung führen.
es: IsMissing solo está destinado a ser invocado en los argumentos del procedimiento de contención, y casi todos los demás usos devolverán 'False'. Pasar cualquier otra expresión a la función es equivalente a 'VarType ({expresión}) = vbError', y en raras ocasiones puede causar que la aplicación host se bloque.
fr: 'IsMissing' ne doit être utilisée qu'avec les paramètres de la procédure, tout autre usage renverra la valeur constante 'False'. Passer toute autre expression à cette fonction est l'équivalent de 'VarType({expression}) = vbError', ce qui dans de rares circonstances peut faire planter l'application hôte.
it: IsMissing deve essere chiamato solo su argomenti della procedura che lo contiene e quasi tutti gli altri utilizzi restituiranno 'False'. Il passaggio di qualsiasi altra espressione alla funzione equivale a 'VarType({expression}) = vbError' e in rari casi può causare l'arresto anomalo dell'applicazione host.

# KeywordsUsedAsMemberInspection
source: A keyword is being used as a member in either an enumeration or an user defined type. That can lead to ambiguous resolution. Consider renaming the member.
cs: Klíčové slovo se používá jako člen v enumeraci, nebo v uživatelem definovaném typu. To může vést k nejednoznačnému řešení. Zvažte přejmenování člena.
de: Ein Schlüsselwort wird als Name eines Elements einer Aufzählung oder eines benutzerdefinierten Typs verwendet. Dies kann zu Problemen bei der Auflösung von Referenzen auf das Element führen. Sie sollten in Betracht ziehen den Namen zu ändern.
es: Una palabra clave se usa como miembro en una enumeración o en un tipo definido por el usuario. Eso puede llevar a una resolución ambigua. Considere cambiar el nombre del miembro.
fr: Un mot-clé est utilisé comme nom de membre d'une énumétation ou d'un type défini par l'utilisateur. Ceci peut entraîner une résolution ambiguë, considérez renommer le membre.
it: Una parola chiave è utilizzata come membro in un'enumerazione o in un tipo definito dall'utente. Ciò può portare a una risoluzione ambigua. Valuta la possibilità di rinominare il membro.

# LineContinuationBetweenKeywordsInspection
source: There are line continuations between keywords. There is no good reason to put it there; consider removing them altogether.
cs: Mezi klíčovými slovy se nacházejí pokračování řádků. Neexistuje dobrý důvod, proč by tam měly být; zvažte jejich úplné odstranění.
de: Es befinden sich Zeilenfortsetzungszeichen zwischen Schlüsselwörtern. Dafür gibt es keinen guten Grund. Sie sollten in Betracht ziehen sie zu entfernen.
es: Hay continuaciones de línea entre palabras clave. No hay una buena razón para ponerlas allí; Considera eliminarlas por completo
fr: Des marqueurs de continuation sont présents entre les mots-clés. Bien que ce soit légal, il n'y a pas de raison valable de le faire. Considérez supprimer les marqueurs de continuation.
it: Sono presenti continuazioni di riga tra le parole chiave. Non c'è una buona ragione per metterle lì; considera la possibilità di rimuoverle del tutto.

# LineLabelNotUsedInspection
source: A line label that is never jumpted to ('GoTo', 'Resume', ...), serves no purpose. Consider removing it.
cs: Označení řádku, na které není nikdy přeskočeno ('GoTo', 'Resume', ...) nemá žádný smysl. Zvažte jeho odstranění.
de: Rubberduck konnte keine Resume oder GoTo Anweisung zu einer Zeilenbezeichnung finden. Erwägen Sie eine Entfernung der Bezeichnung.
es: Una etiqueta de línea que nunca se salta a ('GoTo', 'Resume', ...), no sirve para nada. Considera removerlo.
fr: Une étiquette de ligne qui n'est pas utilisée ('GoTo', 'Resume', ...), n'a pas d'utilité. Considerez les supprimer.
it: Un'etichetta di riga a cui non si salta mai ('GoTo', 'Resume', ...) non serve a nulla. Considera l'idea di rimuoverla.

# MemberNotOnInterfaceInspection
source: A member access call is made against an extended interface that Rubberduck couldn't resolve, or the member couldn't be found. If VBA cannot resolve the type at run-time, error 438 will be raised. If an equivalent, non-extended interface that Rubberduck can resolve is available, consider using it instead.
cs: Přístupové zavolání členu bylo uděláno proti rozšířenému rozhraní, které Rubberduck nemohl vyřešit, nebo nebyl nalezen člen. Pokud VBA nemůže vyřešit typ v době spuštění (run-time), vyskočí chyba 438. Pokud je k dispozici ekvivalentní ne-rozšířené rozhraní, které je schopen Rubberduck vyřešit, zvažte jeho použití.
de: Es wird ein Elementzugriff verwendet, der vom Interface des Objektes nicht deklariert wird. Dies ist höchstwahrscheinlich ein Fehler. Falls der Elementzugriff das erweiterbare Interface des Objektes verwendet, erwägen Sie ein nicht erweiterbares Äquivalent zu verwenden um Prüfungen zur Kompilierzeit zu ermöglichen und das Auftreten von Laufzeitfehler 438 zu verhindern.
es: Se realiza una llamada de acceso de miembro contra una interfaz extendida que Rubberduck no pudo resolver, o no se pudo encontrar al miembro. Si VBA no puede resolver el tipo en tiempo de ejecución, se generará el error 438. Si hay disponible una interfaz equivalente, no extendida, que Rubberduck puede resolver, considere usarla en su lugar.
fr: Un membre est accédé mais ne semble pas exister dans l'interface de l'objet. Ceci causera probablement une erreur d'exécution #438.
it: Viene effettuata una chiamata di accesso ad un membro su un'interfaccia estesa che Rubberduck non è riuscito a risolvere, o il membro non è stato trovato. Se VBA non è in grado di risolvere il tipo in fase di esecuzione, sarà generato l'errore 438. Se è disponibile un'interfaccia equivalente e non estesa che Rubberduck può risolvere, prendi in considerazione di usarla.
