Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/Inspections/InspectionInfo.*.resx
Languages: cs, de, es, fr, it

# ApplicationWorksheetFunctionInspection
source: The Excel Application object does not implement the WorksheetFunction interface directly. All calls made to WorksheetFunction members are handled as late bound and errors in the called member will be returned wrapped in a Variant of VbVarType.vbError. This makes errors un-trappable with error handlers and adds a performance penalty in comparison to early bound calls. Consider calling Application.WorksheetFunction explicitly. Note: If this call generated errors in the past, those errors were ignored. If applying the quick fix, proper error handling should be in place.
cs: Objekt Excel Aplikace neimplementuje rozhraní WorksheetFunction napřímo. Všechna volání provedená členy WorksheetFunction jsou zpracována jako 'late bound¨a chyby ve volaném členu budou vráceny jako typ Variant od 'VbVarType.vbError'. Toto zapříčiní nemožnost odchytnout chyby pomocí error handlerů a přidává výkonnostní náročnost ve srovnání s 'early bound' voláním. Zvažte volání 'Application.WorksheetFunction' explicitně. Poznámka: Pokud toto volání v minulosti generovalo chyby, tyto chyby byly ignorovány. Pokud použijete rychlou opravu (Quick fix), měla by být provedena správná manipulace s chybami.
de: Das Excel Application-Objekt implementiert das WorksheetFunction Interface nicht direkt. Alle Aufrufe an WorksheetFunction Elemente werden als spät gebunden behandelt und Fehler im aufgerufenen Element werden in ein Variant des Typs VbVarType.Error gekapselt. Dadurch können Fehler nicht mit Fehleranweisungen behandelt werden und gegenüber früh gebundenen Aufrufen sinkt die Performanz. Ziehen Sie in Erwägung Application.WorksheetFunction explizit aufzurufen. Bedenken Sie: Falls dieser Aufruf in der Vergangenheit Fehler erzeugt hat, wurden diese ignoriert. Es sollte eine Fehlerbehandlung vorhanden sein, bevor Sie die schnelle Korrektur anwenden.
es: El objeto de la aplicación de Excel no implementa la interfaz WorksheetFunction directamente. Todas las llamadas realizadas a los miembros de WorksheetFunction se manejan como un enlace tardío y los errores en el miembro llamado se devolverán envueltos en una Variant de VbVarType.vbError. Esto hace que los errores no se puedan interceptar con los controladores de errores y agrega una penalización de rendimiento en comparación con las llamadas enlazadas tempranas. Considere llamar a Application.WorksheetFunction explícitamente. Nota: Si esta llamada generó errores en el pasado, esos errores se ignoraron. Si está aplicando la solución rápida, el manejo correcto de errores debe estar en su lugar.
fr: L'objet Excel Application n'implémente pas l'interface WorksheetFunction directement; les appels de fonctions WorksheetFunction effectués sur Application, renvoie une valeur VbVarType.Error; ces erreurs ne peuvent être capturées avec la gestion d'erreurs de VBA et encourent une pénalité de performance par rapport à un appel équivalent de WorksheetFunction. Note: assurez-vous de gérer les erreurs d'exécution en appliquant ce correctif.
it: L'oggetto Applicazione Excel non implementa direttamente l'interfaccia WorksheetFunction. Tutte le chiamate effettuate ai membri di WorksheetFunction vengono gestite come associazione tardiva e gli errori nel membro chiamato verranno restituiti racchiusi in un Variant di VbVarType.vbError. Ciò rende gli errori non intercettabili con i gestori di errori e aggiunge una riduzione delle prestazioni rispetto alle chiamate associate iniziali. Considera la possibilità di chiamare Application.WorksheetFunction in modo esplicito. Nota: se questa chiamata ha generato errori in passato, tali errori sono stati ignorati. Se si applica la soluzione rapida, è necessario disporre di una corretta gestione degli errori.

# ArgumentWithIncompatibleObjectTypeInspection
source: The VBA compiler does not raise an error if an object is passed as an argument for a parameter with an incompatible declared object type, i.e. with an object type that is neither the same type, a supertype nor a subtype. Under almost all circumstances passing such an argument leads to a run-time error, which is harder to detect and indicates a bug. In all other situations the code can be changed to only pass arguments of compatible declared types.
cs: Kompilátor VBA nezpůsobí chybu, pokud je objekt předán jako argument pro parametr s nekompatibilní deklarací typu objektu, tj. s typem objektu, který není ani ten samý typ, supertyp ani subtyp. Téměř za všech okolností předávání takového argumentu vede k run-time chybě, kterou je těžké detekovat a indikuje tedy chybu. Ve všech ostatních situacích lze kód změnit tak, aby předával pouze argumenty kompatibilních deklarovaných typů.
de: Der VBA-Compiler gibt keinen Fehler aus, wenn ein Objekt als Argument für einen Parameter mit einem inkompatiblen Objekttyp übergeben wird, d.h. dessen Typ weder identisch, ein Subtyp, noch ein Supertyp ist. In fast allen Fällen führt dies zu einem Laufzeitfehler, der schwer zu entdecken ist und auf einen Programmierfehler hinweist. In allen anderen Fällen kann der Quellcode so geändert werden, dass ausschließlich Argumente mit kompatiblen deklarierten Typen verwendet werden.
fr: VBA n'indiquera pas d'erreur au moment de la compilation si un objet est passé en argument à un paramètre de type incompatible. Dans la presque totalité des cas ceci causera une erreur à l'exécution. Pour tous les autres cas, un type compatible doit être utilisé.
it: Il compilatore VBA non genera un errore se un oggetto viene passato come argomento per un parametro con un tipo di oggetto dichiarato incompatibile, cioè con un tipo di oggetto che non è né lo stesso tipo, né un supertipo né un sottotipo. In quasi tutte le circostanze il passaggio di un argomento di questo tipo porta a un errore di runtime, che è più difficile da rilevare e indica un bug. In tutte le altre situazioni il codice può essere modificato per passare solo argomenti di tipi dichiarati compatibili.

# AssignedByValParameterInspection
source: Parameter is passed by value, but is assigned a new value/reference. Consider making a local copy instead if the caller isn't supposed to know the new value. If the caller should see the new value, the parameter should be passed ByRef instead, and you have a bug.
cs: Parametr je předán jako hodnota, ale je mu přidělena nová hodnota/reference. Zvažte vytvoření lokální kopie, pokud volaná funkce nemá znát onu novou hodnotu. Pokud má volaná funkce pracovat s novou hodnotou, parametr by měl být předán jako 'ByRef' a vy máte bug.
de: Parameter wird als Wert übergeben, aber überschrieben. Eine Lokale Kopie verdeutlicht, dass die Aufrufende den neuen Wert nicht kennen soll. Falls die Aufrufende den neuen Wert kennen soll, müsste der Parameter 'ByRef' übergeben werden und dies ist ein Bug.
es: El parámetro se pasa por valor, pero se le asigna un nuevo valor/referencia. Considere hacer una copia local en su lugar si se supone que la persona que llama no sabe el nuevo valor. Si la persona que llama debería ver el nuevo valor, el parámetro debería pasar ByRef en su lugar, y tiene un error.
fr: Le paramètre est passé par valeur, mais une nouvelle valeur/référence lui est assignée; considérez introduire une copie locale si le code appelant n'est pas sensé utiliser la nouvelle valeur. Si le code appelant est sensé utiliser la nouvelle valeur, le paramètre devrait être passé par référence (ByRef), et il y a un bogue.
it: Il parametro viene passato per valore, ma è assegnato un nuovo valore / riferimento. Considera invece di creare una copia locale se il chiamante non deve conoscere il nuovo valore. Se il chiamante dovesse vedere il nuovo valore, il parametro dovrebbe essere passato invece ByRef, e hai un bug.

# AssignmentNotUsedInspection
source: An assignment is immediately overridden by another assignment or is never referenced.
cs: Přiřazení je okamžitě přepsáno jiným přiřazením nebo na něj není nikdy odkazováno.
de: Eine Zuweisung wird direkt überschrieben oder nie referenziert.
es: Una asignación es anulada inmediatamente por otra asignación o nunca se hace referencia.
fr: Une assignation est écrasée par une assignation subséquente, ou la valeur assignée n'est jamais utilisée.
it: Un'assegnazione è immediatamente sovrascritta da un'altra assegnazione o non è mai referenziata.

# AttributeValueOutOfSyncInspection
source: A Rubberduck annotation is specified for a module or member, but the corresponding attribute has a different value. Module attributes and annotations need to be synchronized.
cs: Anotace Rubberducku je určena pro modul nebo člen, ale příslušný atribut má jinou hodnotu. Atributy modulu a anotace musejí být synchronizovány.
de: Eine Rubberduck-Annotation wurde für ein Modul oder Element festgelegt, aber das zugehörige Attribut hat einen anderen Wert. Die Modul-Attribute und Annotationen sollten synchronisiert werden.
es: Se especifica una anotación de Rubberduck para un módulo o miembro, pero el atributo correspondiente tiene un valor diferente. Los atributos del módulo y las anotaciones deben estar sincronizados.
fr: Une annotation Rubberduck est spécifiée pour un module ou un membre, mais l'attribut correspondant a une valeur différente: les attributs devraient être synchronisés avec les annotations.
it: Un'annotazione Rubberduck è specificata per un modulo o un membro, ma l'attributo corrispondente ha un valore diverso. Gli attributi e le annotazioni del modulo devono essere sincronizzati.

# BooleanAssignedInIfElseInspection
source: A member is assigned True/False in different branches of an if statement with no other statements in the conditional. Use the condition directly to the member instead.
cs: Členu je přiřazen True/False v různých větvích příkazu if bez dalších příkazů v podmínce. Použij místo toho podmínku přímo na člena.
de: Ein Element wird in verschiedenen Zweigen einer if-Anweisung mit True / False zugewiesen, wobei keine anderen Anweisungen in der Bedingung enthalten sind. Verwenden Sie die Bedingung stattdessen direkt (als Zuweisung) für das Element.
es: A un miembro se le asigna Verdadero / Falso en diferentes ramas de una declaración if sin otras declaraciones en el condicional. Utilice la condición directamente al miembro en su lugar.
fr: Une valeur Booléenne est assignée dans des branches conditionelles qui ne comportent aucune autre instruction. Remplacez la condition par une assignation directe.
it: A un membro viene assegnato Vero / Falso in diversi rami di un'istruzione if senza altre istruzioni condizionali. Utilizza invece la condizione direttamente al membro.

# ConstantNotUsedInspection
source: Rubberduck could not find any reference to constant. Consider removing the unused declaration.
cs: Rubberduck nemůže najít žádnou referenci ke konstantě. Zvažte odstranění nepoužitých deklarací.
de: Rubberduck konnte keine Referenz auf eine Konstante finden. Überlegen Sie eine Entfernung der nicht verwendeten Deklaration.
es: Rubberduck no pudo encontrar ninguna referencia a la constante. Considere la posibilidad de eliminar la declaración no utilizada.
fr: La constante est déclarée, mais Rubberduck n'a pu trouver aucune référence; la déclaration pourrait être supprimée.
it: Rubberduck non è riuscito a trovare alcun riferimento alla costante. Valuta la possibilità di rimuovere la dichiarazione inutilizzata.

# DefaultMemberRequiredInspection
source: The VBA compiler does not raise an error if an indexed default member call is required but the object's declared type does not have a suitable default member. Under almost all circumstances, this leads to a run-time error 91 'Object or With block variable not set' or 438 'Object doesn't support this property or method' depending on whether the object has the value 'Nothing' or not, which is harder to detect and indicates a bug.
cs: Kompilátor VBA nezpůsobí chybu, pokud je vyžadováno výchozí indexované volání člena, ale deklarovaný typ objektu nemá vhodný výchozí člen. Toto vede téměř za všech okolností k run-time chybě 91 'Object or With block variable not set' nebo chybě 438 'Object doesn't support this property or method' v závislosti na tom, zda má objekt hodnotu 'Nothing' nebo ne. Toto je těžké detekovat a indikuje to tedy chybu.
de: Der VBA-Compiler gibt keinen Fehler aus, wenn ein Standardelementzugriff nötig ist, aber der der deklarierte Type des Objekts kein passendes Standardelement hat. In fast allen Fällen führt dies zu einem Laufzeitfehler 91 'Objektvariable oder With-Blockvariable nicht festgelegt' oder 438 'Objekt unterstützt diese Eigenschaft oder Methode nicht' abhängig davon, ob die Variable den Wert 'Nothing' hat oder nicht, der schwerer zu entdecken ist und auf einen Programmierfehler hinweist.
fr: VBA n'indiquera pas d'erreur au moment de la compilation si l'appel indexé d'un membre par défaut est requis mais que le type de l'objet utilisé ne définit pas de membre par défaut avec un type compatible. Dans la presque totalité des cas ceci causera une erreur à l'exécution. Pour tous les autres cas, un type compatible doit être utilisé.
it: Il compilatore VBA non genera un errore se è richiesta una chiamata di membro predefinito indicizzato ma il tipo dichiarato dell'oggetto non dispone di un membro predefinito adatto. In quasi tutte le circostanze, questo porta a un errore di runtime 91 'Oggetto o variabile del blocco With non impostata' o 438 'L'oggetto non supporta questa proprietà o metodo' a seconda che l'oggetto abbia il valore 'Nothing' o meno, che è più difficile da rilevare e indica un bug.

# DefaultProjectNameInspection
source: Consider naming your VBA project.
cs: Zvažte pojmenování vašeho VBA projektu.
de: Erwäge Sie dem VBA-Projekt einen Namen zu geben.
es: Considera nombrar tu proyecto VBA.
fr: Considérez nommer votre projet VBA.
it: Considera di nominare il tuo progetto VBA.

# DefTypeStatementInspection
source: Using the 'Def[Type]' statement leads to specifying types by using a prefix. This style of naming is heavily discouraged and should be avoided.
cs: Používáním 'Def[Type]' výrazu vede ke specifikování typů užitím prefixu. Důrazně odrazujeme od používání tohoto stylu, měli byste se mu vyhnout za každou cenu.
de: Verwendung der 'Def[Type]' Anweisung führt zur Typspezifikation mit einem Präfix. Von diese Benennungskonvention wird stark abgeraten und sie sollte vermieden werden.
es: El uso de la declaración 'Def [Type]' lleva a especificar tipos utilizando un prefijo. Este estilo de denominación está muy desaconsejado y debe evitarse.
fr: L'utilisation d'instructions 'Def[Type]' permet le typage implicite d'après un préfixe. Ce type de nommage est fortement découragé dans du code moderne.
it: L'utilizzo dell'istruzione 'Def[Type]' consente di specificare i tipi utilizzando un prefisso. Questo stile di denominazione è fortemente scoraggiato e dovrebbe essere evitato.

# DuplicatedAnnotationInspection
source: An annotation is specified multiple times, but is intended to be specified only once.
cs: Anotace je specifikována vícenásobně, avšak měla by být zadána pouze jednou.
de: Eine Annotation wurde mehrmals spezifiziert, obwohl sie nur einmal spezifiziert werden soll.
es: Una anotación se especifica varias veces, pero se pretende que se especifique solo una vez.
fr: Une annotation à usage unique ne peut être spécifiée à plus d'un endroit dans un module.
it: Un'annotazione viene specificata più volte, mentre dovrebbe essere specificata solo una volta.

# EmptyCaseBlockInspection
source: An empty 'Case' block without any executable statements, leaves a maintainer wondering about the intent of the code. Avoid writing code that doesn't need to be written.
cs: Prázdný 'Case' blok bez jakýchkoli příkazů nechává osobu, která se na kód pak kouká, tápat, co je vlastně důvodem tohoto kódu. Vyhněte se prosím psaní kódu, který není potřeba být napsán.
de: Ein leerer 'Case'-Block ohne ausführbare Anweisungen lässt andere Entwickler über die Absicht des Codes im unklaren. Vermeiden Sie das Schreiben von unnötigem Code.
es: Un bloque 'Case' vacío sin ninguna instrucción ejecutable, deja a un programador preguntándose sobre la intención del código. Evite escribir código que no necesita ser escrito.
fr: Un bloc 'Case' vide, qui ne contient aucune instruction exécutable, laisse songeur quant aux intentions de l'auteur. Évitez d'écrire du code qui n'a pas besoin d'être écrit.
it: Un blocco 'Case' vuoto senza alcuna istruzione eseguibile, lascia un manutentore a chiedersi quale sia l'intento del codice. Evita di scrivere codice che non serve.

# EmptyDoWhileBlockInspection
source: An empty 'Do...While' loop without any executable statements, leaves a maintainer wondering about the intent of the code. Avoid writing code that doesn't need to be written.
cs: Prázdná 'Do...While' smyčka bez jakýchkoli příkazů nechává osobu, která se na kód pak kouká, tápat, co je vlastně důvodem tohoto kódu. Vyhněte se prosím psaní kódu, který není potřeba být napsán.
de: Eine leere 'Do…While'-Schleife ohne ausführbare Anweisungen lässt andere Entwickler über die Absicht des Codes im unklaren. Vermeiden Sie das Schreiben von unnötigem Code.
es: Un bucle 'Do...While' sin ninguna instrucción ejecutable deja a un programador preguntándose acerca de la intención del código. Evite escribir código que no necesita ser escrito.
fr: Un bloc 'Loop' vide, qui ne contient aucune instruction exécutable, laisse songeur quant aux intentions de l'auteur. Évitez d'écrire du code qui n'a pas besoin d'être écrit.
it: Un ciclo 'Do ... While' vuoto senza alcuna istruzione eseguibile, lascia un manutentore a chiedersi quale sia l'intento del codice. Evita di scrivere codice che non serve.

# EmptyElseBlockInspection
source: An empty 'Else' loop without any executable statements, leaves a maintainer wondering about the intent of the code. Avoid writing code that doesn't need to be written.
cs: Prázdná 'Else' smyčka bez jakýchkoli příkazů nechává osobu, která se na kód pak kouká, tápat, co je vlastně důvodem tohoto kódu. Vyhněte se prosím psaní kódu, který není potřeba být napsán.
de: Ein leerer 'Else'-Block ohne ausführbare Anweisungen lässt andere Entwickler über die Absicht des Codes im unklaren. Vermeiden Sie das Schreiben von unnötigem Code.
es: Un bucle 'Else' sin ninguna instrucción ejecutable, deja a un programador preguntándose acerca de la intención del código. Evite escribir código que no necesita ser escrito.
fr: Un block 'Else' vide, qui ne contient aucune instruction exécutable, laisse songeur quant aux intentions de l'auteur. Évitez d'écrire du code qui n'a pas besoin d'être écrit.
it: Un ciclo 'Else' vuoto senza alcuna istruzione eseguibile, lascia un manutentore a chiedersi quale sia l'intento del codice. Evita di scrivere codice che non serve.

# EmptyForEachBlockInspection
source: An empty 'For Each...Next' loop without any executable statements, leaves a maintainer wondering about the intent of the code. Avoid writing code that doesn't need to be written.
cs: Prázdná 'For Each...Next' smyčka bez jakýchkoli příkazů nechává osobu, která se na kód pak kouká, tápat, co je vlastně důvodem tohoto kódu. Vyhněte se prosím psaní kódu, který není potřeba být napsán.
de: Eine leere 'For Each…Next'-Schleife ohne ausführbare Anweisungen lässt andere Entwickler über die Absicht des Codes im unklaren. Vermeiden Sie das Schreiben von unnötigem Code.
es: Un bucle 'For Each...Next' sin declaraciones ejecutables deja a un programador preguntándose sobre la intención del código. Evite escribir código que no necesita ser escrito.
fr: Une boucle 'Loop' vide, qui ne contient aucune instruction exécutable, laisse songeur quant aux intentions de l'auteur. Évitez d'écrire du code qui n'a pas besoin d'être écrit.
it: Un ciclo 'For Each ... Next' vuoto senza alcuna istruzione eseguibile, lascia un manutentore a chiedersi quale sia l'intento del codice. Evita di scrivere codice che non serve.

# EmptyForLoopBlockInspection
source: An empty 'For...Next' loop without any executable statements, leaves a maintainer wondering about the intent of the code. Avoid writing code that doesn't need to be written.
cs: Prázdná 'For...Next' smyčka bez jakýchkoli příkazů nechává osobu, která se na kód pak kouká, tápat, co je vlastně důvodem tohoto kódu. Vyhněte se prosím psaní kódu, který není potřeba být napsán.
de: Eine leere 'For…Next'-Schleife ohne ausführbare Anweisungen lässt andere Entwickler über die Absicht des Codes im unklaren. Vermeiden Sie das Schreiben von unnötigem Code.
es: Un bucle 'For...Next' sin declaraciones ejecutables deja a un programador preguntándose sobre la intención del código. Evite escribir código que no necesita ser escrito.
fr: Une boucle 'For...Next' vide, qui ne contient aucune instruction exécutable, laisse songeur quant aux intentions de l'auteur. Évitez d'écrire du code qui n'a pas besoin d'être écrit.
it: Un ciclo 'For ... Next' vuoto senza alcuna istruzione eseguibile, lascia un manutentore a chiedersi quale sia l'intento del codice. Evita di scrivere codice che non serve.

# EmptyIfBlockInspection
source: An empty conditional branch without any executable statements, leaves a maintainer wondering about the intent of the code. Avoid writing code that doesn't need to be written.
cs: Prázdná podmínková větev bez jakýchkoli příkazů nechává osobu, která se na kód pak kouká, tápat, co je vlastně důvodem tohoto kódu. Vyhněte se prosím psaní kódu, který není potřeba být napsán.
de: Ein leerer 'If'-Block ohne ausführbare Anweisungen lässt andere Entwickler über die Absicht des Codes im unklaren. Vermeiden Sie das Schreiben von unnötigem Code.
es: Una rama condicional vacía sin declaraciones ejecutables deja a un programador preguntándose sobre la intención del código. Evite escribir código que no necesita ser escrito.
fr: Une branche conditionelle vide, qui ne contient aucune instruction exécutable, laisse songeur quant aux intentions de l'auteur. Évitez d'écrire du code qui n'a pas besoin d'être écrit.
it: Un ramo condizionale vuoto senza alcuna istruzione eseguibile, lascia un manutentore a chiedersi quale sia l'intento del codice. Evita di scrivere codice che non serve.

# EmptyMethodInspection
source: Methods without executable statements may appear to be doing something which they actually don't, and therefore causing unexpected behaviour.
cs: Zdá se, že metody bez spustitelných příkazů mohou dělat něco, co ve skutečnosti nedělají, a proto způsobují neočekávaná chování.
de: Methoden ohne ausführbare Anweisungen können den Eindruck erwecken, dass sie etwas tun, was sie eigentlich nicht tun. Dies kann zu unerwartetem Verhalten führen.
fr: Une procédure sans instructions exécutables peut avoir l'air d'accomplir quelque chose qu'elle ne fait pas, ce qui peut occasionner un comportement inattendu.
it: I metodi senza istruzioni eseguibili sembra che stiano facendo qualcosa che in realtà non fanno, causando quindi un comportamento imprevisto.
