Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/Inspections/InspectionResults.*.resx
Languages: cs, de, es, fr, it

# EncapsulatePublicFieldInspection
source: Public field '{0}' breaks encapsulation.
cs: Veřejné pole '{0}' porušuje zapouzdření.
de: Das öffentliche Feld '{0}' bricht die Kapselung.
es: El campo público '{0}' rompe el encapsulamiento.
fr: Le champ public '{0}' rompt l'encapsulation.
it: Il campo pubblico '{0}' rompe l'incapsulamento.

# MoveFieldCloserToUsageInspection
source: Move module-level variable '{0}' to a smaller scope.
cs: Přesunout proměnnou '{0}' v modulu do menšího rozsahu.
de: Veringere die den Geltungsbereich der Modulvariable '{0}'.
es: Mueva la variable de nivel de módulo '{0}' a un ámbito más pequeño.
fr: Restreindre la portée du champ '{0}'.
it: Sposta la variabile a livello di modulo '{0}' in un ambito più piccolo.

# ProcedureCanBeWrittenAsFunctionInspection
source: Procedure '{0}' can be written as a function.
cs: Procedura '{0}' může být napsána jako funkce.
de: Prozedur '{0}' kann als Funktion geschrieben werden.
es: El procedimiento '{0}' se puede escribir como una función.
fr: La procédure '{0}' pourrait être une fonction.
it: La procedura '{0}' può essere scritta come una funzione.

# IdentifierNameInspection
source: Consider renaming {0} '{1}'.
cs: Zvažte přejmenování {0} '{1}'.
de: Ziehen Sie in Erwägung, {0} '{1}' umzubenennen.
es: Considere cambiar el nombre de {0} '{1}'.
fr: Considérez renommer {0} '{1}'.
it: Valuta la possibilità di rinominare {0} '{1}'.

# WriteOnlyPropertyInspection
source: Property '{0}' has no getter.
cs: Property '{0}' nemá žádný 'getter'.
de: Eigenschaft '{0}' hat keinen Getter.
es: La propiedad '{0}' no tiene Getter.
fr: La propriété '{0}' n'a pas d'accesseur (Get).
it: La proprietà '{0}' non ha getter.

# SelfAssignedDeclarationInspection
source: Object reference '{0}' is auto-instantiated.
cs: Reference '{0}' objektu je automaticky instancovaná.
de: Objekt-Referenz '{0}' ist sebstzugewiesen.
es: La referencia de objeto '{0}' se crea automáticamente.
fr: La variable '{0}' est assignée lors de sa déclaration.
it: Il riferimento all'oggetto '{0}' è istanziato automaticamente.

# FunctionReturnValueAlwaysDiscardedInspection
source: Return value of function '{0}' is never used.
cs: Návratová hodnota funkce '{0}' není nikdy použita.
de: Der Rückgabewert der Funktion '{0}' wird immer verworfen.
es: El valor de retorno de la función '{0}' no se usa nunca.
fr: La valeur renvoyée par la fonction '{0}' n'est jamais utilisée.
it: Il valore di ritorno della funzione '{0}' non è mai utilizzato.

# AssignedByValParameterInspection
source: Parameter '{0}' is passed 'ByVal' and assigned a value.
cs: Parametr '{0}' je předán pomocí ByVal a je mu přiřazena hodnota.
de: Der Parameter '{0}' wird als byVal übergeben und bekommt einen Wert zugewiesen.
es: El parámetro '{0}' se pasa 'ByVal' y se le asigna un valor.
fr: Le paramètre '{0}' passé par valeur est assigné.
it: Il parametro '{0}' viene passato 'ByVal' e gli viene assegnato un valore.

# IdentifierNotUsedInspection
source: {0} '{1}' is not used.
cs: {0} '{1}' není použito.
de: {0} '{1}' wird nicht genutzt.
es: {0} '{1}' no se usa.
fr: {0} '{1}' n'est pas utilisé(e).
it: {0} '{1}' non è usato.

# ImplicitPublicMemberInspection
source: Member '{0}' is implicitly public.
cs: Člen '{0}' je implicitně veřejný.
de: Methode '{0}' ist implizit 'Public'.
es: El miembro '{0}' es implícitamente público.
fr: Le membre '{0}' est implicitement public.
it: Il membro '{0}' è implicitamente pubblico.

# ImplicitVariantDeclarationInspection
source: {0} '{1}' is implicitly 'Variant'.
cs: {0} '{1}' je implicitně typu 'Variant'.
de: {0} '{1}' ist implizit 'Variant'.
es: {0} '{1}' es implícitamente 'Variant'.
fr: {0} '{1}' est implicitement de type Variant.
it: {0} '{1}' è implicamente 'Variant'.

# ImplicitVariantReturnTypeInspection
source: Return type of member '{0}' is implicitly 'Variant'.
cs: Návratná hodnota členu '{0}' je implicitně typu 'Variant'.
de: Der Rückgabewert der Methode '{0}' ist implizit 'Variant'.
es: El tipo de devolución del miembro '{0}' es implícitamente 'Variant'.
fr: La valeur de retour du membre '{0}' est implicitement 'Variant'.
it: Il tipo restituito del membro '{0}' è implicitamente "Variant".

# MultilineParameterInspection
source: Parameter '{0}' is specified on multiple lines.
cs: Parametr '{0}' je specifikován na více řádcích.
de: Der Parameter '{0}' wird über mehrere Zeilen angegeben.
es: El parámetro '{0}' se especifica en varias líneas.
fr: Le paramètre '{0}' est déclaré sur plusieurs lignes.
it: Il parametro '{0}' è specificato su più righe.

# NonReturningFunctionInspection
source: Return value for member '{0}' is never assigned.
cs: Návratná hodnota členu '{0}' není nikdy přiřazena.
de: Der Rückgabewert der Methode '{0}' wird nicht zugewiesen.
es: El valor de retorno para el miembro '{0}' nunca se asigna.
fr: La valeur de retour du membre '{0}' n'est pas assignée.
it: Il valore restituito per il membro '{0}' non viene mai assegnato.

# ObsoleteGlobalInspection
source: {0} '{1}' uses obsolete 'Global' access modifier.
cs: {0} '{1}' používá zastaralý 'Global' modifikátor přístupu.
de: {0} '{1}' verwendet die veraltete 'Global' Zugriffsdeklaration.
es: {0} '{1}' usa un modificador de acceso 'Global' obsoleto.
fr: {0} '{1}' utilise le modificateur obsolète 'Global'.
it: {0} '{1}' utilizza un modificatore di accesso 'Global' obsoleto.

# ParameterCanBeByValInspection
source: Parameter '{0}' can be passed by value.
cs: Parametr '{0}' může být předán jako hodnota.
de: Der Parameter '{0}' kann als Wert übergeben werden.
es: El parámetro '{0}' se puede pasar por valor.
fr: Le paramètre '{0}' peut être passé par valeur.
it: Il parametro '{0}' può essere passato per valore.

# ProcedureShouldBeFunctionInspection
source: Procedure '{0}' can be written as a function.
cs: Procedura '{0}' může být přepsána jako funkce.
de: Die Prozedur '{0}' kann als Funktion geschrieben werden.
es: El procedimiento '{0}' se puede escribir como una función.
fr: La procédure '{0}' pourrait être une fonction.
it: La procedura '{0}' può essere scritta come una funzione.

# UnassignedVariableUsageInspection
source: Variable '{0}' is used but not assigned.
cs: Proměnná '{0}' je použita, ale nepřiřazena.
de: Die Variable '{0}' wird verwendet ohne ihr einen Wert zuzuweisen.
es: La variable '{0}' se usa pero no se asigna.
fr: La variable '{0}' est utilisée, mais non assignée.
it: Variabile '{0}' usata ma non assegnata.

# OptionExplicitInspection
source: 'Option Explicit' is not specified in '{0}'.
cs: V '{0}' není specifikováno 'Option Explicit'.
de: 'Option Explicit' ist für '{0}' nicht angegeben.
es: 'Option Explicit' no se especifica en '{0}'.
fr: 'Option Explicit' n'est pas spécifiée dans le module '{0}'.
it: 'Option Explicit' non è specificato in '{0}'.

# VariableNotAssignedInspection
source: Variable '{0}' is not assigned.
cs: Proměnná '{0}' není přidělena.
de: Der Variable '{0}' wird kein Wert zugewiesen.
es: La variable '{0}' no está asignada.
fr: La variable '{0}' n'est jamais assignée.
it: La variabile '{0}' non è assegnata.

# EmptyStringLiteralInspection
source: 'vbNullString' preferred to empty string literals.
cs: Preferujte 'vbNullString' před prázdným znakem řetězce "".
de: 'vbNullString' sollte statt einem leeren String-Literal verwendet werden.
es: Es recomendable usar 'vbNullString' para cadenas vacías.
fr: Préférez 'vbNullString' à une chaîne de caractères vide.
it: 'vbNullString' è da preferire ai letterali stringa vuoti.

# ObjectVariableNotSetInspection
source: Object variable '{0}' is assigned without the 'Set' keyword.
cs: Proměnná '{0}' objektu je přidělena bez použití klíčového slova 'Set'.
de: Objektvariable '{0}' wird ohne das 'Set'-Schlüsselwort zugewiesen.
es: La variable de objeto '{0}' se asigna sin la palabra clave 'Set'.
fr: La variable '{0}' est assignée dans le mot-clé 'Set'.
it: La variabile oggetto '{0}' viene assegnata senza la parola chiave "Set".

# VariableTypeNotDeclaredInspection
source: {0} '{1}' is implicitly 'Variant'.
cs: {0} '{1}' je implicitně typu 'Variant'.
de: {0} '{1}' ist implizit 'Variant'.
es: {0} '{1}' es implícitamente 'Variant'.
fr: {0} '{1}' est implicitement de type 'Variant'.
it: {0} '{1}' è implicitamente 'Variant'.

# ObsoleteCommentSyntaxInspection
source: Comment uses obsolete 'Rem' marker.
cs: Komentář používá zastaralou 'Rem' značku.
de: Kommentar verwendet die obsolete 'REM'-Markierung.
es: El comentario usa el marcador 'Rem' obsoleto.
fr: Le commentaire utilise la forme obsolète 'Rem'.
it: Il commento utilizza un marcatore 'Rem' obsoleto.

# DefaultProjectNameInspection
source: Project '{0}' has the default project name.
cs: Projekt '{0}' má výchozí jméno.
de: Projekt '{0}' hat den Standardnamen.
es: El proyecto '{0}' tiene un nombre predeterminado.
fr: Le projet '{0}' n'est pas nommé.
it: Il progetto '{0}' ha il nome del progetto predefinito.

# ObsoleteCallStatementInspection
source: Assignment uses obsolete 'Call' modifier.
cs: Přiřazení používá zastaralý 'Call' modifikátor.
de: Verwendung der veralteten 'Call'-Anweisung.
es: La asignación utiliza el modificador de 'Call' obsoleto.
fr: L'assignation utilise le mot-clé obsolète 'Call'.
it: L'assegnazione utilizza un modificatore 'Call' obsoleto.

# ObsoleteLetStatementInspection
source: Assignment uses obsolete 'Let' modifier.
cs: Přiřazení používá zastaralý 'Let' modifikátor.
de: Verwendung der veralteten 'Let'-Anweisung.
es: La asignación utiliza el modificador 'Let' obsoleto.
fr: L'assignation utilise le mot-clé obsolète 'Let'.
it: L'assegnazione utilizza un modificatore obsoleto 'Let'.

# ImplicitActiveSheetReferenceInspection
source: Member '{0}' implicitly references 'ActiveSheet'.
cs: Člen '{0}' implicitně odkazuje na 'ActiveSheet'.
de: Member '{0}' referenziert implizit auf 'ActiveSheet'.
es: El miembro '{0}' hace referencia implícitamente a 'ActiveSheet'.
fr: Le membre '{0}' réfère implicitement à la feuille active.
it: Il membro '{0}' fa riferimento implicitamente ad 'ActiveSheet'.

# ImplicitActiveWorkbookReferenceInspection
source: Member '{0}' implicitly references 'ActiveWorkbook'.
cs: Člen'{0}' implicitně odkazuje na 'ActiveWorkbook'.
de: Member '{0}' referenziert implizit auf 'ActiveWorkbook'.
es: El miembro '{0}' hace referencia implícitamente a 'ActiveWorkbook'.
fr: Le membre '{0}' réfère implicitement au classeur actif.
it: Il membro '{0}' fa riferimento implicitamente ad 'ActiveWorkbook'.

# UntypedFunctionUsageInspection
source: Replace function '{0}' with existing typed function.
cs: Nahradit funkci '{0}' existující typovou funkcí.
de: Ersetze Funktion {0} mit der existierenden typisierten Funktion.
es: Reemplace la función '{0}' con la función tipada existente.
fr: Remplacer la fonction '{0}' par la fonction typée équivalente.
it: Sostituisci la funzione '{0}' con una funzione che restituisce un tipo.

# OptionBaseInspection
source: Component '{0}' uses 'Option Base 1'.
cs: Komponenta '{0}' používá 'Option Base 1'.
de: Komponente '{0}' verwendet 'Option Base 1'.
es: El componente '{0}' usa 'Option Base 1'.
fr: Le module '{0}' utilise 'Option Base 1'.
it: Il componente '{0}' usa 'Option Base 1'.

# ObsoleteTypeHintInspection
source: {0} of {1} '{2}' uses an obsolete type hint.
cs: {0} z {1} '{2}' používá zastaralou typovou nápovědu.
de: {0} von {1} '{2}' verwendet einen obsoleten Typenhinweis.
es: {0} de {1} '{2}' usa una sugerencia de tipo obsoleta.
fr: {0} de {1} '{2}' utilise un indicateur de type.
it: {0} di {1} '{2}' utilizza un suggerimento di tipo obsoleto.

# MultipleDeclarationsInspection
source: Instruction contains multiple declarations.
cs: Instrukce obsahuje množství deklarací.
de: Instruktion enthält Mehrfachdeklaration.
es: La instrucción contiene múltiples declaraciones.
fr: L'instruction comporte plusieurs déclarations.
it: L'istruzione contiene più dichiarazioni.

# MissingAnnotationArgumentInspection
source: The annotation '{0}' was expected to have more arguments.
cs: Anotace '{0}' očekávala více argumentů.
de: Die Annotation '{0}' erwartet mehr Argumente.
es: Se esparaba que la anotación '{0}' tuviera más argumentos.
fr: Un paramètre était attendu dans l'annotation '{0}'.
it: L'annotazione '{0}' avrebbe dovuto contenere più argomenti.

# UndeclaredVariableInspection
source: Local variable '{0}' is not declared.
cs: Lokální proměnná '{0}' není deklarována.
de: Die lokale Variable '{0}' wurde nicht deklariert.
es: La variable local '{0}' no está declarada.
fr: La variable locale '{0}' n'est pas déclarée.
it: La variabile locale '{0}' non è dichiarata.

# ModuleScopeDimKeywordInspection
source: Module-level variable '{0}' is declared with the 'Dim' keyword.
cs: Proměnná '{0}' na úrovni modulu je deklarována klíčovým slovem 'Dim'.
de: Die Modulvariable '{0}' ist mit dem 'Dim'-Schlüsselwort deklariert.
es: La variable de nivel de módulo '{0}' se declara con la palabra clave 'Dim'.
fr: La variable module '{0}' est déclarée avec le mot-clé 'Dim'.
it: La variabile a livello di modulo '{0}' viene dichiarata con la parola chiave 'Dim'.

# AggregateInspection
source: {0} ({1} results)
cs: {0} ({1} výsledky)
de: {0} ({1} Ergebnisse)
es: {0} ({1} resultados)
fr: {0} ({1} résultats)
it: {0} ({1} risultati)

# ApplicationWorksheetFunctionInspection
source: Use of late bound 'Application.{0}' member.
cs: Použití pozdního bound člena Application.{0}.
de: Laufzeitgebundene Nutzung des Application.{0} Members.
es: Uso en tiempo de ejecución del miembro 'Application.{0}'.
fr: Utilisation du membre à liaison tardive Application.{0}.
it: Utilizzo del membro 'Application. {0}' con associazione tardiva.

# HostSpecificExpressionInspection
source: Expression '{0}' cannot be validated at compile-time.
cs: Výraz '{0}' nelze validovat v čase kompilace.
de: Ausdruck '{0}' kann zur Kompilierzeit nicht validiert werden.
es: La expresión '{0}' no se puede validar en tiempo de compilación.
fr: L'espression '{0}' ne peut être validée lors de la compilation.
it: L'espressione '{0}' non può essere convalidata in fase di compilazione.

# MemberNotOnInterfaceInspection
source: Member '{0}' was not found on the compile-time interface for type '{1}'.
cs: Člen '{0}' nebyl nalezen pro typ '{1}' v čase kompilace.
de: Element '{0}' ist auf dem Interface für '{1}' nicht deklariert.
es: El miembro '{0}' no se encontró en la interfaz de tiempo de compilación para el tipo '{1}'.
fr: Le membre '{0}' n'est pas exposé par l'interface du type '{1}'.
it: Il membro '{0}' non è stato trovato nell'interfaccia in fase di compilazione per il tipo '{1}'.

# OptionBaseZeroInspection
source: Component '{0}' uses 'Option Base 0'.
cs: Komponenta '{0}' používá 'Option Base 1'.
de: Komponente '{0}' verwendet 'Option Base 0'.
es: El componente '{0}' usa 'Option Base 0'.
fr: Le module '{0}' spécifie 'Option Base 0'.
it: Il componente '{0}' usa 'Option Base 0'.

# ImplicitByRefModifierInspection
source: Parameter '{0}' is implicitly passed by reference.
cs: Parametr '{0}' je implicitně předán jako reference.
de: Der Parameter '{0}' wird implizit als Referenz übergeben.
es: El parámetro '{0}' se pasa implícitamente por referencia.
fr: Le paramètre '{0}' est passé implicitement par référence.
it: Il parametro '{0}' viene passato implicitamente per riferimento.

# LineLabelNotUsedInspection
source: Line label '{0}' is not used.
cs: Nálepka '{0}' řádku není použita.
de: Die Zeilenbezeichnung '{0}' wird nicht verwendet.
es: La etiqueta de línea '{0}' no se usa.
fr: L'étiquette de ligne '{0}' n'est pas utilisée.
it: L'etichetta di riga '{0}' non è utilizzata.

# RedundantByRefModifierInspection
source: Parameter '{0}' has a redundant 'ByRef' modifier.
cs: Parametr má '{0}' má nadbytečný modifikátor 'ByRef'.
de: Der Parameter '{0}' hat eine redundante 'ByRef'-Markierung.
es: El parámetro '{0}' tiene un modificador 'ByRef' redundante.
fr: Le paramètre '{0}' a un modificateur 'ByRef' redondant.
it: Il parametro '{0}' ha un modificatore 'ByRef' ridondante.

# EmptyIfBlockInspection
source: 'If' block contains no executable statements.
cs: 'If' blok neobsahuje žádné spustitelné příkazy.
de: 'If'-Block enthält keine ausführbaren Anweisungen.
es: El bloque 'If' no contiene sentencias ejecutables.
fr: Bloc 'If' n'exécute aucune instruction.
it: Il blocco 'If' non contiene istruzioni eseguibili.

# RedundantOptionInspection
source: '{0}' has no effect.
cs: '{0}' nemá žádný efekt.
de: '{0}' hat keine Auswirkung.
es: '{0}' no tiene efecto.
fr: '{0}' n'a aucun effet.
it: '{0}' non ha effetto.

# MissingAttributeInspection
source: Module or member '{0}' has a '{1}' annotation, but no corresponding attribute.
cs: Modul nebo člen '{0}' má '{1}' anotaci, ale žádný korespondující atribut.
de: Modul oder Element '{0}' hat eine '{1}' Annotation, aber das zugehörige Attribut fehlt.
es: El módulo o miembro '{0}' tiene una anotación '{1}', pero no tiene el atributo correspondiente.
fr: Le module ou membre '{0}' a l'annotation '{1}', mais pas l'attribut correspondant.
it: Il modulo o il membro '{0}' ha un'annotazione '{1}', ma nessun attributo corrispondente.

# EmptyCaseBlockInspection
source: 'Case' block contains no executable statements.
cs: 'Case' blok neobsahuje žádné spustitelné příkazy.
de: 'Case'-Block enthält keine ausführbaren Anweisungen.
es: El bloque 'Case' no contiene sentencias ejecutables.
fr: Un bloc 'Case' ne contient aucune instruction exécutable.
it: Il blocco 'Case' non contiene istruzioni eseguibili.

# StopKeywordInspection
source: 'Stop' keyword halts execution.
cs: Klíčové slovo 'Stop' pozastavuje vykonávání.
de: Das Schlüsselwort 'Stop' unterbricht die Ausführung.
es: La palabra clave 'Stop' detiene la ejecución.
fr: Le mot-clé 'Stop' halte l'exécution.
it: La parola chiave 'Stop' interrompe l'esecuzione.

# ShadowedDeclarationInspection
source: {0} '{1}' hides {2} '{3}'.
cs: {0} '{1}' skrývá {2} '{3}'.
de: {0} '{1}' überschattet {2} '{3}'.
es: {0} '{1}' oculta {2} '{3}'.
fr: {0} '{1}' cache {2} '{3}'.
it: {0} '{1}' nasconde {2} '{3}'.

# ObsoleteErrorSyntaxInspection
source: A run-time error is raised using the obsolete 'Error' statement.
cs: Run-time error byl vyvolán použitím zastaralého 'Error' příkazu.
de: Ein Laufzeitfehler wird mit der veralteten 'Error'-Anweisung ausgelöst.
es: Se genera un error en tiempo de ejecución utilizando la declaración 'Error' obsoleta.
fr: Une erreur d'exécution est générée à l'aide de l'instruction obsolète 'Error'.
it: Viene generato un errore di runtime utilizzando l'istruzione 'Error' obsoleta.

# EmptyForEachBlockInspection
source: 'For...Each' loop contains no executable statements.
cs: 'For-Each' smyčka neobsahuje žádné spustitelné příkazy.
de: 'For Each…Next'-Schleife enthält keine ausführbaren Anweisungen.
es: El bucle 'For...Each' no contiene sentencias ejecutables.
fr: Boucle 'For Each...Next' n'exécute aucune instruction.
it: Il ciclo 'For ... Each' non contiene istruzioni eseguibili.

# EmptyElseBlockInspection
source: 'Else' block contains no executable statements.
cs: 'Else' blok neobsahuje žádné spustitelné příkazy.
de: 'Else'-Block enthält keine ausführbaren Anweisungen.
es: El bloque 'Else' no contiene sentencias ejecutables.
fr: Bloc 'Else' n'exécute aucune instruction.
it: Il blocco 'Else' non contiene istruzioni eseguibili.

# EmptyForLoopBlockInspection
source: 'For...Next' loop contains no executable statements.
cs: 'For...Next' smyčka neobsahuje žádné spustitelné příkazy.
de: 'For…Next'-Schleife enthält keine ausführbaren Anweisungen.
es: El bucle 'For...Next' no contiene sentencias ejecutables.
fr: Boucle 'For...Next' n'exécute aucune instruction.
it: Il ciclo 'For ... Next' non contiene istruzioni eseguibili.

# IntegerDataTypeInspection
source: {0} '{1}' is declared as 'Integer'.
cs: {0} '{1}' je deklarován jako Integer.
de: {0} '{1}' ist als Integer deklariert.
es: {0} '{1}' se declara como 'Integer'.
fr: {0} '{1}' est déclarée 'As Integer'.
it: {0} '{1}' è dichiarato come 'Integer'.

# EmptyWhileWendBlockInspection
source: 'While...Wend' loop contains no executable statements.
cs: 'While...Wend' smyčka neobsahuje žádné spustitelné příkazy.
de: 'While…Wend'-Schleife enthält keine ausführbaren Anweisungen.
es: El bucle 'While...Wend' no contiene sentencias ejecutables.
fr: Boucle 'While...Wend' n'exécute aucune instruction.
it: Il ciclo 'While ... Wend' non contiene istruzioni eseguibili.

# EmptyDoWhileBlockInspection
source: 'Do...While' loop contains no executable statements.
cs: 'Do...While' smyčka neobsahuje žádné spustitelné příkazy.
de: 'Do…While'-Schleife enthält keine ausführbaren Anweisungen.
es: El bucle 'Do...While' no contiene sentencias ejecutables.
fr: Une boucle 'Do...While' vide, qui ne contient aucune instruction exécutable, laisse songeur quant aux intentions de l'auteur. Évitez d'écrire du code qui n'a pas besoin d'être écrit.
it: Il ciclo 'Do ... While' non contiene istruzioni eseguibili.

# BooleanAssignedInIfElseInspection
source: Boolean literal '{0}' assigned in conditional
cs: Boolean znak '{0}' byl zadán v podmínce
de: Boolean Ausdruck '{0}' wurde in einer trivialen If/Else-Verzweigung zugewiesen
es: Literal booleano '{0}' asignado en condicional
fr: Valeur Booléenne littérale '{0}' assignée dans une structure conditionnelle
it: Valore letterale booleano '{0}' assegnato in condizionale

# EmptyModuleInspection
source: Module/class '{0}' is empty.
cs: Modul/třída {0} je prázdná.
de: Modul/Klasse {0} ist leer.
es: El módulo/clase '{0}' está vacío.
fr: Le module/classe {0} est vide.
it: Il modulo / classe '{0}' è vuoto.

# UnhandledOnErrorResumeNextInspection
source: Errors are ignored but never handled again.
cs: Errory jsou ignorovány, avšak už nikdy neřešeny.
de: Fehler werden ignoriert aber nie wieder behandelt.
es: Los errores se ignoran pero nunca se manejan de nuevo.
fr: La gestion d'erreurs est désactivée sans être réactivée.
it: Gli errori sono ignorati ma non sono più gestiti.

# DefTypeStatementInspection
source: Consider the explicit use of 'As {0}' instead of '{1}'.
cs: Zvažte explicitní použití 'As {0}' místo '{1}'.
de: Statt '{1}' explizit 'As {0}' verwenden.
es: Considere el uso explícito de 'As {0}' en lugar de '{1}'.
fr: Considérez l'utilisation de clause explicite 'As {0}' plutôt que '{1}'.
it: Considera l'uso esplicito di 'As {0}' invece di '{1}'.

# StepOneIsRedundantInspection
source: 1 is the default step in a 'For...Next' loop and therefore is redundant.
cs: 1 je výchozí krok pro 'for-next' smyčku a je tedy zbytečné ho definovat.
de: 1 ist der Standardwert für 'Step' in einer 'For-Next'-Schleife und daher redundant.
es: 1 es el incremento predeterminado en un bucle 'For ... Next' y, por lo tanto, es redundante.
fr: 1 est la valeur d'incrémentation par défaut pour toute boucle 'For...Next'.
it: 1 è il passo predefinito in un ciclo 'For...Next' e quindi è ridondante.

# StepIsNotSpecifiedInspection
source: 'Step' not specified.
cs: 'Step' není specifikován.
de: Step ist nicht angegeben.
es: 'Step' (incremento) no especificado.
fr: Clause 'Step' non spécifiée.
it: 'Step' non specificato.

# SheetAccessedUsingStringInspection
source: Statically accessible sheet can be referred to by its code name.
cs: Staticky přístupný list lze referovat jeho kódovým jménem.
de: Statisch erreichbares Tabellenblatt kann mit dem Code-Namen referenziert werden.
es: La hoja estáticamente accesible puede ser referida por su nombre en código.
fr: Une feuille Excel accessible statiquement peut être référée en utilisant son nom de code.
it: Il foglio accessibile staticamente può essere indicato con il nome in codice.

# ObsoleteMemberUsageInspection
source: Consider replacing the call to '{0}'. {1}
cs: Zvažte nahrazení volání '{0}'. {1}
de: Erwägen Sie, den Aufruf von '{0}' zu ersetzen. {1}
es: Considere reemplazar la llamada a '{0}'. {1}
fr: Considérez remplacer l'appel par '{0}'.{1}
it: Valuta la possibilità di sostituire la chiamata a '{0}'. {1}
