Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/Inspections/QuickFixes.*.resx
Languages: cs, de, es, fr, it

# EmptyStringLiteralInspectionQuickFix
source: Replace empty string literal with the 'vbNullString' constant
cs: Nahraď prázdný řetěz "" za konstantu 'vbNullString'
de: Leeren String durch die Konstante 'vbNullString' ersetzen
es: Reemplazar la cadena vacía por la constante 'vbNullString'
fr: Remplacer "" par la constante 'vbNullString'
it: Sostituire le stringhe vuote literal con la costante 'vbNullString'

# EncapsulatePublicFieldInspectionQuickFix
source: Encapsulate field '{0}' with a property
cs: Použij property pro zapouzdři pole '{0}'
de: Das Feld '{0}' mit einer Eigenschaft kapselen
es: Encapsular el campo '{0}' con una propiedad
fr: Encapsuler le champ '{0}' avec une propriété
it: Incapsula il campo '{0}' con una proprietà

source: Ignore once
cs: Jednou ignoruj
de: Einmal ignorieren
es: Ignorar una vez
fr: Ignorer à cet emplacement
it: Ignora una volta

# ProcedureShouldBeFunctionInspectionQuickFix
source: Implement as function and update usages.
cs: Implementuj jako funkci a obnov použití.
de: Als Funktion implementieren und Aufrufe anpassen.
es: Implementar como función y actualizar usos.
fr: Implémenter comme une fonction, et mettre à jour les appels.
it: Implementa come funzione e aggiorna gli usi.

# ConvertFunctionToProcedureQuickFix
source: Convert function to procedure
cs: Zkonvertuj funkci na proceduru
de: Funktion zu Prozedur konvertieren
es: Convertir la función a procedimiento
fr: Convertir la fonction en procédure
it: Converti la funzione in procedura

# DeclareAsExplicitVariantQuickFix
source: Declare as explicit Variant
cs: Deklaruj jako explicitní 'Variant'
de: Als explizit 'Variant' deklarieren
es: Declarar como "Variant" explícita
fr: Déclarer explicitement comme Variant
it: Dichiara come Variant esplicito

# MakeSingleLineParameterQuickFix
source: Write variable on one line
cs: Zapisuj proměnné na jeden řádek
de: Variable in einer Zeile schreiben
es: Escribir variable en una linea
fr: Déclarer la variable sur une seule ligne
it: Scrivi la variabile su una riga

# ObsoleteGlobalInspectionQuickFix
source: Replace 'Global' access modifier with 'Public'
cs: Nahraď 'Global' přístupový modifikátor za 'Public'
de: 'Global' durch 'Public' ersetzen
es: Reemplazar el modificador de acceso 'Global' con 'Public'
fr: Remplacer le modificateur 'Global' par 'Public'
it: Sostituisci il modificatore di accesso 'Global' con 'Public'

# OptionExplicitQuickFix
source: Specify 'Option Explicit'
cs: Specifikuj 'Option Explicit'
de: 'Option Explicit' setzen
es: Especificar 'Option Explicit'
fr: Spécifier 'Option Explicit'
it: Specificare 'Option Explicit'

# PassParameterByReferenceQuickFix
source: Pass parameter by reference
cs: Předej parametr odkazem (ByRef)
de: Parameter als Referenz übergeben
es: Pasar el parámetro por referencia
fr: Passer le paramètre par référence
it: Passa parametro per riferimento

# PassParameterByValueQuickFix
source: Pass parameter by value
cs: Předej parametr hodnotou (ByVal)
de: Parameter als Wert übergeben
es: Pasar parámetro por valor
fr: Passer le paramètre par valeur
it: Passa parametro per valore

# RemoveCommentQuickFix
source: Remove comment
cs: Odstraň komentář
de: Kommentar entfernen
es: Eliminar comentario
fr: Supprimer le commentaire
it: Rimuovi commento

# RemoveObsoleteStatementQuickFix
source: Remove obsolete statement
cs: Odstraň zastaralé prohlášení
de: Überflüssige Anweisungen entfernen
es: Eliminar declaración obsoleta
fr: Supprimer l'instruction obsolète
it: Rimuovi istruzione obsoleta

# RemoveTypeHintsQuickFix
source: Remove type hints
cs: Odstraň typovou nápovědu
de: Typ-Hinweise entfernen
es: Eliminar sugerencias de tipo
fr: Supprimer les indicateurs de type
it: Rimuovi i suggerimenti sul tipo

# RemoveUnassignedIdentifierQuickFix
source: Remove unassigned variable
cs: Odstraň nepřiřazenou proměnnou
de: Nicht verwendete Variablen entfernen
es: Eliminar variable sin asignar
fr: Supprimer la variable inutilisée
it: Rimuovi la variabile non assegnata

# RemoveUnassignedVariableUsageQuickFix
source: Remove usage (breaks code)
cs: Odstraň použití (rozbije kód)
de: Nutzung enfernen (unterbricht den Code)
es: Eliminar uso (rompe código)
fr: Supprimer l'utilisation (brise le code)
it: Rimuovi utilizzo (interrompe il codice)

# RemoveUnusedDeclarationQuickFix
source: Remove unused declaration
cs: Odstraň nepoužitou deklaraci
de: Unbenutze Deklaration enfernen
es: Eliminar declaración no utilizada
fr: Supprimer la déclaration inutilisée
it: Rimuovi la dichiarazione inutilizzata

# RemoveUnusedParameterQuickFix
source: Remove unused parameter
cs: Odstraň nepoužitý parametr
de: Nicht genutzte Parameter entfernen
es: Eliminar parámetro no utilizado
fr: Supprimer le paramètre inutilisé
it: Rimuovi il parametro inutilizzato

# ReplaceCommentMarkerQuickFix
source: Replace 'Rem' usage with a single-quote comment marker
cs: Zaměň použití 'Rem' s použitím znaku klasických komentářů: "'"
de: 'REM' durch einfaches Anführungszeichen als Kommentarzeichen ersetzen
es: Reemplazar el uso 'Rem' con un marcador de comillas simples
fr: Remplacer 'Rem' par une apostrophe
it: Sostituisci l'utilizzo di 'Rem' con un indicatore di commento a virgolette singole

# SetExplicitVariantReturnTypeQuickFix
source: Return explicit Variant
cs: Vrať jako explicitní 'Variant'
de: Explizit 'Variant' zurückgeben
es: Variant explícita de retorno
fr: Retourner une valeur 'Variant' explicite
it: Restituisci Variant esplicito

# SpecifyExplicitPublicModifierQuickFix
source: Specify Public access modifier explicitly
cs: Explicitně specifikuj 'Public access' modifikátor
de: Gültigkeitsbereich 'Public' explizit definieren
es: Especificar explícitamente el modificador de acceso 'Public'
fr: Spécifier le modificateur 'Public' explicitement
it: Specificare esplicitamente il modificatore di accesso pubblico

# SplitMultipleDeclarationsQuickFix
source: Separate multiple declarations into multiple instructions
cs: Odděl více deklarací do několika instrukcí
de: Mehrfach-Deklarationen in einer Zeile durch Deklaration in getrennten Zeilen ersetzen
es: Separar las declaraciones múltiples en instrucciones múltiples
fr: Séparer les déclarations en plusieurs instructions
it: Separare più dichiarazioni in più istruzioni

# InvalidContextTypeInspectionFix
source: Context type '{0}' is not valid for {1}.
cs: Kontexový typ '{0}' není platný pro '{1}'.
de: Kontexttyp '{0}' ist nicht gültig für {1}.
es: El tipo de contexto '{0}' no es válido para {1}.
fr: Le contexte '{0}' est invalide pour '{1}'.
it: Il tipo di contesto '{0}' non è valido per {1}.

# SetObjectVariableQuickFix
source: Use 'Set' keyword
cs: Použij klíčové slovo 'Set'
de: Das Schlüsselwort 'Set' benutzen
es: Usar la palabra clave 'Set'
fr: Utiliser le mot-clé 'Set'
it: Usa la parola chiave 'Set'

# IntroduceLocalVariableQuickFix
source: Introduce local variable
cs: Představ lokální proměnnou
de: Lokale Variable einführen
es: Introducir variable local
fr: Introduire une variable locale
it: Introduci una variabile locale

# IntroduceGetAccessorQuickFix
source: Add 'Property Get' accessor
cs: Přidej accessor 'property get'
de: 'Property Get' Zugriff hinzufügen
es: Añadir Get a propiedad
fr: Ajouter un accesseur 'Property Get'
it: Aggiungi l'accessor 'Property Get'

# ChangeDimToPrivateQuickFix
source: Replace 'Dim' with 'Private'
cs: Zaměň 'Dim' za 'Private'
de: 'Dim' durch 'Private' ersetzen
es: Reemplazar 'Dim' con 'Private'
fr: Remplacer 'Dim' par 'Private'
it: Sostituisci 'Dim' con 'Private'

# ApplicationWorksheetFunctionQuickFix
source: Use early-bound Application.WorksheetFunction method.
cs: Použij early-bound metodu Application.WorksheetFunction.
de: Application.WorksheetFunction explizit verwenden.
es: Usar el método de enlace temprano "Application.WorksheetFunction".
fr: Utiliser Application.WorksheetFunction explicitement.
it: Usare il metodo Application.WorksheetFunction in associazione anticipata.

# WhiteListIdentifierQuickFix
source: Add to whitelist
cs: Přidat do Whitelistu
de: Zur Whitelist hinzufügen
es: Añadir a la lista blanca
fr: Ajouter à la liste blanche
it: Aggiungi alla lista bianca

# AssignedByValParameterMakeLocalCopyQuickFix
source: Create and use a local copy of the parameter
cs: Vytvoř a použij lokální kopii tohoto parametru
de: Eine lokale Kopie des Parameters erstellen und verwenden
es: Crea y utiliza una copia local del parámetro
fr: Créer et utiliser une copie locale du paramètre
it: Crea e utilizza una copia locale del parametro

# RemoveOptionBaseStatementQuickFix
source: Remove 'Option Base' statement
cs: Odstraň prohlášení 'Option Base'
de: 'Option Base'-Anweisung entfernen
es: Eliminar la declaración 'Option Base'
fr: Supprimer l'instruction 'Option Base'
it: Rimuovi istruzione 'Option Base'

# SynchronizeAttributesQuickFix
source: Synchronize attributes/annotations in module
cs: Synchronizuj v modulu atributy/anotace
de: Attribute/Annotationen im Modul synchronisieren
es: Sincronizar atributos/anotaciones en el módulo
fr: Synchroniser les attributs et annotations dans le module
it: Sincronizza attributi/annotazioni nel modulo

# RedundantByRefModifierQuickFix
source: Remove 'ByRef' modifier
cs: Odstraň 'ByRef' modifikátor
de: Redundante 'ByRef'-Markierung entfernen
es: Eliminar modificador 'ByRef'
fr: Supprimer le modificateur 'ByRef'
it: Rimuovi il modificatore 'ByRef'

# RemoveEmptyIfBlockQuickFix
source: Remove empty If block
cs: Odstraň prázdný If blok
de: Leeren 'If'-Block entfernen
es: Eliminar bloque If vací
fr: Supprimer le bloc conditionnel vide
it: Rimuovi blocco If vuoto

# ImplicitByRefModifierQuickFix
source: Pass parameter by reference explicitly
cs: Předej parametr explicitně jako referenci
de: Parameter explizit als Referenz übergeben
es: Pasar el parámetro por referencia explícitamente
fr: Passer le paramètre par référence explicitement
it: Passa il parametro per riferimento in modo esplicito

# ReplaceObsoleteErrorStatementQuickFix
source: Replace 'Error' with 'Err.Raise'
cs: Nahraď 'Error' za 'Err.Raise'
de: 'Error' durch 'Err.Raise' ersetzen
es: Reemplazar 'Error' con 'Err.Raise'
fr: Remplacer 'Error' par 'Err.Raise'
it: Sostituisci 'Error' con 'Err.Raise'

# RemoveEmptyElseBlockQuickFix
source: Remove empty 'Else' block
cs: Odstraň prázdný 'Else' blok
de: Leeren 'Else'-Block entfernen
es: Eliminar el bloque vacío 'Else'
fr: Supprimer le bloc 'Else' vide
it: Rimuovi blocco 'Else' vuoto

# RemoveStopKeywordQuickFix
source: Remove usage of the 'Stop' keyword
cs: Odstraň použití klíčového slova 'Stop'
de: 'Stop'-Schlüsselwort entfernen
es: Eliminar el uso de la palabra clave 'Stop'
fr: Supprimer l'usage du mot-clé 'Stop'
it: Rimuovi l'utilizzo della parola chiave 'Stop'

# IntegerDataTypeQuickFix
source: Change type to 'Long'
cs: Zaměň typ za 'Long'
de: Typ zu 'Long' änderen
es: Cambiar tipo a 'Long'
fr: Changer le type pour 'Long'
it: Cambia il tipo in 'Long'

# ReplaceIfElseWithConditionalStatementQuickFix
source: Replace If/Else with single assignment
cs: Nahraď 'If/Else' zjednodušeným přidělením
de: 'If/Else' mit einer einfachen Zuordnung ersetzen
es: Reemplazar If/Else con una sola asignación
fr: Remplacer le bloc If/Else par une assignation directe
it: Sostituisci If/Else con una singola assegnazione

# UnhandledOnErrorResumeNextInspectionQuickFix
source: Introduce error handling subroutine
cs: Představ subrutinu pro zpracování chyb
de: Subroutine zur Fehlerbehandlung einführen
es: Introducir error en la subrutina de manejo
fr: Introduire une routine de gestion d'erreurs
it: Introdurre la subroutine di gestione degli errori

# RemoveStepOneQuickFix
source: Remove redundant 'Step' clause
cs: Odstraň nadbytečnou klauzuli 'Step'
de: Step entfernen
es: Eliminar la cláusula 'Step' (incremento) redundante
fr: Supprimer le 'Step' redondant
it: Rimuovere la clausola 'Step' ridondante

# AddStepOneQuickFix
source: Add explicit 'Step' clause
cs: Přidej explicitní klauzuli 'Step'
de: Explizite 'Step'-Klausel hinzufügen
es: Añadir cláusula 'Step' explícita
fr: Ajouter une clause 'Step' explicite
it: Aggiungi una clausola 'Step' esplicita

# UseTypedFunctionQuickFix
source: Change '{0}' to '{1}'
cs: Změň '{0}' na '{1}'
de: '{0}' zu '{1}' ändern
es: Cambia '{0}' a '{1}'
fr: Changer '{0}' pour '{1}'
it: Cambia '{0}' con '{1}'

# AccessSheetUsingCodeNameQuickFix
source: Refer to statically accessible sheet by its code name
cs: Odkazuj na statisticky přístupný list dle jeho kódového jména
de: Das statisch erreichbare Tabellenblatt mit Codenamen referenzieren
es: Consulte la hoja estáticamente accesible por su nombre en clave
fr: Utiliser le nom de code pour référer à une feuille statiquement accessible
it: Fare riferimento al foglio accessibile staticamente tramite il nome in codice

# RemoveDuplicatedAnnotationQuickFix
source: Remove duplicated annotation
cs: Odstranit duplicitní anotace
de: Duplizierte Annotation entfernen
es: Eliminar anotación duplicada
fr: Supprimer l'annotation dupliquée
it: Rimuovi annotazione duplicata

# RemoveLocalErrorQuickFix
source: Replace 'On Local Error' with 'On Error'
cs: Nahradit 'On Local Error' za 'On Error'
de: 'On Local Error' durch 'On Error' ersetzen
es: Reemplazar 'On Local Error' con 'On Error'
fr: Remplacer 'On Local Error' par 'On Error'
it: Sostituisci 'On Local Error' con 'On Error'

# IsMissingOnInappropriateArgumentQuickFix
source: Change 'IsMissing' call to test for default value.
cs: TODO: Change 'IsMissing' call to test for default value.
de: 'IsMissing'-Aufruf in Prüfung eines Standardwerts umschreiben.
es: Cambie la llamada 'IsMissing' para probar el valor predeterminado.
fr: Modifier l'appel à la fonction 'IsMissing' pour tester la valeur par défaut.
it: Modificare la chiamata 'IsMissing' per verificare il valore predefinito.

# AddMissingAttributeQuickFix
source: Add missing attribute
cs: Přidat chybějící atribut
de: Fehlendes Attribut hinzufügen
es: Añadir atributo faltante
fr: Ajouter l'attribut manquant
it: Aggiungi attributo mancante

# AdjustAttributeValuesQuickFix
source: Adjust attribute value(s)
cs: Upravit hodnotu(y) atributu
de: Attributwert(e) anpassen
es: Ajustar valor(es) de atributo
fr: Ajuster l'attribut
it: Modifica i valori degli attributi

# RemoveAttributeQuickFix
source: Remove attribute
cs: Odstranit atribut
de: Attribut entfernen
es: Eliminar atributo
fr: Supprimer l'attribut
it: Rimuovi attributo

# RemoveAnnotationQuickFix
source: Remove annotation
cs: Odstranit anotaci
de: Annotation entfernen
es: Eliminar anotación
fr: Supprimer l'annotation
it: Rimuovi annotazione

# AdjustAttributeAnnotationQuickFix
source: Adjust attribute annotation
cs: Upravit anotaci atributu
de: Attributannotation anpassen
es: Ajustar anotación de atributo
fr: Ajuster l'annotation
it: Modifica l'annotazione dell'attributo

# AddAttributeAnnotationQuickFix
source: Add attribute annotation
cs: Přidat anotaci atributu
de: Attributannotation hinzufügen
es: Añadir anotación de atributo
fr: Ajouter une annotation
it: Aggiungi attributo annotazione

# ApplyQuickFixesFailedMessage
source: Failed to apply the quick fix.
cs: Aplikace rychlé opravy se nezdařila.
de: Die Ausführen des Quickfixes ist fehlgeschlagen.
es: Error al aplicar la solución rápida.
fr: Le correctif n'a pu être appliqué.
it: Impossibile applicare la correzione rapida.

# StaleModuleFailureReason
source: An affected module has been modified since the last parse.
cs: Dotčený modul byl od posledního parsování změněn.
de: Ein betroffenes Module wurde seit dem letzten Parse modifiziert.
es: Se ha modificado un módulo afectado desde el último análisis.
fr: Un module affecté a été modifier depuis la dernière analyse.
it: Un modulo interessato è stato modificato dall'ultima analisi.

# ApplyQuickFixFailedCaption
source: Quick Fix Application Failure
cs: Chyba Při Aplikování Rychlé Chyby
de: Quickfixausführung fehlgeschlagen
es: Error de aplicación de solución rápida
fr: Échec de l'application du correctif
it: Errore dell'applicazione di correzione rapida

# ReplaceWhileWendWithDoWhileLoopQuickFix
source: Replace 'While...Wend' with 'Do While...Loop'
cs: Nahradit 'While...Wend' za 'Do While...Loop'
de: 'While...Wend' durch'Do While...Loop' ersetzen
es: Reemplazar 'While...Wend' con 'Do While...Loop'
fr: Remplacer 'While...Wend' par 'Do While...Loop'
it: Sostituisci 'While...Wend' con 'Do While...Loop'

# ExpandBangNotationQuickFix
source: Replace bang notation with explicit access
cs: Nahradit bang notaci explicitním přístupem
de: Ersetze die Ausrufezeichennotation durch einen expliziten Aufruf
es: Reemplazar la notación Bang con acceso explícito
fr: Rendre explicite le code caché par l'opérateur '!'
it: Sostituisci la notazione il punto esclamativo con l'accesso esplicito

# ExpandDefaultMemberQuickFix
source: Make default member access explicit
cs: Nastavit explicitního přístupu člena
de: Füge einen expliziten Zugriff auf das Standardelement ein
es: Hacer explícito el acceso al miembro default
fr: Rendre explicite l'accès au membre par défaut
it: Rendi esplicito l'accesso al membro predefinito

# IgnoreInModuleQuickFix
source: Ignore in module
cs: Ignorovat v modulu
de: In Modul ignorieren
es: Ignorar en el módulo
fr: Ignorer dans le module
it: Ignora il modulo

# QualifyWithMeQuickFix
source: Qualify reference with 'Me'.
cs: Kvalifikujte 'Me' reference.
de: Qualifiziere die Referenz mit 'Me'.
fr: Qualifier la référence avec 'Me'.
it: Qualificare il riferimento con 'Me'.

# DeclareAsExplicitTypeQuickFix
source: Declare as Explicit Type
cs: Deklarovat jako Explicitní Typ
de: Als expliziten Typ deklarieren
fr: Déclarer un type explicite
it: Dichiara come Tipo Esplicito

# AnnotateEntryPointQuickFix
source: Add @EntryPoint annotation
cs: Přidat @EntryPoint anotaci
de: @EntryPoint-Annotation hinzufügen
fr: Annoter avec @EntryPoint
it: Aggiungi un'annotazione @EntryPoint

# RemoveRedundantOptionStatementQuickFix
source: Remove '{0}' statement
cs: Odstraň prohlášení '{0}'
de: '{0}'-Anweisung entfernen
es: Eliminar la declaración '{0}'
fr: Supprimer l'instruction '{0}'
it: Rimuovi istruzione '{0}'

# ReplaceQualifierWithMeQuickFix
source: Replace qualifier with 'Me'
de: Ersetze Bezeichner durch 'Me'
it: Sostituire il qualificatore con 'Me'

# RenameDeclarationQuickFix
source: Rename {0}
cs: Přejmenovat {0}
de: Benenne {0} um
es: Renombrar {0}
fr: Renommer {0}
it: Rinomina {0}
