Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/RubberduckUI.*.resx
Languages: cs, es, fr

# VersionCheck_BuildType_PreRelease
source: pre-release
cs: předběžné vydání
fr: pré-diffusion

# VersionCheck_BuildType_Release
source: release
cs: vydání
fr: officielle

# RegexAssistant_EncloseWhitespaceFlag
source: Spell out whitespace in the description
cs: V popisu uveďte mezeru
fr: Indiquer les espaces dans la description

# TestExplorer_AppendHeader
source: Rubberduck Test Results - {0}
cs: Rubberduck: Výsledky Testů - {0}
fr: Rubberduck - Résultats des tests : {0}

# RefactoringFailure_SuspendParserFailure
source: Unable to suspend the Parser to perform the refactoring operation.
cs: Nelze přerušit Parser k provedení operace refaktoringu.
fr: Impossible de suspendre l'analyse en cours pour effectuer le refactoring.

# ImportCommand_UnsupportedFileExtensions
source: The extension of the file '{0}' is not supported. Import aborted.
cs: Přípona souboru '{0}' není podporována. Import přerušen.
fr: L'extension du fichier '{0}' n'est pas prise en charge. Importation annulée.

# RegexAssistant_SpelledOut_CarriageReturn
source: carriage-return
cs: carriage-return (CR)
fr: retour

# ReplaceProjectContentsFromFilesCommand_DialogCaption
source: Replace Project Content from Files
cs: Nahrazení obsahu projektu ze souborů
fr: Remplacer le contenu du projet

# ReplaceProjectContentsFromFilesCommand_ConfirmationMessage
source: Do you really want to delete the contents of project '{0}' and replace them with the contents of the selected files?
cs: Opravdu chcete odstranit obsah projektu '{0}' a nahradit jej obsahem vybraných souborů?
fr: Ceci supprimera le contenu du projet '{0}' et remplacera les modules par le contenu des fichiers sélectionnés. Confirmer?

# UpdateFromFilesCommand_DialogCaption
source: Update Components from Files
cs: Update Komponentů ze Souborů
fr: Mettre à jour les modules...

# ImportCommand_DuplicateModule
source: Multiple files contain code for the component '{0}'. Import aborted.
cs: Kód pro komponentu '{0}' obsahuje více souborů. Import přerušen.
fr: Plus d'un fichier contient du code pour le componsant '{0}'. Échec de l'importation.

# UpdateFromFilesCommand_DifferentComponentType
source: The component type of the existing component '{0}' does not agree with that indicated by the extension of file '{1}'. Import aborted.
cs: Typ komponenty z existující komponenty '{0}' nesouhlasí s typem označeným příponou souboru '{1}'. Import přerušen.
fr: Le type de composant de '{0}' ne correspond pas au type indiqué par l'extension du fichier '{1}'. Mise à jour annulée.

# ImportCommand_DocumentDoesNotExist
source: There is no existing document module with name '{0}'; file '{1}' cannot be imported. Import aborted.
cs: Neexistuje žádný modul dokumentu s názvem '{0}'; soubor '{1}' nelze importovat. Import přerušen.
fr: Aucun module document existant avec le nom '{0}'; le fichier '{1}' ne pourra pas être importé. Échec de l'importation.

# ImportCommand_BinaryAndComponentDoNotExist
source: For file '{0}', the required binary file(s) '{1}' are missing and the target component '{2}' does not already exists. Import aborted.
cs: Pro soubor '{0}' chybí požadované binární soubor(y) '{1}' a cílová komponenta '{2}' ještě neexistuje. Import přerušen.
fr: Le fichier binaire '{1}' associé à '{0}' est manquant, et le module cible '{2}' n'existe pas déjà dans le projet. Échec de l'importation.

# ImportCommand_BinaryDoesNotExist
source: For file '{0}', the requires binary file(s) '{1}' are missing. Import aborted.
cs: U souboru '{0}' chybí požadované binární soubory '{1}'. Import přerušen.
fr: Le fichier '{0}' requiert le fichier binaire '{1}', qui est manquant. Échec de l'importation.

# ComponentType_ClassModule
source: Class Module
cs: Modul Třídy

# ComponentType_ComComponent
source: COM component
cs: COM komponenta

# ComponentType_DocObject
source: Document Object
cs: Objekt Dokumentu

# ComponentType_Document
source: Document Module
cs: Modul Dokumentu

# ComponentType_MDIForm
source: MDI Form
cs: MDI Formulář

# ComponentType_PropPage
source: Property Page
cs: Stránka Vlastností

# ComponentType_RelatedDocument
source: Related Document
cs: Související Dokument

# ComponentType_ResFile
source: Resource File
cs: Soubor Prostředků

# ComponentType_StandardModule
source: Standard Module
cs: Standardní Modul

# ComponentType_Undefined
source: Undefined
cs: Nedefinováno

# ComponentType_UserControl
source: User Control
cs: Uživatelský Control

# EncapsulateField_PreviewMarker
source: '<===== Property and declaration changes above this line =====>
cs: '<===== Změny v deklaraci a vlastnostech nad tímto řádkem =====>
fr: '<===== modifications aux propriétés et déclarations au-dessus de cette ligne =====>

# MoveFolders_EmptyFolderName
source: A folder name cannot be empty.
cs: Jméno složky nemůže být prázdné.
fr: Un nom de dossier ne peut être vide.

# AnnotateDeclarationDialog_AddArgumentButtonLabel
source: Add
cs: Přidat
fr: Ajouter

# AnnotateDeclarationDialog_AdjustAttributeLabel
source: Add/Adjust attribute
cs: Přidat/Upravit atribut
fr: Ajouter/Ajuster l'Attribut

# AnnotationArgumentType_Attribute
source: Attribute
cs: Atribut

# AnnotateDeclarationDialog_TitleText
source: Annotate Declaration
cs: Deklarace Anotace
fr: Annoter la déclaration

# AnnotationArgument_ValidationError_Newline
source: Annotation arguments can only contain a single line.
cs: Argumenty anotace mohou obsahovat pouze jeden řádek.
fr: Les arguments d'annotations doivent tenir sur une seule ligne.

# AnnotationArgument_ValidationError_EmptyArgument
source: Annotation arguments cannot be empty.
cs: Argumenty anotace nemohou být prázdné.
fr: Les arguments ne peuvent être laissés vides.

# AnnotationArgument_ValidationError_TooLong
source: Annotation arguments cannot be longer than {0} characters.
cs: Argumenty anotace nemohou být delší než {0} charakterů.
fr: La valeur des arguments ne peut dépasser {0} caractères.

# AnnotationArgument_ValidationError_SpecialCharacters
source: Annotation arguments must not contain control characters.
cs: Argumenty anotace nesmějí obsahovat 'control' charaktery.
fr: La valeur des arguments ne doit pas contenir de caractères de contrôle.

# AnnotationArgument_ValidationError_WhitespaceInAttribute
source: Annotation arguments of type 'Attribute Name' cannot contain whitespace.
cs: Argumenty anotace typu 'Attribute Name' nemohou obsahovat mezeru.
fr: Les arguments de type 'Attribute Name' ne peuvent contenir d'espaces.

# AnnotationArgument_ValidationError_AttributeNameStart
source: Annotation arguments of type 'Attribute Name' have to start with 'VB_'.
cs: Argumenty anotace typu 'Attribute Name' musejí začínat 'VB_'.
fr: Les arguments de type 'Attribute Name' doivent débuter par 'VB_'.

# AnnotationArgument_ValidationError_NotABoolean
source: Annotation arguments of type 'Boolean' have to either be 'True' or 'False'.
cs: Argumenty anotace typu 'Boolean' musejí být buď 'True' nebo 'False'.
fr: La valeur des arguments de type 'Boolean' doit être 'True' ou 'False'.

# AnnotationArgument_ValidationError_InspectionName
source: Annotation arguments of type 'Inspection Name' have to be the name of an existing inspection.
cs: Argumenty anotace typu 'Inspection Name' musejí být jméno existující inspekce.
fr: Les arguments de type 'Inspection Name' doivent correspondre au nom d'une inspection existante.

# AnnotationArgument_ValidationError_NotANumber
source: Annotation arguments of type 'Number' have to be a valid number in integer of floating point format.
cs: Argumenty anotace typu 'Number' musejí být validní číslo ve formátu integer nebo float.
fr: La valeur des arguments de type 'Number' doit être un nombre entier ou décimal valide.

# AnnotateDeclarationDialog_ArgumentsLabel
source: Annotation Arguments:
cs: Argumenty Anotace:
fr: Arguments de l'annotation:

# AnnotateDeclarationDialog_AnnotationLabel
source: Annotation to Add:
cs: Přidat Anotaci:
fr: Annotation à ajouter:

# EncapsulateField_PrivateUDTPropertyText
source: Creates a property for each UDT Member
cs: Vytvoří property pro každý UDT člen

# AnnotateDeclarationDialog_DeclarationLabel
source: Declaration to Annotate:
cs: Deklarace k Anotaci:
fr: Déclaration:

# GeneralSettings_EnableDragAndDrop
source: Enable drag and drop in Code Explorer
cs: Povolit drag and drop v Code Exploreru
fr: Permettre glisser-déposer dans l'Explorateur de Code

# RenameDialog_Folder
source: folder
cs: složka
fr: dossier

# RenameDialog_FolderLabel
source: Folder:
cs: Složka:
fr: Dossier:

# MoveToFolderDialog_FolderLabelText
source: Folder:
cs: Složka:
fr: Dossier:

# MoveFolders_ControlCharacter
source: Folder names cannot contain control characters like e.g. new lines.
cs: Název složky nemůže obsahovat control charaktery, např. nové řádky.
fr: Un nom de dossier ne peut pas contenir certains caractères de contrôle, tels qu'un saut de ligne.

# RenameDialog_FullNewFolderLabel
source: Full new folder:
cs: Plná nová složka:
fr: Nouveau dossier (chemin complet):

# AnnotationArgumentType_Inspection
source: Inspection Name
cs: Název Inspekce

# ExtractInterface_InstancingGroupBox
source: Instancing
cs: Instancování
fr: Instanciation

# RenameDialog_OnlyCasingDifferent
source: It is not possible to change only the case of an identifier in VBA (language is case-insensitive).
cs: Ve VBA není možné změnit pouze počáteční písmeno identifikátoru (jazyk ignoruje velká/malá písmena).
fr: Impossible de modifier la casse d'un identifiant VBA (le language est insensible à la casse).

# MoveFoldersDialog_TitleText
source: Move Folders
cs: Přesunout Složky
fr: Déplacer les dossiers

# MoveToFolderDialog_TitleText
source: Move to Folder
cs: Přesunout do Složky
fr: Déplacer vers un dossier

# EncapsulateField_NameConflictDetected
source: Name conflict
cs: Konflikt názvu
fr: Conflit de nom

# RefactoringFailure_NoTargetFolder
source: No target has been specified.
cs: Cíl nebyl specifikován.
fr: Aucune cible n'a été spécifiée.

# AnnotationArgumentType_Number
source: Number
cs: Číslo

# EncapsulateField_ParameterName
source: Parameter Name:
cs: Název Parametru:
fr: Nom du paramètre:

# MoveMultipleToFolderDialog_InstructionsLabelText
source: Please specify new folder for the components.
cs: Prosím specifikujte novou složku pro komponenty.
fr: Veuillez spécifier le dossier où déplacer ces composants.

# MoveToFolderDialog_InstructionsLabelText
source: Please specify a new folder for {0} '{1}' in folder '{2}'.
cs: Prosím specifikujte novou složku pro {0} '{1}' ve složce '{2}'.
fr: Veuillez spécifier un nouveau dossier pour {0} '{1}' dans le dossier '{2}'.

# MoveRootFolderDialog_InstructionsLabelText
source: Please specify a new parent folder for the folder '{0}'.
cs: Prosím specifikujte novou nadřazenou složku pro složku '{0}'.
fr: Veuillez spécifier un nouveau dossier parent pour '{0}'.

# MoveFoldersDialog_InstructionsLabelText
source: Please specify a new parent folder for the folders.
cs: Prosím specifikujte novou nadřazenou složku pro složky.
fr: Veuillez spécifier un nouveau dossier parent.

# MoveFolderDialog_InstructionsLabelText
source: Please specify a new parent folder for the subfolder '{0}' of '{1}'.
cs: Prosím specifikujte novou nadřazenou složku '{1}' pro podsložku '{0}'.
fr: Veuillez spécifier un nouveau dossier parent pour le sous-dossier '{0}' de '{1}'.

# EncapsulateField_ReadOnlyCheckBoxContent
source: Read Only
cs: Pouze ke čtení
fr: Lecture seule

# AnnotateDeclarationDialog_RemoveArgumentButtonLabel
source: Remove
cs: Odstranit
fr: Supprimer

# RenameDialog_TitleText_Folder
source: Rename folder
cs: Přejmenovat složku
fr: Renommer le dossier

# AnnotateDeclarationDialog_Caption
source: Rubberduck - Annotate Declaration
cs: Rubberduck - Anotace Deklarace
fr: Rubberduck - Annoter la Déclaration

# MoveFoldersDialog_Caption
source: Rubberduck - Move Folders
cs: Rubberduck - Přesunout Složky
fr: Rubberduck - Déplacer les Dossiers

# MoveToFolderDialog_Caption
source: Rubberduck - Move to Folder
cs: Rubberduck - Přesunout do Složky
fr: Rubberduck - Déplacer vers un Dossier

# AnnotateDeclarationDialog_Instructions
source: Select an annotation (and values) to add to the declaration.
cs: Vyberte anotaci (a hodnoty) pro přidání deklaraci.
fr: Sélectionner une annotation et les valeurs associées.

# EncapsulateField_SetterType
source: Setter Type:
cs: Typ Setteru:
fr: Type d'assignation:

# MoveFolders_SameNameSourceFolders
source: Several folders with the same name are being moved. This will merge them. Do you want to proceed?
cs: Je přesunováno několik složek se tejným jménem. Toto je spojí. Chcete pokračovat?
fr: Plusieurs dossiers portant le même nom seront déplacés. Cette action les fusionnera. Procéder?

# RefactoringFailure_AffectedModuleIsStale
source: The component '{0}' would have been affected by the refactoring, but its state in Rubberduck's memory is stale. Please refresh Rubberduck and try again.
cs: Komponenta '{0}' by byla ovlivněna refactorováním, avšak její stav v paměti Rubberducku je zastaralý. Prosím obnovte Rubberduck a zkuste to znovu.
fr: Le composant '{0}' aurait été affecté par la refactorisation, mais sa représentation interne à Rubberduck est périmée. Veuillez actualiser Rubberduck et réessayer.

# RenameDialog_FolderAlreadyExists
source: The folder '{0}' already exists. Renaming '{1}' to '{2}' will lead to a merge with the existing folder. Do you want to proceed?
cs: Složka '{0}' již existuje. Přejmenování '{1}' na '{2}' vyústí ve sloučení s existující složkou. Chcete pokračovat?
fr: Le dossier '{0}' existe déjà. Renommer '{1}' à '{2}' fusionnera les deux dossiers. Procéder?

# ExtractInterface_PublicInstancingMandatedByPublicClass
source: The implementing class is 'Public' mandating the interface be public as well. If you require a 'Private' interface, change the classes instancing to private as well. A private class can still implement a public interface.
cs: Implementovaná třída je 'Public', což nutí interface být také public. Jestliže vyžadujete 'Private' interface, změňte instancování třídy na private. Privání třída může stále implementovat public (veřejný) interface.
fr: La classe est publique, l'interface extraite sera donc publique également. Si une interface privée est nécessaire, veuillez modifier le mode d'instanciation ("instancing") du module de classe pour 'Private'. Une classe privée peut toujours implémenter une interface publique.

# MoveFolders_EmptySubfolderName
source: The names of individual subfolders cannot be empty.
cs: Názvy individuálních podsložek nemohou být prázdná.
fr: Les noms des sous-dossiers ne peuvent pas être vides.

# RefactoringFailure_AnnotateDeclaration_InvalidType
source: The refactoring can only annotate components, members and variables, but the target had type '{0}'.
cs: Refaktorování může anotovat pouze komponenty, členy a proměnné, avšak cílový objekt má typ '{0}'.
fr: Le refactoring ne peut annoter que les composants, les membres et les variables, mais la cible était de type '{0}'.

# MoveFolders_SameNameSubfolder
source: The target folder '{0}' already contains a subfolder '{1}'. Moving the folder will merge it with the existing folder. Do you want to proceed?
cs: Cílová složka '{0}' již obsahuje podložku '{1}'. Přemístění složky ji sloučí s existující složkou. Chcete pokračovat?
fr: Le dossier cible '{0}' contient déjà un sous-dossier nommé '{1}'. Déplacer ce dossier le fusionnera au dossier existant. Procéder?

# MoveFolders_SameNameSubfolders
source: The target folder '{0}' already contains subfolders {1}. Moving the folders will merge them with the existing folders with corresponding names. Do you want to proceed?
cs: Cílová složka '{0}' již obsahuje podsložky '{1}'. Přemístění složek je sloučí s existujícími složkami s korespondujícími jmény. Chcete pokračovat?
fr: Le dossier cible '{0}' contient déjà les dossiers {1}. Déplacer ces dossiers les fusionnera aux dossiers existants. Procéder?

# AnnotateDeclarationDialog_ArgumentTypeHeader
source: Type
cs: Typ

# EncapsulateField_ArrayHasExternalRedimFormat
source: Unable to encapsulate '{0}'. ReDim({0}) statement(s) exist in other modules.
cs: Nelze zapouzdřit '{0}'. ReDim ({0}) výrok(y) existují v jiných modulech.
fr: Impossible d'encapsuler le champ '{0}'. Une ou plusieurs instructions ReDim({0}) existent dans d'autres modules.

# AnnotateDeclarationDialog_ArgumentValueHeader
source: Value
cs: Hodnota
fr: Valeur

# EncapsulateField_WrapFieldsInPrivateType
source: Wrap Fields in Private Type
cs: Obalit Pole Privátním Typem
fr: Envelopper les champs dans une structure 'Private Type'

# DeclarationType_Enumeration
source: enum
es: enumerar
fr: l'énumération

source: Offline
es: Desconectado
fr: Hors-ligne

source: Online
fr: En ligne

# TodoExplorer_Caption
source: Todo Explorer
fr: Explorateur de marqueurs "TODO"

source: Go
es: Ir
fr: Aller

# GeneralSettings_HotkeyShift
source: Shift
fr: Maj

# ContextMultipleControlsSelection
source: multiple controls
es: controles multiples
fr: contrôles multiples

# DeclarationType_BracketedExpression
source: runtime expression
es: expresión en tiempo de ejecución
fr: expression résolue à l'exécution

# CommandDescription_CodeExplorerCommand
source: Code Explorer
es: Explorador de código
fr: Explorateur de Code

# CommandDescription_TestExplorerCommand
source: Test Explorer
es: Explorador de pruebas
fr: Explorateur de tests

# References_BrowseFilterActiveX
source: ActiveX Controls (*.ocx)|*.ocx
es: Controles ActiveX (* .ocx)|*.ocx
fr: Contrôles ActiveX (*.ocx)|*.ocx

# TodoSettings_Text
source: Text
es: Texto
fr: Texte

# TodoSettings_TextLabel
source: Text:
es: Texto
fr: Texte:

# RegexAssistant_SpelledOut_CarriageReturnNewLine
source: carriage-return-new-line
fr: retour-nouvelle-ligne

# GeneralSettings_DebugLogLevel
source: Debug
es: Depurar

# GeneralSettings_InfoLogLevel
source: Info
es: Información

# GeneralSettings_TraceLogLevel
source: Trace
es: Rastro

# TodoMarkerNote
source: NOTE
es: NOTA
