Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/RubberduckUI.*.resx
Languages: cs, es, fr

# WindowSettings_StartupVisibilityHeader
source: Window visibility at startup
cs: Viditelnost okna při spuštění
es: Visibilidad de la ventana al inicio
fr: Visibilité au démarrage

# EndOfLineCommentStyle_SameGap
source: Same Gap
cs: Stejná Mezera
es: Mismo Gap
fr: Même espacement

# EndOfLineCommentStyle_StandardGap
source: Standard Gap
cs: Standardní Mezera
es: Gap estándar
fr: Espacement standard

# IndenterSettings_AlignContinuations
source: Align continuations
cs: Zarovnat pokračování
es: Alinear continuaciones
fr: Aligner les continuations

# IndenterSettings_AlignDims
source: Align dims
cs: Zarovnat 'dimy'
es: Alinear dims
fr: Aligner les déclarations (Dim)

# IndenterSettings_AlignmentOptionsLabel
source: Alignment Options
cs: Nastavení Zarovnání
es: Opciones de alineación
fr: Aligner les options

# IndenterSettings_EnableOptionsLabel
source: Enable Options
cs: Povolit Nastavení
es: Habilitar opciones
fr: Activer les options

# IndenterSettings_EnableUndo
source: Enable undo
cs: Povolit 'zpět'
es: Deshacer habilitar
fr: Activer l'annulation

# IndenterSettings_EndOfLineCommentStyle
source: End-of-line comment style:
cs: Styl komentářů na konci řádku:
es: Estilo de comentario de fin de línea:
fr: Style des commentaires de fin de ligne:

# IndenterSettings_IgnoreOperators
source: Ignore operators
cs: Ignorovat operátory
es: Ignorar a los operadores
fr: Ignorer les opérateurs

# IndenterSettings_IndentFirstCommentBlock
source: Indent first comment block
cs: Odsadit první blok komentáře
es: Indentar primer bloque de comentarios
fr: Indenter le premier bloc de commentaires

# IndenterSettings_IndentFirstDeclarationBlock
source: Indent first declaration block
cs: Odsadit první blok deklarace
es: Indentar primer bloque de declaración
fr: Indenter le premier bloc de déclarations

# IndenterSettings_SpecialOptionsLabel
source: Special Options
cs: Speciální nastavení
es: Opciones especiales
fr: Options spéciales

# CommandDescription_IndentCurrentModuleCommand
source: Indent Module
cs: Odsadit Modul
es: Indentar modulo
fr: Indenter le module

# CommandDescription_IndentCurrentProcedureCommand
source: Indent Procedure
cs: Odsadit Proceduru
es: Indentar procedimiento
fr: Indenter la procédure

# CodeInspectionResults_GroupByModule
source: By module
cs: Dle modulu
es: Por módulo
fr: Par module

# CodeInspectionResults_GroupByType
source: By inspection type
cs: Dle typu inspekce
es: Por tipo de inspección
fr: Par type d'inspection

# CodeInspectionResults_Issue
source: Issue
cs: Problém
es: Problema
fr: Problème

# CodeInspectionResults_Location
source: Location
cs: Lokace
es: Ubicación
fr: Emplacement

# GroupingGrid_GroupingStyle
source: Grouping
cs: Seskupení
es: Agrupamiento
fr: Regroupement

# GroupingStyle_ByInspectionType
source: By inspection type
cs: Dle typu inspekce
es: Por tipo de inspección
fr: Par type d'inspection

# GroupingStyle_ByLocation
source: By location
cs: Dle lokace
es: Por localizacion
fr: Par emplacement

# GroupingStyle_ByOutcome
source: By outcome
cs: Dle výsledku
es: Por resultado
fr: Par résultat

# GeneralSettings_HotkeysLabel
source: Hotkeys:
cs: Klávesové Zkratky:
es: Teclas de acceso rápido:
fr: Raccourcis:

# SearchResults_Caption
source: Search Results
cs: Výsledky Hledání
es: Resultados de la búsqueda
fr: Résultats de recherche

# SearchResults_Location
source: Location
cs: Lokace
es: Ubicación
fr: Emplacement

# SearchResults_Context
source: Context
cs: Kontext
es: Contexto
fr: Contexte

# SearchResults_AllImplementationsTabFormat
source: All implementations: '{0}'
cs: Všechny implementace: '{0}'
es: Todas las implementaciones: '{0}'
fr: Implémentations: '{0}'

# ParserState_Error
source: Parse Error
cs: Chyba Parsování
es: Error de análisis
fr: Erreur d'analyse

# ParserState_LoadingReference
source: Loading references
cs: Načítám reference
es: Cargando referencias
fr: Chargement des références

# ParserState_Parsed
source: Parsed
cs: Parsováno
es: Analizado
fr: Analyse complétée

# ParserState_Parsing
source: Parsing…
cs: Parsuji…
es: Analizando ...
fr: Analyse…

# ParserState_Pending
source: Pending
cs: Čekám
es: Pendiente
fr: En attente

# ParserState_Ready
source: Ready
cs: Připraven
es: Listo
fr: Prêt

# ParserState_ResolverError
source: Resolver Error
cs: Chyba Resolveru
fr: Erreur de résolution

# ParserState_ResolvingDeclarations
source: Resolving declarations...
cs: Řeším deklarace...
es: Resolviendo declaraciones ...
fr: Résolution des déclarations...

# RubberduckCommandbarRefreshButtonTooltip
source: Parse all opened projects
cs: Parsuj všechny otevřené projekty
es: Analizar todos los proyectos abiertos.
fr: Analyser tous les projets ouverts

# GeneralSettings_HotkeyKey2
source: Key2
cs: Klíč2
es: Tecla2
fr: Touche2

# CommandDescription_InspectionResultsCommand
source: Code Inspections
cs: Inspekce Kódu
es: Inspecciones de código
fr: Inspections

# CommandDescription_RefactorExtractMethodCommand
source: Refactor / Extract Method
cs: Refaktorovat / Extrahovat Metodu
es: Refactorizar / Extraer procedimiento
fr: Extraire une méthode

# CommandDescription_CodePaneRefactorRenameCommand
source: Refactor / Rename
cs: Refaktorovat / Přejmenovat
es: Refactorizar / Renombrar
fr: Renommer

# CommonHotkey_InvalidKey
source: Invalid key.
cs: Neplatný klíč.
es: Clave inválida
fr: Touche invalide.

# CommonHotkey_HookDetached
source: Hook is already detached.
cs: Propojení je již odpojeno.
es: El gancho ya está separado.
fr: L'attache est déjà désactivée.

# CommonHotkey_HookAttached
source: Hook is already attached.
cs: Propojení je již připojeno.
es: El gancho ya está adjunto.
fr: L'attache est déjà active.

# CommonHotkey_KeyNotRegistered
source: Hotkey ({0}) not registered.
cs: Klávesová Zkratka ({0}) není registrována.
es: Tecla de acceso rápido ({0}) no registrada.
fr: La combinaison ({0}) n'est pas enregistrée.

# CommandDescription_FindSymbolCommand
source: Find symbol
cs: Najít symbol
es: Encontrar simbolo
fr: Rechercher un symbole

# CommandDescription_RefactorMoveCloserToUsageCommand
source: Refactor / Move declaration closer to usage
cs: Refaktorovat / Přemístit deklaraci blíže k použití
es: Refactorizar / Mover la declaración más cerca de su uso
fr: Rapprocher la déclaration de son utilisation

# CommandDescription_ReparseCommand
source: Refresh parser state
cs: Obnovit stav parseru
es: Actualizar el estado del analizador
fr: Rafraîchir l'arborescence

# GroupingStyle_ByMarker
source: By marker
cs: Dle značky
es: Por marcador
fr: Par marqueur

# GeneralSettings_FolderDelimiterLabel
source: Folder Delimiter:
cs: Oddělovač složky:
es: Delimitador de carpeta:
fr: Délimiteur de dossiers:

# GeneralSettings_PeriodDelimiter
source: Period (.)
cs: Tečka (.)
es: Periodo (.)
fr: Point (.)

# GeneralSettings_SlashDelimiter
source: Slash (/)
cs: Lomeno (/)
es: Barra (/)
fr: Barre oblique (/)

# Parser_ParserError
source: Parser Errors
cs: Chyby Parseru
es: Errores del analizador
fr: Erreurs d'analyse

# GeneralSettings_MinimumLogLevelLabel
source: Minimum Log Level:
cs: Minimální Úroveň Logu:
es: Nivel de registro mínimo:
fr: Niveau minimum du journal:

# GeneralSettings_ErrorLogLevel
source: Error
cs: Chyba
fr: Erreur

# GeneralSettings_FatalLogLevel
source: Fatal
cs: Fatální

# GeneralSettings_OffLogLevel
source: No Logging
cs: Žádné Logování
es: Sin registro
fr: Désactivé

# GeneralSettings_WarnLogLevel
source: Warn
cs: Varování
es: Advertir
fr: Avertissement

# GeneralSettings_ShowLogFolder
source: Show Log Folder
cs: Otevřít Log Složku
es: Mostrar carpeta de registro
fr: Afficher dans le dossier

# ParserState_ResolvingReferences
source: Resolving references...
cs: Řeším reference...
es: Resolviendo referencias ...
fr: Résolution des références...

# RegexAssistant_Caption
source: Rubberduck - Regex Analyzer
cs: Rubberduck - Regex Analyzátor
es: Rubberduck - Analizador Regex
fr: Rubberduck - Analyseur Regex

# RegexAssistant_DescriptionResultsLabel
source: Description
cs: Popis
es: Descripción

# RegexAssistant_GlobalFlag
source: Global
cs: Globální

# RegexAssistant_IgnoreCaseFlag
source: Ignore case
cs: Ignorovat velká/malá písmena
es: Ignorar caso
fr: Ignorer la casse

# RegexAssistant_RegexPatternLabel
source: Pattern
cs: Vzor
es: Patrón
fr: Expression

# RegexAssistant_NoPatternError
source: (no pattern)
cs: (žádný vzor)
es: (sin patrón)
fr: (pas d'expression)

# RegexAssistant_Instructions
source: Enter a regular expression to analyze in the box below.
cs: Níže napište regulární výraz, který si přejete analyzovat.
es: Ingrese una expresión regular para analizar en el cuadro de abajo.
fr: Entrer une expression Regex à analyser dans l'espace ci-dessous.

# RegexAssistant_Title
source: Regular Expression Analyzer
cs: Analyzátor Regulárních Výrazů
es: Analizador de expresiones regulares
fr: Analyseur d'expressions Regex

# CodeInspectionSettings_WhitelistedIdentifiersLabel
source: Allowed Identifiers
cs: Dovolené Identifikátory
es: Identificadores en lista blanca
fr: Identifiants permis

# CodeInspectionSettings_WhitelistedIdentifiersDescription
source: These identifiers will be ignored by the 'Use meaningful names' inspection.
cs: Tyto identifikátory budou ignorovány inspekcí 'Použij smysluplné názvy'.
es: Estos identificadores serán ignorados por la inspección 'Usar nombres significativos'
fr: L'inspection des noms ignorera ces identifiants.

# CommandDescription_RefactorEncapsulateFieldCommand
source: Refactor / Encapsulate Field
cs: Refaktorovat / Zapouzdřit Pole
es: Refactorizar / Encapsular Campo
fr: Encapsuler le champ

# CodeInspectionSettings_Misc
source: Miscellaneous
cs: Různé
es: Miscelánea
fr: Autres options

# CodeInspectionSettings_Misc_RunInspectionsOnSuccessfulParse
source: Run inspections automatically on successful parse
cs: Spustit automaticky inspekce po úspěšném parsování
es: Ejecutar inspecciones automáticamente en el análisis exitoso
fr: Exécuter les inspections automatiquement

# GeneralSettings_ShowSplash
source: Show splash screen at startup
cs: Zobrazit úvodní obrazovku po spuštění
es: Mostrar pantalla de bienvenida al inicio
fr: Afficher l'écran d'initialisation

# RubberduckReloadFailure_Title
source: Rubberduck will not reload
cs: Rubberduck nebude obnoven
es: Rubberduck no se recargará
fr: Rubberduck ne redémarre pas

# ParserErrorToolTipText
source: {0} module(s) failed to parse; click for details.
cs: {0} modul(y) nebylo možno zparsovat; klikněte pro detaily.
es: {0} módulo (s) no se pudo analizar; haga clic para más detalles.
fr: {0} module(s) n'ont pas pu compléter; cliquez pour plus de détails.

# ReparseToolTipText
source: {0}. Click to refresh.
cs: {0}. Klikněte pro obnovení.
es: {0}. Haga clic para actualizar.
fr: {0}. Cliquez pour rafraîchir.

# ContextReferences
source: references
cs: reference
es: referencias
fr: références

# IndenterSettings_VerticalSpacing
source: Maintain vertical spacing
cs: Udržovat vertikální vzdálenosti
es: Mantener el espaciamiento vertical
fr: Maintenir l'espacement vertical

# IndenterSettings_VerticalSpacingLabel
source: Vertical Spacing
cs: Vertikální vzdálenosti
es: Espaciamiento vertical
fr: Espacement vertical

# DeclarationType_LibraryProcedure
source: library procedure
cs: procedura knihovny
es: biblioteca de procedimientos
fr: la procédure externe

# AssignedByValParamQFixDialog_Caption
source: Assigned ByVal parameter QuickFix - Make Local Copy
cs: Přiřazen ByVal parametr QuickFix - Udělat Lokální Kopii
es: Parámetro ByVal asignado. Solución rápida: Hacer una copia local
fr: Introduire une variable locale

# AssignedByValParamQFixDialog_InstructionsLabelText
source: Please specify a name to use for the local copy of ByVal {0} '{1}'.
cs: Prosím specifikujte název, který se má použít na lokální kopii ByVal {0} '{1}'.
es: Especifique un nombre para usar para la copia local de ByVal {0} '{1}'
fr: Veuillez spécifier le nom à utiliser pour la copie locale du paramètre {0} '{1}'.

# AssignedByValParamQFixDialog_TitleText
source: Specify Local Copy Variable Name
cs: Specifikujte Název Kopie Lokální Proměnné
es: Especifique el nombre de la variable de copia local
fr: Nommer la variable locale

# IndenterSettings_CodeSampleHeader
source: Indented Code Sample
cs: Příklad Odsazeného Kódu
es: Ejemplo de código indentado
fr: Échantillon de code indenté

# VersionCheck_NewVersionAvailable
source: You are currently running Rubberduck version {0}. Good news! Version {1} ({2}) is now available. To review the change log and manually upgrade Rubberduck, click 'Yes'. This dialog is showing because version checks are enabled. You can turn off this feature in Rubberduck > Settings.
cs: Momentálně používáte Rubberduck verzi {0}. Dobré zprávy! Verze {1} ({2}) je nyní k dispozici. Chcete-li se podívat na změny a ručně aktualizovat Rubberduck, klikněte na "Ano". Toto dialogové okno se zobrazuje, protože je povolena kontrola nových verzí. Tuto funkci můžete vypnout v Rubberduck > Nastavení.
es: ¡La versión de Rubberduck {0} ya está disponible! ¿Te gustaría revisar las notas de publicación ahora?
fr: Vous utilisez présentement la version {0}. Bonne nouvelle, la version {1} ({2}) est maintenant disponible! Cliquez 'Oui' pour lire les changements apportés et télécharger manuellement cette nouvelle version. Ce message s'affiche parce que la vérification d'une nouvelle version au démarrage est activée. Vous pouvez désactiver cette fonctionnalité dans le menu Rubberduck > Paramètres.

# GeneralSettings_CheckVersion
source: Check if a newer version is available at startup.
cs: Při startu zkontrolovat, zda je dostupná nová verze.
es: Compruebe si hay una versión más nueva disponible en el inicio
fr: Vérifier si une nouvelle version est diponible au démarrage.

# AssignedByValDialog_NewNameAlreadyUsedFormat
source: '{0}' is already accessible to this scope.
cs: '{0}' je již přístupný v tomto rozsahu.
es: '{0}' ya está accesible para este ámbito.
fr: '{0}' est déjà accessible à cette procédure.

# ConfirmRemoveAssignmentWithUnusedDeclaration
source: Variable '{0}' is assigned. Remove assignment instruction(s)?
cs: Proměnná '{0}' je přidělena. Odstranit přidělení instrukce?
es: Se asigna la variable '{0}'. Eliminar instrucciones de asignación)?
fr: La varaible '{0}' est assignée. Supprimer l'/les assignation(s)?

source: Preview
cs: Náhled
es: Avance
fr: Aperçu

# RenameDialog_DefaultRenameError
source: Could not rename {0}.
cs: Nebylo možno přejmenovat {0}.
es: No se pudo cambiar el nombre de {0}.
fr: Impossible de renommer {0}.

# RenameDialog_InterfaceRenameError
source: Could not rename Interface Member {0}.
cs: Nebylo možno přejmenovat Člena Rozhraní {0}.
es: No se pudo cambiar el nombre del miembro de la interfaz {0}.
fr: Impossible de renommer le membre '{0}' de l'interface.

# RenameDialog_BuiltInNameError
source: {0} {1} cannot be changed.
cs: {0} {1} není možno změnit.
es: {0} {1} no se puede cambiar.
fr: {0}{1} ne peut être renommé.

# CodeInspectionSettings_InspectionSeveritySettingsLabel
source: Inspection Severities
cs: Závažnosti Inspekce
es: Gravedad de la inspección
fr: Niveau de sévérité

# RenamePresenter_TargetIsControlEventHandler
source: Method '{0}' is an EventHandler for control '{1}'. Only the control can be renamed. Rename '{1}' instead?
cs: Metoda '{0}' je EventHandler pro ovládací prvek '{1}'. Přejmenovat lze pouze ovládací prvek. Místo toho přejmenovat '{1}'?
es: El método '{0}' es un EventHandler para el control '{1}'. Solo el control puede ser renombrado. ¿Cambiar el nombre '{1}' en su lugar?
fr: La méthode {0} répond aux événements du contrôle '{1}'. Renommer '{1}'?

# RenamePresenter_TargetIsEventHandlerImplementation
source: Method '{0}' is an implementation of event '{1}.{2}'. Rename event '{2}' instead?
cs: Metoda '{0}' je implementací události '{1}.{2}'. Místo toho přejmenovat událost '{2}'?
es: El método '{0}' es una implementación del evento '{1}. {2}'. ¿Cambiar el nombre del evento '{2}' en su lugar?
fr: La méthode '{0}' répond à l'événement '{1}.{2}'. Renommer l'événement '{2}'?

# GeneralSettings_ExperimentalFeaturesWarning
source: Only enable these if you know what you're doing. Enabling and/or using features from this section may result in things breaking unexpectedly and irrevocable data loss.
cs: Toto nastavení povolte jen pokud více, to děláte. Povolením a/nebo užíváním věcí z této sekce může skončit nečekanými obtížemi, poruchami kódu a nenávratnou ztrátou dat.
es: Solo habilítalos si sabes lo que estás haciendo. La habilitación y / o el uso de las funciones de esta sección pueden hacer que las cosas se rompan de forma inesperada e irrevocable.
fr: Ces fonctionnalités sont présentement en phase de tests et/ou diagnostics. Activer ces fonctionnalités peut produire des erreurs inattendues qui peuvent résulter en pertes de données.

# GeneralSettings_ExperimentalFeatures
source: Experimental Features (Requires a restart to take effect):
cs: Experimentální Funkce (Je třeba restartovat Excel, aby se změny projevily):
es: Características experimentales (requiere un reinicio para que tenga efecto):
fr: Fonctionnalités expérimentales:

# ExportAllCommand_SaveAsDialog_Title
source: Select a folder to export the source of {0} to:
cs: Vyberte složku pro export zdrojového kódu {0} do:
es: Elija una carpeta para exportar la fuente de {0} a:
fr: Veuillez sélectionner un dossier où exporter les fichier source de {0}:

# CommandDescription_ExportAllCommand
source: Export Active Project
cs: Exportovat Aktivní Projekt
es: Exportar proyecto activo
fr: Exporter le projet actif

# ImportCommand_OpenDialog_Filter_AllFiles
source: All Files
cs: Všechny Soubory
es: Todos los archivos
fr: Tous les fichiers

# ImportCommand_OpenDialog_Filter_VBFiles
source: VB Files
cs: VB Soubory
es: Archivos VB
fr: Fichiers VB

# ImportCommand_OpenDialog_Title
source: Import Source Files
cs: Importovat Zdrojové Soubory
es: Importar archivos de origen
fr: Importer fichiers source

# EmptyUIRefreshMessage
source: to parse and process the projects in the VBE.
cs: pro parsování a zpracování projektů ve VBE.
es: Analizar y procesar los proyectos en el VBE.
fr: pour analyser et traiter les projets dans le VBE.

# EmptyUIRefreshMessage_Title
source: Rubberduck doesn't see anything yet.
cs: Rubberduck prozatím nic nevidí.
es: Rubberduck no ve nada todavía.
fr: Rubberduck ne voit rien pour l'instant.

# ToDoExplorer_NumberOfIssuesFound_Plural
source: Rubberduck TODO Items - {0} {1} items found.
cs: Rubberduck TODO položky - {0} {1} položek nalezeno.
es: Artículos de TODO de Rubberduck - {0} {1} artículos encontrados.
fr: Rubberduck - {0} {1} marqueurs TODO trouvés.

# ToDoExplorer_NumberOfIssuesFound_Singular
source: Rubberduck TODO Items - {0} {1} items found.
cs: Rubberduck TODO položky - {0} {1} položka nalezena.
es: Artículo de TODO de Rubberduck - {0} {1} artículo encontrado.
fr: Rubberduck marqueurs TODO - {0} {1} marqueurs trouvés.

# ToDoExplorerToDoItemFormat
source: {0}: {1} - {2}.{3} line {4}.
cs: {0}: {1} - {2}.{3} řádek {4}.
es: {0}: {1} - {2}. {3} línea {4}.
fr: {0}: {1} - {2}.{3} ligne {4}.

# ToDoExplorer_CopyToolTip
source: Copy to clipboard
cs: Zkopírovat do schránky
es: Copiar al portapapeles
fr: Copier dans le presse-papier

# CodeMetricsDockablePresenter_Caption
source: Code Metrics
cs: Metrika Kódu
es: Métricas de Código
fr: Statistiques

# CodeMetrics_Complexity
source: Cyclomatic Complexity
cs: Cyklomatická Komplexita
es: Complejidad ciclomática
fr: Complexité Cyclomatique

# CodeMetrics_Lines
source: Lines
cs: Řádky
es: Líneas
fr: Lignes

# CodeMetrics_Nesting
source: Maximum Nesting
cs: Maximální Vnoření
es: Anidamiento maximo
fr: Imbrication

# GeneralSettings_HotkeyRestrictionLabel
source: Hotkeys should include either Alt and/or Ctrl.
cs: Klávesové zkratky by měly obsahovat buď Alt a/nebo Ctrl.
es: Las teclas de acceso rápido deben incluir Alt y / o Ctrl.
fr: Les raccourcis doivent inclure Alt et/ou Ctrl.

# GeneralSettings_HotkeyRestrictionToolTip
source: This hotkey configuration may cause undesirable side effects.
cs: Tato konfigurace klávesové zkratky může vyvolat nežádoucí vedlejší účinky.
es: Esta configuración de teclas de acceso rápido puede causar efectos secundarios no deseados.
fr: Cette configuration peut entraîner des effets indésirables.

# GeneralSettings_ModifierWarning
source: Modifier Warning
cs: Varování Modifikátoru
es: Advertencia modificador
fr: Avertissement

# Command_Reparse_CannotCompile
source: The following project(s) cannot be compiled, which will most likely result in parser errors. Continue anyway? {0}
cs: Následující projekt(y) nemohou být zkompilovány, což je s největší pravděpodobností kvůli parsovacím chybám. I přesto pokračovat? {0}
es: Los siguientes proyectos no pueden compilarse, lo que probablemente resultará en errores del analizador. ¿De todas maneras, continúe? {0}
fr: Les projets suivants ne peuvent être compilés, ce qui causera probablement des erreurs d'analyse. Continuer? {0}

# Command_Reparse_CannotCompile_Caption
source: Unable to compile for parsing.
cs: Není možno zkompilovat pro parsování.
es: No se puede compilar para analizar
fr: La compilation a échoué.

# GeneralSettings_CompileBeforeParse
source: Compile code before parsing
cs: Zkompilovat kód před parsováním
es: Compilar código antes de analizar
fr: Compiler le code avant d'analyser

# ParserState_Started
source: Started
cs: Zahájeno
es: Empezado
fr: Initiée

# ParserState_UnexpectedError
source: Unexpected Error
cs: Neočekávaná Chyba
es: Error inesperado
fr: Erreur inattendue

# Command_Reparse_CompileOnDemandEnabled
source: The VBE setting "Compile On Demand" is currently enabled. This is not recommended as this may hide compilation errors and cause problems with parsing. Do you want to parse anyway?
cs: VBE nastavení "Zkompilovat Na Žádost" je aktuálně povoleno. Toto není doporučeno a může vyústit v kompilační chyby a způsobit problémy při parsování. Chcete i přesto spustit parser?
es: El VBEsetting "Compile On Demand" está habilitado actualmente. No se recomienda, ya que puede ocultar errores de compilación y causar problemas con el análisis. ¿Quieres analizar de todos modos?
fr: L'option VBE "Compile on demand" est présentement activée. Cette configuration n'est pas recommandée, puisqu'elle peut masquer des erreurs de compilation in interférer avec l'analyse. Poursuivre l'analyse?

# Command_Reparse_CompileOnDemandEnabled_Caption
source: Compile On Demand Setting
cs: Nastavení Zkompilování Na Žádost
es: Ajuste "Compile On Demand "
fr: Paramètre "Compile on demand"

# GeneralSettings_CompileBeforeParse_WarnCompileOnDemandEnabled
source: The VBE setting "Compile On Demand" is currently enabled. It is strongly recommended that you disable the setting via the VBE Options dialog under General tab in order to use the Compile Before Parse feature. Do you want to disable it now? NOTE: Restart is required for the setting to take effect.
cs: VBE nastavení "Zkompilovat Na Žádost" je aktuálně povoleno. Je silně doporučeno toto nastavení zakázat přes dialog VBE Nastavení nacházející se v panelu Obecné a změnit na Kompilování Před Parsováním. Přejete si toto nastavení nyní zakázat? POZNÁMKA: Pro aplikování tohoto nastavení je třeba restartovat Excel.
es: La configuración de VBE "Compile On Demand" está actualmente habilitada. Se recomienda encarecidamente que deshabilite la configuración a través del cuadro de diálogo Opciones de VBE en la pestaña General para utilizar la función Compilar antes de analizar. ¿Quieres desactivarlo ahora? NOTA: Es necesario reiniciar para que la configuración tenga efecto.
fr: L'option VBE "Compile on demand" est activée. Il est fortement recommandé de désactiver cette option afin d'utiliser l'option "Compiler avant l'analyse". Voulez-vous désactiver "Compile on demand"? NOTE: Un redémarrage de l'application sera requis pour que la nouvelle configuration prenne effet.
