Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/RubberduckUI.*.resx
Languages: cs, es, fr

# GeneralSettings_CompileBeforeParse_WarnCompileOnDemandEnabled_Caption
source: Compile On Demand currently enabled
cs: Zkompilovat na Žádost je aktuálně povoleno
es: "Compile On Demand" actualmente habilitado
fr: 'Compile on demand' est activé

# SmartIndenter_LegacySettingPrompt
source: Smart Indenter settings were found in your registry. Would you like to import them to Rubberduck?
cs: Ve vašich registrech bylo nalezeno Chytré Odsazování. Přejete si toto nastavení importovat do Rubberducku?
es: Se encontraron configuraciones de Smart Indenter en su registro. ¿Te gustaría importarlos a Rubberduck?
fr: Des paramètres utilisés par Smart Indenter existent dans votre registre. Voulez-vous les importer dans Rubberduck?

# IndenterSettings_PreviewCode
source: Public Enum ExampleEnum ' Enum comment. Foo Bar ' Member comment. End Enum ' Example Procedure Sub ExampleProc() ' SMART INDENTER ' Original VB6 code graciously offered to Rubberduck by Stephen Bullen & Rob Bovey ' © 2016 by Rubberduck VBA. Dim count As Integer Static name As String If YouLikeRubberduck Then ' Star us on GitHub http://github.com/rubberduck-vba/Rubberduck ' Follow us on Twitter @rubberduckvba ' Visit http://rubberduckvba.com for news and updates Select Case X Case "A" ' If you have any comments or suggestions, _ or find valid VBA code that isn't indented correctly, #If VBA6 Then MsgBox "Contact contact@rubberduck-vba.com" #End If Case "Continued strings and parameters can be" _ & "lined up for easier reading, optionally ignoring" _ & "any operators (&+, etc) at the start of the line." Debug.Print "X<>1" End Select 'Case X End If 'More Tools? Suggestions http://github.com/rubberduck-vba/Rubberduck/Issues/New End Sub
cs: Public Enum ExampleEnum ' Enum komentář. Foo Bar ' Komentář člena. End Enum
fr: Public Enum ExempleEnum ' commentaire enum. Foo Bar ' commentaire membre enum. End Enum ' Procédure exemple Sub ExampleProc() ' SMART INDENTER ' Code VB6 original gracieusement offert au projet Rubberduck par Stephen Bullen et Rob Bovey ' © 2016 Rubberduck VBA. Dim count As Integer Static name As String If VousAimezRubberduck Then ' Donnez-nous une étoile sur GitHub http://github.com/rubberduck-vba/Rubberduck ' Suivez-nous sur Twitter @rubberduckvba ' Visitez http://rubberduckvba.com pour les nouvelles et mises à jour Select Case X Case "A" ' Si vous avez des commentaires ou suggestions, _ ou si vous trouvez du code VBA valide qui ne s'indente pas correctement, #If VBA6 Then MsgBox "Contactez contact@rubberduck-vba.com" #End If Case "Les chaînes de caractères et paramètres peuvent être" _ & "alignés pour une lecture plus facile, en ignorant facultativement" _ & "les opérateurs (&+, etc) au début d'une ligne." Debug.Print "X<>1" End Select 'Case X End If 'Plus d'outils? Suggestions http://github.com/rubberduck-vba/Rubberduck/Issues/New End Sub

# IndenterSettings_IndentEnumTypeAsProcedure
source: Indent comments in Enum and Type blocks like in procedures
cs: Odsadit komentáře v Enum a Type blocích tak, jako v procedurách
es: Indentar comentarios en bloques Enum y Type como en procedimientos
fr: Indenter les commentaires des blocs Enum et Type comme dans les procédures

# DeclarationType_PropertyGet
source: property get accessor
cs: Get accessor vlastnosti
es: propiedad Get
fr: l'accesseur property get

# DeclarationType_PropertyLet
source: property let accessor
cs: Let accessor vlastnosti
es: propiedad Let
fr: l'accesseur property let

# DeclarationType_PropertySet
source: property set accessor
cs: Set accessor vlastnosti
es: propiedad Set
fr: l'accesseur property set

# ReorderParamsDialog_InstructionsLabelText
source: Select a parameter and drag it or use buttons to move it up or down.
cs: Zvol parametr a za použití táhnutí myši nebo pomocí tlačítek ho přesuň výše nebo níže.
es: Seleccione un parámetro y arrástrelo o use los botones para moverlo hacia arriba o hacia abajo.
fr: Veuillez sélectionner un paramètre et glisser-déposer, ou utilisez les boutons pour modifier l'ordre.

# CodeInspections_NumberOfIssuesFound_Singular
source: Rubberduck Code Inspections - {0} {1} issue found.
cs: Rubberduck Inspekce Kódu - {0} {1} problém nalezen.
es: Inspecciones del código de Rubberduck - {0} {1} problema encontrado.
fr: Inspections Rubberduck - {0} {1} problème trouvé.

# IndenterSettings_ForceCompilerDirectivesToColumn1
source: Force compiler directives to column 1
cs: Vynutit pokyny kompilátoru do sloupce 1
es: Forzar las directivas del compilador a la columna 1
fr: Forcer les directives du préprocesseur à la colonne 1

# IndenterSettings_ForceDebugDirectivesToColumn1
source: Force debug directives to column 1
cs: Vynutit debugovací pokyny do sloupce 1
es: Forzar las directivas de depuración a la columna 1
fr: Forcer les instructions Debug à la ligne 1

# IndenterSettings_IndentCase
source: Indent case
cs: Odsadit 'Case'
es: Indentar case
fr: Indenter les blocs Case

# IndenterSettings_IndentCompilerDirectives
source: Indent compiler directives
cs: Odsadit pokyny kompilátoru
es: Indentar directivas de compilación
fr: Indenter les directives du préprocesseur

# IndenterSettings_IndentEntireProcedureBody
source: Indent entire procedure body
cs: Odsadit celý vnitřek procedury
es: Indentar todo el cuerpo del procedimiento
fr: Indenter le contenu entier de la procédure

# RubberduckFatalError
source: Rubberduck encountered an error. Please save your work and restart the host program; if logging is enabled, you can upload your log file located at '%AppData%Roaming\Rubberduck\Logs\RubberduckLog.txt' to a GitHub issue at 'https://github.com/rubberduck-vba/Rubberduck/issues/new' and report the bug.
cs: Rubberduck zaznamenal chybu. Uložte vaši práci a restartujte program; jestliže máte povoleno logování, můžete log, který se nachází v: '%AppData%Roaming\Rubberduck\Logs\RubberduckLog.txt', uploadovat do nového GitHub Issue na 'https://github.com/rubberduck-vba/Rubberduck/issues/new' a reportovat jako bug.
es: Rubberduck encontró un error. Por favor guarde su trabajo y reinicie el programa host; si el registro está habilitado, puede cargar su archivo de registro ubicado en '%AppData%Roaming\Rubberduck\Logs\RubberduckLog.txt' en un problema de GitHub en 'https://github.com/rubberduck-vba/Rubberduck/issues/new ' y reportar el error.
fr: Rubberduck a rencontré un problème. Veuillez enregistrer votre travail et redémarrer l'application hôte. Si le journal est activé, vous pouvez téléverser le fichier journal '%AppData%\Roaming\Rubberduck\Logs\RubberduckLog.txt' dans un nouveau ticket sur GitHub, au 'https://github.com/rubberduck-vba/Rubberduck/issues/new'.

# RubberduckReloadFailure_Message
source: Toolwindows were not correctly destroyed and/or could not be recreated; the VBE may not be in a stable state. Rubberduck will load normally next time the VBE is initialized.
cs: Nástrojová okna nebyla korektně zničena a/nebo nemohou být obnoveny; VBE nemusí být v tuto chvíli stabilní. Rubberduck se načte normálně při příští inicializaci VBE.
es: Las ventanas de herramientas no se destruyeron correctamente y / o no se pudieron recrear; El VBE puede no estar en un estado estable. Rubberduck se cargará normalmente la próxima vez que se inicialice el VBE.
fr: Les fenêtres ancrables n'ont probablement pas été correctement détruites, et/ou n'ont pas pu être recréées. l'environnement peut ne pas être dans un état stable. Rubberduck démerrera normalement à la prochaine initialisation du VBE.

# ParserState_Busy
source: Busy
cs: Zaneprázdněný
es: Ocupado
fr: Occupé

# GroupingStyle_ByCategory
source: By category
cs: Dle kategorie
es: Por categoria
fr: Par catégorie

# IndenterSettings_IgnoreEmptyLinesInFirstBlocks
source: Ignore empty lines when locating first comment and declaration blocks
cs: Ignoruj prázdné řádky při vyhledávání prvních poznámek a deklaračních bloků
es: Ignore las líneas vacías al ubicar los bloques de primer comentario y declaración
fr: Ignorer les lignes vides lors de la recherche du premier bloc de commentaire ou de déclarations

# InspectionSettings_FilterByDescription
source: Description:
cs: Popis:
es: Descripción:

# InspectionResults_FilterByError
source: Error
cs: Chyba
fr: Erreur

# InspectionResults_FilterByHint
source: Hint
cs: Nápověda
es: Consejo
fr: Note

# InspectionResults_FilterBySuggestion
source: Suggestion
cs: Návrh
es: Sugerencia

# InspectionResults_FilterByWarning
source: Warning
cs: Varování
es: Advertencia
fr: Avertissement

# GroupingGrid_FilterBy
source: Filter by
cs: Filtrovat
es: Filtrado por
fr: Filtrer par

# InspectionSettings_FilterBySeverity
source: Severity:
cs: Závažnost:
es: Gravedad:
fr: Sévérité:

# Language_CS
source: Czech
cs: Čeština
fr: Tchèque

# EmptyLineHandling_Ignore
source: Ignore
cs: Ignorovat
es: Ignorar
fr: Ignorer

# EmptyLineHandling_Indent
source: Indent
cs: Odsadit
es: Indentar
fr: Indenter

# EmptyLineHandling_Remove
source: Remove
cs: Odstranit
es: Retirar
fr: Supprimer

# IndenterSettings_EmptyLineHeading
source: Empty line handling:
cs: Zacházení s prázdnými řádky:
es: Manejo de línea vacía:
fr: Traitement des lignes vides:

source: References
cs: Reference
es: Referencias
fr: Références

# ApplyButtonText
source: Apply
cs: Použít
es: Aplicar
fr: Appliquer

# References_AddFailedCaption
source: Could not add reference
cs: Nepovedlo se přidat reference
es: No se pudo agregar la referencia
fr: La référence n'a pu être ajoutée

# References_BrowseCaption
source: Browse for reference
cs: Procházet pro reference
es: Buscar referencias
fr: Parcourir...

# References_BrowseFilterAllFiles
source: All files (*.*)|*.*
cs: Všechny soubory (*.*)|*.*
es: Todos los archivos (*.*)|*. *
fr: Tous (*.*)|*.*

# References_BrowseFilterExcel
source: Microsoft Excel Files ({0})|{0}
cs: Microsoft Excel Soubory ({0})|{0}
es: Archivos de Microsoft Excel ({0})|{0}
fr: Fichiers Microsoft Excel ({0})|{0}

# References_BrowseFilterExecutable
source: Executable Files (*.exe;*.dll)|*.exe;*.dll
cs: Spustitelné Soubory (*.exe;*.dll)|*.exe;*.dll
es: Archivos ejecutables (*.exe;*.dll)|*.exe;*.dll
fr: Exécutables (*.exe,*.dll)|*.exe;*.dll

# References_BrowseFilterTypes
source: Type Libraries (*.olb;*.tlb;*.dll)|*.olb;*.tlb;*.dll
cs: Knihovny (*.olb;*.tlb;*.dll)|*.olb;*.tlb;*.dll
es: Bibliotecas de tipos (*.olb;*.tlb;*.dll)|*.olb;*.tlb;*.dll
fr: Bibliothêques (*.olb;*.tlb;*.dll)|*.olb;*.tlb;*.dll

# References_Caption
source: Add/Remove References...
cs: Přidat/Odebrat Reference...
es: Añadir / Eliminar referencias...
fr: Ajouter/Supprimer Références...

# References_Locale
source: Locale:
cs: Lokalizace:
es: Local:
fr: Langue:

# References_Pinned
source: Pinned
cs: Připíchnuté
es: Fijado
fr: Épingles

# References_Projects
source: Projects
cs: Projekty
es: Proyectos
fr: Projets

# References_Recent
source: Recent
cs: Nedávné
es: Reciente
fr: Récents

# References_SearchPlaceholder
source: Search for reference...
cs: Hledat referenci...
es: Buscar referencia ...
fr: Rechercher une référence...

# References_SubCaption
source: Select type libraries and VB projects to add or remove.
cs: Vybrat knihovny a VB projekty pro přidání nebo odebrání.
es: Seleccione bibliotecas de tipos y proyectos VB para agregar o eliminar.
fr: Sélectionner les librairies et projets à ajouter ou supprimer aux références du projet.

# References_TypeLibs
source: Type Libraries
cs: Knihovny
es: Bibliotecas de tipos
fr: Bibliothèques

# References_Version
source: Version:
cs: Verze:
es: Versión:

# TodoSettings_Caption
source: TODO Explorer
cs: TODO Průzkumník
fr: Explorateur de tâches

# GeneralSettings_SetDpiUnaware
source: Correction for high-resolution display scalings
cs: Korekce pro displaye s vysokým rozlišením a škálováním
es: Corrección para escalas de pantalla de alta resolución
fr: Correction pour l'affichage haute définition

# References_BrowseFilterAccess
source: Microsoft Access Databases({0})|{0}
cs: Microsoft Access Databáze ({0})|{0}
es: Bases de datos de Microsoft Access ({0})|{0}
fr: Base de données Microsoft Access ({0})|{0}

# References_BrowseFilterPowerPoint
source: PowerPoint Addin Files({0})|{0}
cs: PowerPoint Addin Soubory ({0})|{0}
es: Archivos de Complementos de PowerPoint ({0})|{0}
fr: Fichiers complément PowerPoint ({0})|{0}

# References_BrowseFilterWord
source: Word Documents ({0})|{0}
cs: Word Dokumenty ({0})|{0}
es: Documentos de Word ({0})|{0}
fr: Documents Word ({0})|{0}

# ReferenceSettings_FixBroken
source: Attempt to fix broken references
cs: Pokusit se opravit rozbité reference
es: Intenta arreglar las referencias rotas
fr: Tenter de réparer la référence

# ReferenceSettings_FolderDialogHeader
source: Browse for project folder
cs: Vyhledat složku projektu
es: Busque la carpeta del proyecto
fr: Parcourir...

# ReferenceSettings_FoldersHeader
source: Project Directories
cs: Složky Projektu
es: Directorios de proyectos
fr: Dossiers pour les projets

# ReferenceSettings_RecentTracked
source: Recent references tracked:
cs: Nedávné sledované reference:
es: Referencias recientes seguidas:
fr: Références récentes:

# ReferenceSettings_TrackHostReferences
source: Track references not added by Rubberduck
cs: Sledovat reference, které nebyly přidány Rubberduckem
es: Referencias de pistas no agregadas por Rubberduck
fr: Inclure les références qui n'ont pas été ajoutées par Rubberduck

# References_BrowseFilterOutlook
source: Outlook VBA Files ({0})|{0}
cs: Outlook VBA Soubory ({0})|{0}
es: Archivos de Outlook VBA ({0})|{0}
fr: Fichiers VBA Outlook ({0})|{0}

# References_BrowseFilterPublisher
source: Publisher Files ({0}|{0}
cs: Publisher Soubory ({0})|{0}
es: Archivos de Publisher ({0}|{0}
fr: Fichiers Publisher ({0})|{0}

# References_BrowseFilterVisio
source: All Visio Files ({0})|{0}
cs: Všechny Visio Soubory ({0})|{0}
es: Todos los archivos de Visio ({0})|{0}
fr: Tous les fichiers Visio ({0})|{0}

# References_DefaultLocale
source: Standard
cs: Standardní
es: Estándar

# References_CaptionTemplate
source: Add/Remove References - {0}
cs: Přidat/Odebrat Reference = {0}
es: Añadir / Eliminar referencias - {0}
fr: Ajouter/Supprimer Références - {0}

# References_AddToolTip
source: Add to project
cs: Přidat do projektu
es: Añadir al proyecto
fr: Ajouter au projet

# References_MoveDownToolTip
source: Move down
cs: Posunout dolů
es: Mover hacia abajo
fr: Déplacer vers le haut

# References_MoveUpToolTip
source: Move up
cs: Posunout nahorů
es: Mover hacia arriba
fr: Déplacer vers le bas

# References_PinToolTip
source: Pin reference
cs: Přišpendlit referenci
es: Referencia de pin
fr: Épingler la référence

# References_RemoveToolTip
source: Remove from project
cs: Odebrat z projektu
es: Eliminar del proyecto
fr: Supprimer du projet

# MoveCloserToUsageFailure_TargetIsNonPrivateInNonStandardModule
source: '{0}' is a public member of of a class, form or document.
cs: '{0}' je globálně přístupno a je využíváno.
es: '{0}' es una variable de módulo no privado fuera de un módulo estándar.
fr: '{0}' est accessible globalement, et est utilisé.

# MemberAttributeRecoveryFailureCaption
source: Member Attribute Recovery Failure
cs: Selhání obnovy atributu člena
es: Error de recuperación de atributo de miembro
fr: Échec de la récupération des attributs

# MemberAttributeRecoveryRewriteFailedMessage
source: Failed to recover member attributes.
cs: Obnovení atributů členů selhalo.
es: Error al recuperar los atributos de los miembros.
fr: Échec de la récupération des attributs.

# MemberAttributeRecoveryMembersNotFoundMessage
source: Member attributes for the following modules could not be recovered because they could no longer be found. {0}
cs: Atributy členů pro následující moduly se nepodařilo obnovit, protože je jich nelze nalézt. {0}
es: Los atributos de los miembros para los siguientes módulos no se pudieron recuperar porque no se pudieron encontrar. {0}
fr: Les attributs des membres des modules suivants n'ont pas pu être récupérés: {0}

# AllReferences_NoneFoundReference
source: No uses were found for project reference '{0}'.
cs: V projektu nebylo nalezeno žádné využití pro referenci '{0}'.
es: No se encontraron usos para la referencia del proyecto '{0}'.
fr: Aucune utilisation de '{0}' n'a été trouvée dans le projet.

# AllReferences_PerformanceWarning
source: Search for uses of reference '{0}' has returned {1} results. Displaying them may negatively impact performance. Continue?
cs: Výsledek hledání využití reference '{0}' vrátilo {1} výsledků. Jejich zobrazení může mít negativní dopad na výkon. Pokračovat?
es: La búsqueda de usos de la referencia '{0}', ha devuelto {1} resultados. Mostrarlos puede tener un impacto negativo en el rendimiento. ¿Continuar?
fr: La recherche des utilisations de la référence '{0}' renvoie {1} résultats. Les afficher pourrait dégrader la performance. Continuer?

# PerformanceWarningCaption
source: Performance Warning
cs: Varování o výkonu
es: Advertencia de rendimiento
fr: Avertissement - Performance

# MoveCloserToUsageFailure_TargetIsNotUserDefined
source: '{0}' is built-in.
cs: '{0}' je vestavěná proměnná.
es: '{0}' está incorporado.
fr: '{0}' n'est pas défini par l'utilisateur.

# MoveCloserToUsageFailure_TargetIsInDifferentProject
source: '{0}' is not defined in the same project it is used.
cs: '{0}' není definováno ve stejném projektu, ve kterém je používáno.
es: '{0}' no está definido en el mismo proyecto que se usa.
fr: '{0}' doit être défini dans le même projet que la cible.

# MoveCloserToUsageFailure_TargetIsInOtherNonStandardModule
source: '{0}' is defined neither in the component component it is used nor in a standard module.
cs: '{0}' není definováno ani v komponentě komponenty, ve které je použito, ani ve standardním modulu.
es: '{0}' no está definido ni en el componente que se usa, no en un módulo estándar.
fr: '{0}' n'est utilisé ni dans le module où il est défini, ni dans un module standard.

# References_BrowseButtonText
source: Browse...
cs: Procházet...
es: Navegando...
fr: Parcourir...

# InspectionResults_CollapseAll
source: Collapse all
cs: Sbalit vše
es: Desplegar todo
fr: Réduire tout

# InspectionResults_ExpandAll
source: Expand all
cs: Rozbalit vše
es: Expandir todo
fr: Développer tout

# GroupingStyle_BySeverity
source: By severity
cs: Dle závažnosti
es: Por severidad
fr: Par sévérité

# GroupingStyle_ByName
source: By inspection
cs: Dle inspekce
es: Mediante inspección
fr: Par inspection

# GroupingGrid_Filter
source: Filter
cs: Filtr
fr: Filtrer

# MoveCloserToUsageFailure_ReferencingMethodHasSameNameDeclarationInScope
source: The method using '{0}' already has the declaration '{1}' of the same name in scope.
cs: Metoda používající '{0}' má již jinou deklaraci '{1}' stejného jména v rozsahu.
es: En el método que usa '{0}', el nombre de esta variable ya hace referencia a otra declaración.
fr: La procédure qui utilise '{0}' contient déjà une déclaration '{1}' utilisant cet identifiant.

# RefactoringFailure_BaseMessage
source: Refactoring failed.
cs: Refaktorování selhalo.
fr: Échec du refactoring.

# RefactoringFailure_NoActiveSelection
source: There is no active selection.
cs: Neexistuje žádný aktivní výběr.
fr: Cette opération requiert une sélection active.

# RefactoringFailure_NoTargetDeclarationForSelection
source: No viable target selected.
cs: Vybraný cíl nejde refaktorovat.
fr: La sélection ne semble pas contenir de déclaration utilisable.

# RefactoringFailure_TargetNull
source: Target declaration is null.
cs: Cílová deklarace je 'Null'.
fr: La déclaration ciblée est 'null', ...poof?

# ImplementInterfaceFailed_NoImplementsStatementSelected
source: No implements selected.
cs: Nebyl vybrán žádný příkaz implementace.
fr: Une instruction 'Implements' doit être sélectionnée.

# RenameFailure_TargetControlNotFound
source: Target control '{0}' not found.
cs: Cílový control '{0}' nebyl nalezen.
fr: Le contrôle ciblé '{0}' est introuvable.

# RenameFailure_TargetModuleWithoutCodeModule
source: No code module found for the target module '{0}'.
cs: Pro cílový modul '{0}' nebyl nalezen žádný kódový modul.
fr: Le module ciblé '{0}' n'est plus trouvable!

# RenameFailure_StandardEventHandler
source: Target '{0}' is a standard event handler, which cannot be renamed.
cs: Cíl '{0}' je standardní ovladač událostí, který nemůže být přejmenován.
fr: La cible '{0}' est une procédure gestionnaire d'événements, impossible de renommer cette pocédure sans briser quelque chose!

# RefactoringFailure_TargetNotUserDefined
source: The target is not user-defined.
cs: Cíl není uživatelsky definován.
fr: La cible n'est pas définie par l'utilisateur.

# IntroduceFieldFailed_TargetIsAlreadyAField
source: The target '{0}' is already a field.
cs: Cíl '{0}' je již pole.
fr: La cible '{0}' est déjà un champ.

# IntroduceParameterFailed_TargetNotContainedInMethod
source: The target '{0}' is not contained in a method.
cs: Cíl '{0}' není obsažen v metodě.
fr: La cible '{0}' n'est pas contenue dans une procédure.

# RefactoringFailure_InvalidDeclarationType
source: Declaration type of target '{0}' is '{1}' instead of the expected '{2}'.
cs: Deklarace typu cíle '{0}' je '{1}' namísto očekávaného '{2}'.
fr: Le type de déclaration de la cible '{0}' est '{1}', plutôt que '{2}' tel qu'attendu.

# RefactoringFailure_InvalidDeclarationType_multipleValid
source: Declaration type of target '{0}' is '{1}' instead of one of the expected '{2}'.
cs: Typ deklarace cíle '{0}' je '{1}' namísto jednoho z očekávaných '{2}'.
fr: Le type de déclaration de la cible '{0}' est '{1}', mais le type attendu était '{2}'.

# SaveAndClose
source: Save & Close
cs: Uložit a Zavřít
fr: Enregistrer & Fermer

# RegexAssistant_SpelledOut_NewLine
source: new-line
cs: nový-řádek
fr: nouvelle-ligne

# RegexAssistant_SpelledOut_Space
source: space
cs: mezera
fr: espace

# RegexAssistant_SpelledOut_UnidentifiedWhitespace
source: unidentified-whitespace
cs: neidentifikovaná-mezera
fr: espace-non-identifié

# TestOutcome_Fail
source: Fail
cs: Selhání
fr: Échec

# TestOutcome_Succeeded
source: Succeeded
cs: Úspěch
fr: Succès

# TestOutcome_Unknown
source: Unknown
cs: Neznámý
fr: Inconnu

# TestOutcome_Inconclusive
source: Inconclusive
cs: Bezvýsledný
fr: Inconcluant

# InvalidNameCriteria_DoesNotStartWithLetterFormat
source: '{0}' does not start with a letter.
cs: '{0}' nezačíná písmenem.
fr: '{0}' doit débuter par une lettre.

# InvalidNameCriteria_ExceedsMaximumLengthFormat
source: '{0}' exceeds the maximum allowed string length.
cs: '{0}' překročil maximální povolenou délku řetězce.
fr: '{0}' excède la longueur maximale permise.

# InvalidNameCriteria_InvalidCharactersFormat
source: '{0}' contains special character(s) other than underscores.
cs: '{0}' obsahuje speciální znak(y) jiné než podtržítka.
fr: '{0}' contient des caractères spéciaux autres que la barre de soulignement.

# InvalidNameCriteria_IsNullOrEmpty
source: VBA Identifiers cannot be null or zero-length.
cs: Identifikátory VBA nemohou být prázdné, nebo mít nulovou délku.
fr: Un identifiant vide n'est pas valide en VBA.

# InvalidNameCriteria_IsReservedKeywordFormat
source: '{0}' is a reserved keyword.
cs: '{0}' je vyhrazené klíčové slovo.
fr: '{0}' est un mot-clé réservé.

# MeaninglessNameCriteriaMatchFormat
source: The identifier '{0}' will trigger a 'Use Meaningful Name' inspection result.
cs: Identifikátor '{0}' zobrazí inspekci 'Použij Smysluplnější Slovo'.
fr: L'identifiant '{0}' chatouillera l'inspection suggérant d'utiliser un nom conférant signification et importance.

# AssignedByValDialog_MeaninglessNameFormat
source: {0} Consider choosing a different name.
cs: {0} Zvaž použití jiného jména.
fr: {0} Considérez utiliser un nom plus descriptif.

# GeneralSettings_IncludePreRelease
source: Tell me if a newer pre-release build is available.
cs: Oznámení, pokud je k dispozici novější verze předběžného vydání.
fr: M'avertir lorsqu'une nouvelle version "pre-release" est disponible.
