Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/RubberduckUI.*.resx
Languages: cs, es, fr

# CancelButtonText
source: Cancel
cs: Zrušit
es: Cancelar
fr: Annuler

# DeclarationType_ClassModule
source: class
cs: třída
es: clase
fr: la classe

# DeclarationType_Constant
source: constant
cs: konstanta
es: constante
fr: la constante

# DeclarationType_EnumerationMember
source: enum member
cs: enum člen
es: enumerar miembro
fr: le membre de l'énumération

# DeclarationType_Event
source: event
cs: událost
es: evento
fr: l'événement

# DeclarationType_Function
source: function
cs: funkce
es: función
fr: la fonction

# DeclarationType_LibraryFunction
source: library function
cs: funkce knihovny
es: biblioteca de funciones
fr: la fonction externe

# DeclarationType_ProceduralModule
source: module
cs: modul
es: módulo
fr: le module

# DeclarationType_Parameter
source: parameter
cs: parametr
es: parámetro
fr: le paramètre

# DeclarationType_Procedure
source: procedure
cs: procedura
es: procedimiento
fr: la procédure

# DeclarationType_Variable
source: variable
cs: proměnná
fr: la variable

# NameLabelText
source: Name:
cs: Jméno:
es: Nombre:
fr: Nom:

# RenameDialog_Caption
source: Rubberduck - Rename
cs: Rubberduck - Přejmenovat
es: Rubberduck - Renombrar
fr: Rubberduck - Renommer

# RenameDialog_InstructionsLabelText
source: Please specify new name for {0} '{1}'.
cs: Prosím specifikujte nový název pro {0} '{1}'.
es: Por favor, especifique un nuevo nombre para {0} '{1}'.
fr: Veuillez spécifier un nouveau nom pour {0} '{1}'.

# RenameDialog_TitleText
source: Rename identifier
cs: Přejmenovat identifikátor
es: Renombrar identificador
fr: Renommer l'identifiant

# CodeInspections_Inspecting
source: Inspecting...
cs: Kontroluji...
es: Inspeccionando ...
fr: Inspection...

# ExtractMethod_OutputNone
source: (none)
cs: (žádné)
es: (nada)
fr: (aucun)

source: (parsing...)
cs: (parsuji...)
es: (analizando ...)
fr: (analyse...)

# ReorderParamsDialog_MoveDownButtonText
source: Move down
cs: Přesunout níže
es: Mover hacia abajo
fr: Déplacer vers le bas

# ReorderParamsDialog_MoveUpButtonText
source: Move up
cs: Přesunout výše
es: Mover hacia arriba
fr: Déplacer vers le haut

# RemoveParamsDialog_TitleText
source: Remove parameters
cs: Odstranit parametry
es: Quitar parametros
fr: Supprimer les paramètres

# ExtractMethod_InvalidSelectionMessage
source: The current selection is not valid.
cs: Aktuální výběr není platný.
es: La selección actual no es válida.
fr: La sélection n'est pas valide.

# ExtractMethod_PreviewLabel
source: Preview:
cs: Náhled:
es: Avance:
fr: Prévisualisation:

# ExtractMethod_ReturnLabel
source: Return:
cs: Vrátit:
es: Retorno:
fr: Retour:

# ExtractMethod_SetBoxLabel
source: Set
cs: Nastavit

# ExtractMethod_TitleText
source: Extract method
cs: Extrahovat metodu
es: Extraer procedimiento
fr: Extraction d'une méthode

# AllImplementations_NoneFound
source: Class or member '{0}' is not implemented.
cs: Třída nebo člen '{0}' ještě není implementován.
es: La clase o miembro '{0}' no está implementado.
fr: Aucune implémentation trouvée pour '{0}'.

source: Home
cs: Domů
es: Casa
fr: Accueil

# ParseProgress
source: Parsing '{0}'...
cs: Parsuji '{0}'...
es: Analizando '{0}' ...
fr: Analyse de '{0}'...

# ParseStarted
source: Parsing project components...
cs: Parsuji componenty projektu...
es: Analizando componentes del proyecto ...
fr: Analyse des componsantes du projet...

# PromptLoadDefaultConfig
source: {0} {1} {2} Would you like to restore default configuration? Warning: All customized settings will be lost. Your old file will be saved in '{3}'.
cs: {0} {1} {2} Chcete obnovit původní konfiguraci? Upozornění: Všechna uživatelská nastavení budou ztracena. Váš starý soubor bude uložen v '{3}'.
es: {0} {1} {2} ¿Te gustaría restaurar la configuración por defecto? Advertencia: Se perderán todos los ajustes personalizados. Su archivo anterior se guardará en '{3}'.
fr: {0} {1} {2} Restaurer les configurations par défaut? Attention: les valeurs personnalisées seront perdues. Le fichier original sera enregistré sous '{3}'.

# ResolutionProgress
source: Resolving...
cs: Pokouším se vyřešit...
es: Resolviendo ...
fr: Résolution...

# Rubberduck_AboutBuild
source: Version {0}
cs: Verze {0}

# AllImplementations_Caption
source: Implementations of '{0}'
cs: Implementace '{0}'
es: Implementaciones de '{0}'
fr: Implémentations de '{0}'

source: Fix
cs: Opravit
es: Arreglo
fr: Régler

source: Issue
cs: Problém
es: Problema
fr: Problème

source: Name
cs: Jméno
es: Nombre
fr: Nom

source: Next
cs: Další
es: Siguiente
fr: Suivant

source: Parameter
cs: Parametr
es: Parámetro
fr: Paramètre

source: Previous
cs: Předchozí
es: Anterior
fr: Précédent

source: Severity
cs: Závažnost
es: Gravedad
fr: Sévérité

source: Type
cs: Typ
es: Tipo

# Language_EN
source: English
cs: Angličtina
fr: Anglais

# Language_FR
source: French
cs: Francouzština
fr: Français

# GeneralSettings_LanguageLabel
source: Display language:
cs: Jazyk zobrazení:
es: Idioma de visualización:
fr: Langue d'affichage:

source: Result
cs: Výsledek
es: Resultado
fr: Résultat

source: Component
cs: Komponenta
es: Componente
fr: Componsant

source: Warning
cs: Varování
es: Advertencia
fr: Avertissement

source: Refresh
cs: Obnovit
es: Refrescar
fr: Rafraîchir

source: Rename
cs: Přejmenovat
es: Renombrar
fr: Renommer

source: Project Name
cs: Jméno projektu
es: Nombre del proyecto
fr: Nom du projet

# TodoExplorer_LineNumber
source: Line Number
cs: Číslo řádku
es: Número de línea
fr: Ligne

# TodoExplorer_Description
source: Description
cs: Popisek
es: Descripción

# DeclarationType_LineLabel
source: line label
cs: označení řádku
es: etiqueta de línea
fr: l'étiquette de ligne

# ReorderParamsDialog_Caption
source: Rubberduck - Reorder Parameters
cs: Rubberduck - Přeuspořádat parametry
es: Rubberduck - Reordenar Parámetros
fr: Rubberduck - Modifier l'ordre des paramètres

# DeclarationType_Control
source: control
cs: VBDesigner-Objekt
fr: le contrôle

# ReorderParamsDialog_TitleText
source: Reorder parameters
cs: Přeuspořádat parametry
es: Reordenar parametros
fr: Modifier l'ordre des paramètres

# ReorderPresenter_LessThanTwoParametersError
source: Less than two parameters in method '{0}'.
cs: V metodě '{0}' je méně než 2 parametry.
es: Menos de dos parámetros en el método '{0}'.
fr: La méthode '{0}' compte moins de deux paramètres.

# AllReferences_NoneFound
source: No references were found for identifier '{0}'.
cs: V ukazateli '{0}' nebyly nalezeny žádné reference.
es: No se encontraron referencias para el identificador '{0}'.
fr: Aucune référence trouvée pour l'identifiant '{0}'.

# ReorderPresenter_ParamArrayError
source: ParamArray parameter must be specified last.
cs: Parametr ParamArray musí být specifikován naposled.
es: El parámetro ParamArray debe especificarse al final.
fr: Un paramètre ParamArray doit être spécifié en dernier.

# RemovePresenter_NoParametersError
source: No parameters in method '{0}'.
cs: V metodě '{0}' nejsou žádné parametry.
es: No hay parámetros en el método '{0}'.
fr: La méthode '{0}' n'a pas de paramètres.

# AllReferences_Caption
source: All references: '{0}'
cs: Všechny reference: '{0}'
es: Todas las referencias: '{0}'
fr: Références: '{0}'

# RemoveParamsDialog_RemoveIllegalSetterLetterParameter
source: Cannot remove last parameter from setter or letter.
cs: Nelze odstranit poslední parametr ze setteru nebo letteru.
es: No se puede eliminar el último parámetro del establecedor o letra.
fr: Les accesseurs Property Let et Property Set requièrent au moins un paramètre.

# ExtractMethod_AccessibilityLabel
source: Accessibility:
cs: Přístupnost:
es: Accesibilidad:
fr: Accessibilité:

# ExtractMethod_Caption
source: Rubberduck - Extract Method
cs: Rubberduck - Metoda extrakce
es: Rubberduck - Extraer procedimiento
fr: Rubberduck - Extraire une Méthode

# ExtractMethod_InstructionsText
source: Please specify method name, return type and/or parameters (if applicable), and other options.
cs: Prosím specifikujte jméno metody, return typ a/nebo parametry (pokud je možné aplikovat) a další možnosti.
es: Especifique el nombre del método, el tipo de retorno y / o los parámetros (si corresponde) y otras opciones.
fr: Veuillez spécifier le nom de la méthode, le type de sa valeur de retour et les paramètres (si applicable).

# ExtractMethod_ParametersLabel
source: Parameters:
cs: Parametry:
es: Parámetros:
fr: Paramètres:

# LoadConfigError
source: Error Loading Rubberduck Configuration
cs: Chyba při načítání konfigurace Rubberducku
es: Error al cargar la configuración de Rubberduck
fr: Une erreur est survenue lors du chargement des configurations de Rubberduck

# RubberduckLoadFailure
source: Rubberduck Add-In could not be loaded
cs: Nebylo možno načíst Rubberduck Add-In
es: No se pudo cargar el complemento Rubberduck
fr: Une erreur est survenue lors du chargement du complément Rubberduck

source: Code Inspections
cs: Inspekce kódu
es: Inspecciones de código
fr: Inspections

# CodeInspections_InspectingIssues_Singular
source: {0} ({1} issue)
cs: {0} ({1} problém}
es: {0} ({1} problemas)
fr: {0} ({1} problème)

# CodeInspections_NumberOfIssues_Singular
source: {0} issue
cs: {0} problém
es: {0} problemas
fr: {0} problème

# CodeInspections_Run
source: Run code inspections
cs: Spustit inspekce kódu
es: Ejecutar inspecciones de código
fr: Exécuter les inspections

source: Passed
cs: V pořádku
es: Pasado
fr: Passage

# EasterEgg_Continuator
source: You've earned the "Continuator" badge!
cs: Získali jste odznak "Continuator"!
es: ¡Has ganado la insignia de "Continuador"!
fr: Vous obtenez le badge "Continuator"!

# ModuleOptionsNotSpecifiedFirst
source: Module options should be specified first
cs: Nastavení modulu by měla být specifikována jako první
es: Las opciones del módulo deben especificarse primero
fr: Les options du module devraient être spécifiées en premier

# RemoveParamsDialog_Caption
source: Rubberduck - Remove Parameters
cs: Rubberduck - Odstranit Parametry
es: Rubberduck - Eliminar Parámetros
fr: Rubberduck - Supprimer les paramètres

source: Restore
cs: Obnovit
es: Restaurar
fr: Restaurer

# ParseErrors_Caption
source: Rubberduck - Parser Errors
cs: Rubberduck - Chyby parseru
es: Rubberduck - Errores del analizador
fr: Rubberduck - Erreurs d'analyse

source: Inspect
cs: Zkontrolovat
es: Inspeccionar
fr: Inspecter

source: Navigate
cs: Navigovat
es: Navegar
fr: Naviguer

# CodeInspections_CopyToolTip
source: Copy inspection results to clipboard
cs: Zkopírovat výsledky kontroly do schránky
es: Copiar los resultados de la inspección al portapapeles.
fr: Copier les résultats au presse-papier

# CodeInspections_GoToolTip
source: Navigate to selected issue
cs: Navigovat na vybraný problém
es: Navegar a la edición seleccionada
fr: Naviguer au problème sélectionné

# CodeInspections_NextToolTip
source: Navigate to next issue
cs: Navigovat na následující problém
es: Navegar a la próxima edición
fr: Naviguer au prochain problème

# CodeInspections_PreviousToolTip
source: Navigate to previous issue
cs: Navigovat na předchozí problém
es: Navegar a la edición anterior
fr: Naviguer au problème précédent

# CodeInspections_QuickFixToolTip
source: Address the issue
cs: Řešit problém
es: Hacerse cargo del problema
fr: Appliquer une solution

# CodeInspections_RefreshToolTip
source: Run code inspections
cs: Spustit inspekci kódu
es: Ejecutar inspecciones de código
fr: Exécuter les inspections à nouveau

source: Module Name
cs: Název modulu
es: Nombre del módulo
fr: Nom du module

source: Run
cs: Spustit
es: Correr
fr: Exécuter

source: Line
cs: Řádek
es: Línea
fr: Ligne

source: Project
cs: Projekt
es: Proyecto
fr: le projet

# DeclarationType_Project
source: project
cs: projekt
es: proyecto
fr: le projet

source: Change
cs: Změnit
es: Cambiar
fr: Modifier

source: Remove
cs: Odstranit
es: Retirar
fr: Supprimer

source: Navigation
cs: Navigace
es: Navegación

# RenamePresenter_TargetIsInterfaceMemberImplementation
source: Method '{0}' implements '{1}.{2}'. Rename the interface member?
cs: Metoda '{0}' implementuje '{1}.{2}'. Přejmenovat člena rozhraní?
es: El método '{0}' implementa '{1}. {2}'. ¿Cambiar el nombre del miembro de la interfaz?
fr: La méthode '{0}' implémente '{1}.{2}'. Modifier l'interface? (cette modification serait propagée à toutes les implémentations)

source: New
cs: Nový
es: Nuevo
fr: Nouveau

# Rename_DeclarationType
source: Rename {0}
cs: Přejmenovat {0}
es: Renombrar {0}
fr: Renommer {0}

# DeclarationType_UserDefinedType
source: user-defined type
cs: uživatelsky-definovaný typ
es: tipo definido por el usuario
fr: le type définit par l'utilisateur

# DeclarationType_UserDefinedTypeMember
source: user-defined type member
cs: uživatelsky-definovaný člen
es: miembro de tipo definido por el usuario
fr: le membre d'un type définit par l'utilisateur

# TodoSettings_TokenLabel
source: Token Text:
cs: Text tokenu:
es: Etiqueta
fr: Texte:

# TodoSettings_TokenListLabel
source: Token List:
cs: Seznam tokenu:
es: Lista de Etiquetas:
fr: Liste:

# ExtractInterface_TitleLabel
source: Extract Interface
cs: Extrahovat Rozhraní
es: Extraer interfaz
fr: Extraire une interface

# SelectAll_Button
source: Select All
cs: Označit vše
es: Seleccionar todo
fr: Sélectionner tout

# DeselectAll_Button
source: Deselect All
cs: Odznačit vše
es: Deseleccionar todo
fr: Désélectionner tout

# ExtractInterface_MembersGroupBox
source: Members
cs: Členové
es: Miembros
fr: Membres

# ExtractInterface_Caption
source: Rubberduck - Extract Interface
cs: Rubberduck - Extrahovat Rozhraní
es: Rubberduck - Extraer interfaz
fr: Rubberduck - Extraire une interface

# MoveCloserToUsageFailure_InvalidSelection
source: Invalid Selection.
cs: Neplatný výběr.
es: Selección invalida.
fr: Sélection invalide.

# EndOfLineCommentStyle_Absolute
source: Absolute
cs: Absolutní
es: Absoluto
fr: Absolut

# EndOfLineCommentStyle_AlignInColumn
source: Align In Column
cs: Zarovnej ve sloupci
es: Alinear en la columna
fr: Aligner dans la colonne

# GeneralSettings_HotkeyDescription
source: Description
cs: Popis
es: Descripción

# GeneralSettings_HotkeyEnabled
source: Enabled
cs: Povoleno
es: Habilitada
fr: Active

# GeneralSettings_HotkeyKey1
source: Key1
cs: Klíč1
es: Tecla1
fr: Touche1

# IndenterSettings_AlignCommentsWithCode
source: Align comments with code
cs: Zarovnat komenty s kódem
es: Alinear comentarios con código
fr: Aligner les commentaires avec le code

# IndenterSettings_IndentSpaces
source: Indent spaces:
cs: Odsadit mezery:
es: Indentar espacios:
fr: Nombre d'espaces:

# IndenterSettings_IndentOptionsLabel
source: Indent Options
cs: Nastavení odsazení
es: Indentar opciones
fr: Indenter les options

# CodeInspectionResults_Type
source: Type
cs: Typ
es: Tipo

source: Settings
cs: Nastavení
es: Ajustes
fr: Paramètres

# SearchResults_MemberName
source: Member
cs: Člen
es: Miembro
fr: Membre

# SearchResults_ModuleName
source: Module
cs: Modul
es: Módulo

# SearchResults_AllReferencesTabFormat
source: All references: '{0}'
cs: Všechny reference: '{0}'
es: Todas las referencias: '{0}'
fr: Références: '{0}'

# SearchResults_MemberType
source: Type
cs: Typ
es: Tipo

source: Add
cs: Přidat
es: Agregar
fr: Ajouter

# ReorderPresenter_OptionalParametersMustBeLastError
source: Optional parameters must be specified at the end of the parameter list.
cs: Volitelné parametry musejí být specifikovány na konci seznamu parametrů.
es: Los parámetros opcionales deben especificarse al final de la lista de parámetros.
fr: Les paramètres optionels doivent être spéficiés à la fin de la liste.

# Refactoring_TargetIsInterfaceMemberImplementation
source: Method '{0}' implements '{1}.{2}'. Change interface signature? (Will propagate to all implementations.)
cs: Metoda '{0}' implementuje '{1}.{2}'. Změnit podpis rozhraní? (Rozšíří se na všechny implementace.)
es: El método '{0}' implementa '{1}. {2}'. ¿Cambiar la firma de la interfaz? (Se propagará a todas las implementaciones.)
fr: La méthode '{0}' implémente '{1}.{2}'. Modifier la signature de l'interface? (cette modification serait propagée à toutes les implémentations)

# RemoveParamsDialog_InstructionsLabelText
source: Select a parameter and double-click it or use buttons to remove or restore it.
cs: Vyberte parametr a dvojím poklepáním na něj, nebo použitím tlačítek, ho odstraňte nebo obnovte.
es: Seleccione un parámetro y haga doble clic en él o use los botones para eliminarlo o restaurarlo.
fr: Sélectionner un paramètre et utiliser les boutons ou un double-clic pour le supprimer.

# CodeInspections_NumberOfIssuesFound_Plural
source: Rubberduck Code Inspections - {0} {1} issues found.
cs: Rubberduck Inspekce Kódu - {0} Nalezeno {1} problémů.
es: Inspecciones del código de Rubberduck - {0} {1} problemas encontrados.
fr: Inspections Rubberduck - {0} {1} problèmes trouvés.

# RenameDialog_ConflictingNames
source: '{0}' conflicts with the name of the existing declaration '{1}'. Renaming '{2}' to '{0}' may result in uncompilable code or a change in logic. Do you want to proceed with this rename?
cs: Přejmenování na '{0}' je ve střetu s existující deklarací '{1}. Přejmenování '{2}' na '{0}' může vyústit v nekompatibilní kód nebo změnu v jeho logice. Jste si jisti, že chcete pokračovat s tímto přejmenováním?
es: '{0}' entra en conflicto con un nombre existente. Cambiar el nombre de '{1}' a '{0}' puede resultar en un código no compilable o un cambio en la lógica. ¿Desea continuar con este cambio de nombre?
fr: Le nom '{0}' entre en collision avec '{1}', ayant la même portée. Renommer '{2}' à '{0}' peut résulter en code non-compilable ou sournoisement modifier la logique du code appelant. Continuer?

# RenameDialog_AmbiguousSelection
source: Please ensure that exactly 1 control is selected before renaming.
cs: Přesvědčte se, že máte před přejemnováním vybrán pouze 1 control.
es: Asegúrese de que se haya seleccionado exactamente 1 control antes de cambiar el nombre.
fr: Veuillez sélectionner 1 seul contrôle à renommer.

# CodeInspections_InspectingIssues_Plural
source: {0} ({1} issues)
cs: {0} ({1} problémů)
es: {0} ({1} problemas)
fr: {0} ({1} problèmes)

# CodeInspections_NumberOfIssues_Plural
source: {0} issues
cs: {0} problémů
es: {0} problemas
fr: {0} problèmes

# Language_DE
source: German
cs: Němčina
fr: Allemand

# RegexSearchReplaceScope_AllOpenedFiles
source: All Opened Files
cs: Všechny Otevřené Soubory
es: Todos los archivos abiertos
fr: Tous les fichiers ouverts

# RegexSearchReplaceScope_AllOpenProjects
source: All Open Projects
cs: Všechny Otevřené Projekty
es: Todos los proyectos abiertos
fr: Tous les projets ouverts

# RegexSearchReplaceScope_CurrentBlock
source: Current Block
cs: Aktuální Blok
es: Bloque actual
fr: Bloc courant

# RegexSearchReplaceScope_CurrentFile
source: Current File
cs: Aktální Soubor
es: Archivo actual
fr: Fichier courant

# RegexSearchReplaceScope_CurrentProject
source: Current Project
cs: Aktuální Projekt
es: Proyecto actual
fr: Projet courant

# RegexSearchReplaceScope_Selection
source: Selection
cs: Výběr
es: Selección
fr: Sélection

# RegexSearchReplace_Caption
source: Regex Search & Replace
cs: Regex Hledej a Nahraď
es: Buscar y reemplazar Regex
fr: Rechercher/remplacer avec une RegEx

source: Find
cs: Hledat
es: Encontrar
fr: Chercher

# RegexSearchReplace_ReplaceAllButtonLabel
source: Replace All
cs: Nahradit Vše
es: Reemplaza todo
fr: Remplacer tout

# RegexSearchReplace_ReplaceButtonLabel
source: Replace
cs: Nahradit
es: Reemplazar
fr: Remplacer

# RegexSearchReplace_ReplaceLabel
source: Replace:
cs: Nahradit:
es: Reemplazar:
fr: Remplacement:

# RegexSearchReplace_ScopeLabel
source: Scope:
cs: Rozsah:
es: Alcance:
fr: Portée:

# RegexSearchReplace_SearchLabel
source: Search:
cs: Vyhledávání:
es: Buscar:
fr: Rechercher:

# ParserProgress_ShowDetails
source: Details
cs: Detaily
es: Detalles
fr: Détails

source: Make ActiveSheet reference explicit
cs: Udělat ActiveSheet referenci explicitní
es: Hacer explícita la referencia de ActiveSheet
fr: Référer explicitement à la feuille active

source: Make ActiveWorkbook reference explicit
cs: Udělat ActiveWorkbook referenci explicitní
es: Hacer explícita la referencia de ActiveWorkbook
fr: Référer explicitement au classeur actif

# FindSymbolDialog_Caption
source: Find symbol
cs: Najít symbol
es: Encontrar simbolo
fr: Rechercher un symbole

# IndentCurrentProject
source: Current Project
cs: Aktuální Projekt
es: Proyecto actual
fr: Indenter le projet entier

# PromoteVariable_InvalidSelection
source: Selection is not a variable.
cs: Výběr není proměnná.
es: La selección no es una variable.
fr: La sélection n'est pas une variable.

# EncapsulateField_Caption
source: Rubberduck - Encapsulate Field
cs: Rubberduck - Zapouzdřit Pole
es: Rubberduck - Campo Encapsulado
fr: Rubberduck - Encapsuler le champ

# EncapsulateField_InstructionText
source: Select one or more fields to encapsulate. Accept the default values or edit property names.
cs: Prosím, specifikujte jméno vlastnosti, přístupnost parametru a typ 'setteru'.
es: Especifique el nombre de la propiedad, la accesibilidad de los parámetros y el tipo de establecedor.
fr: Veuillez spécifier le nom, l'accessibilité des paramètres, et le type de mutateur pour la nouvelle propriété.

# EncapsulateField_Preview
source: Preview:
cs: Náhled:
es: Avance:
fr: Aperçu:

# EncapsulateField_PropertyName
source: Property Name:
cs: Jméno Property:
es: Nombre de la propiedad:
fr: Nom de la propriété:

# EncapsulateField_TitleText
source: Encapsulate Field
cs: Zapouzdřit Pole
es: Campo encapsulado
fr: Encapsuler le champ

# MoveCloserToUsage_Caption
source: Rubberduck - Move Closer To Usage
cs: Rubberduck - Přesuň na Místo Použití
es: Rubberduck - Acercar al uso
fr: Rubberduck - Rapprocher la déclaration de son utilisation

# MoveCloserToUsageFailure_TargetHasNoReferences
source: '{0}' is not used anywhere.
cs: '{0}' není nikde použito.
es: '{0}' no se usa en ninguna parte.
fr: '{0}' n'est jamais utilisé.

# MoveCloserToUsageFailure_TargetIsUsedInMultipleMethods
source: '{0}' has references in multiple methods.
cs: '{0}' má odkazy ve více metodách.
es: '{0}' tiene referencias en múltiples métodos.
fr: '{0}' est utilisé dans plus d'une méthode.

# IntroduceField_Caption
source: Rubberduck - Introduce Field
cs: Rubberduck - Představ Pole
es: Rubberduck - Introduce el campo
fr: Rubberduck - Introduire un champ

# IntroduceParameter_Caption
source: Rubberduck - Introduce Parameter
cs: Rubberduck - Představ Vlastnost
es: Rubberduck - Introduce Parámetro
fr: Rubberduck - Introduire un paramètre

# IntroduceParameter_PromptIfTargetIsInterface
source: Method '{0}' implements '{1}.{2}'. Change interface signature? (Will propagate to all implementations.)
cs: Metoda '{0}' implementuje '{1}.{2}'. Změnit podpis rozhraní? (Rozšíří se na všechny implementace.)
es: El procedimiento '{0}' implementa '{1}. {2}'. ¿Cambiar la firma de la interfaz? (Se propagará a todas las implementaciones.)
fr: La méthode '{0}' implémente '{1}.{2}'. Modifier la signature de l'interface? (se propagera à toutes les implémentations)

# ImplementInterface_Caption
source: Rubberduck - Implement Interface
cs: Rubberduck - Implementovat Rozhraní
es: Rubberduck - Implementar interfaz
fr: Rubberduck - Implémenter une interface

# ImplementInterface_InvalidSelectionMessage
source: The current selection is not valid.
cs: Aktuální výběr není platný.
es: La selección actual no es válida.
fr: La sélection courante n'est pas valide pour cette opération.

# ExtractInterface_InstructionLabel
source: Please specify interface name and members.
cs: Prosím, specifikujte jméno rozhraní a jeho členy.
es: Por favor, especifique el nombre de la interfaz y los miembros.
fr: Veuillez spécifier le nom et les membres de l'interface.

# SeverityLabelText
source: Severity:
cs: Vážnost:
es: Gravedad:
fr: Sévérité:
