Repository: rubberduck-vba/Rubberduck
Catalog: RubberduckCodeAnalysis/Resources.*.resx
Languages: it

# AnalyzerCategory
source: COM Management
it: Gestione COM

# ChainedWrapperDescription
source: All types derived from SafeComWrappers should not be chained as it leaks unmanaged resources. Use an explicit local variable for each chained member.
it: Tutti i tipi derivati da SafeComWrappers non dovrebbero essere chained perché portano a risoorse non gestite. Usare una variabile locale esplicita per ogni membro chained.

# ChainedWrapperMessageFormat
source: The type '{0}' derives from a SafeComWrapper base. It is called via other SafeComWrapper-derived type '{1}' in the expression '{2}'.
it: Il tipo '{0}' deriva da un SafeComWrapper base. E' chiamato attraverso un altro tipo derivato da SafeComWrapper '{1}' nell'espressione '{2}'.

# DuplicateNameAttribute
source: Duplicate value in 'name' attribute
it: Valore duplicato nell'attributo 'name'

# DuplicateNameAttributeDescription
source: The 'name' attribute is used to uniquely identify an element. Consequently, it has to be unique.
it: L'attributo 'name' è usato per identificare univocamente un elemento. Di consenguenza deve essere univoco.

# DuplicateNameAttributeMessageFormat
source: The value '{0}' is used in the 'name' attribute of multiple '{1}' elements.
it: Il valore '{0}' è usato nell'attributo 'name' di elementi '{1}' multipli.

# InvalidTypeAttribute
source: Invalid value for 'type' attribute.
it: Valore non valido per l'attributo 'type'.

# InvalidTypeAttributeDescription
source: The values of the 'type' attribute are restricted to the value 'Standard Module', 'Class Module', 'Document' and 'User Form'.
it: I valori dell'attributo 'type' sono limitati ai valori 'Standard Module', 'Class Module', 'Document' e 'User Form'.

# InvalidTypeAttributeMessageFormat
source: The value '{0}' is not legal for the 'type' attribute.
it: Il valore '{0}' non è valido per l'attributo 'type'.

# MissingAnnotationSummaryElementDescription
source: All annotations must have a short <summary> xml-doc comment describing what the annotation is used for, that reads comfortably in IntelliSense.
it: Tutte le annotazioni devono avere un breve commento xml-doc <summary> che descrive per cosa viene utilizzata l'annotazione, leggibile comodamente in IntelliSense.

# MissingClassInterfaceDescription
source: COM-visible classes must have an explicit ClassInterface attribute and be set to `None`. This is required to avoid versioning problems.
it: Le classi visibili da COM devono avere un attributo ClassInterface esplicito ed essere impostate su `None`. Ciò è necessario per evitare problemi con le versioni.

# MissingClassInterfaceMessageFormat
source: COM-visible class '{0}' does not have an explicit ClassInterface attribute that is also set to 'ClassInterfaceType.None'.
it: La classe visibile da COM '{0}' non ha un attributo ClassInterface esplicito che è anche impostato a 'ClassInterfaceType.None'.

# MissingClassInterfaceTitle
source: Missing ClassInterface Attribute
it: Attributo ClassInterface Mancante

# MissingComDefaultInterfaceDescription
source: COM-visible classes must have an explicit ComDefaultInterface attribute referring to a COM-visible interface.
it: Le classi visibili da COM devono avere un attributo ComDefaultInterface esplicito che fa riferimento a un'interfaccia visibile da COM.

# MissingComDefaultInterfaceId
source: MissingComDefaultInterface
it: ComDefaultInterface mancante

# MissingComDefaultInterfaceMessageFormat
source: COM-visible class '{0}' must have an explicit ComDefaultInterface attribute using a typeof reference to a COM-visible interface. Do not use string to provide the interface name.
it: La classe visibile da COM '{0}' deve avere un attributo ComDefaultInterface esplicito utilizzando un tipo di riferimento a un'interfaccia visibile da COM. Non utilizzare una stringa per fornire il nome dell'interfaccia.

# MissingComDefaultInterfaceTitle
source: Missing ComDefaultInterface Attribute
it: Attributo ComDefaultInterface mancante

# MissingExampleElement
source: Missing xml-doc 'example' element
it: Elemento xml-doc 'example' mancante

# MissingExampleElementDescription
source: Inspections xml-doc should have at least one 'example' element, ideally two. If only one example is provided, website assumes the code example triggers the inspection. If two examples are provided, the second example is assumed to not trigger the inspection. Any further example is assumed to trigger the inspection.
it: Le ispezioni xml-doc dovrebbero avere almeno un elemento 'example', meglio ancora se due. Se viene fornito un solo esempio, il sito web presuppone che l'esempio di codice inneschi l'ispezione. Se vengono forniti due esempi, si presume che il secondo esempio non attivi l'ispezione. Si presume che qualsiasi altro esempio inneschi l'ispezione.

# MissingExampleElementMessageFormat
source: XML documentation of type '{0}' has no <example> element.
it: La documentatione XML di tipo '{0}' non ha alcun elemento <example>.

# MissingGuidDescription
source: COM-visible types must have an explicit Guid attribute. This is required to avoid verisoning problems. Refer to RubberduckGuid constants.
it: I tipi visibili da COM devono avere un attributo Guid esplicito. Ciò è necessario per evitare problemi con le versioni. Fare riferimento alle costanti RubberduckGuid.

# MissingGuidId
source: MissingGuid
it: Guid mancante

# MissingGuidMessageFormat
source: COM-visible type '{0}' does not have an explicit Guid attribute that references a RubberduckGuid constant.
it: Il tipo visibile da COM '{0}' non dispone di un attributo Guid esplicito che fa riferimento a una costante RubberduckGuid.

# MissingGuidTitle
source: Missing Guid Attribute
it: Attributo Guid Mancante

# MissingHasResultAttribute
source: 'example' element requires a 'hasresult' attribute (bool), which isn't supplied.
it: L'elemento 'example' richiede un attributo 'hasresult' (bool), che non è fornito.

# MissingHasResultAttributeDescription
source: This attribute value will be used to clearly identify which examples are for code that triggers an inspection, vs examples for code that doesn't.
it: Questo valore di attributo verrà utilizzato per identificare chiaramente quali esempi sono per il codice che attiva un'ispezione, rispetto agli esempi per il codice che non lo fa.

# MissingHasResultAttributeMessageFormat
source: 'example' element has no 'hasresult' attribute.
it: L'elemento 'example' non ha l'attributo 'hasresult'.

# MissingInspectionHostAppElement
source: Missing xml-doc 'hostApp' element
it: Elemento xml-doc 'hostApp' mancante

# MissingInspectionHostAppElementDescription
source: XML documentation for inspections with a [RequiredHostAttribute] must include a <hostApp> element with a 'name' attribute with the same value as the [RequiredHostAttribute]. For example [RequiredHost("Excel")] mandates <hostApp name="Excel" />.
it: La documentazione XML per le ispezioni con un [RequiredHostAttribute] deve includere un elemento <hostApp> con un attributo 'name' con lo stesso valore di [RequiredHostAttribute]. Ad esempio [RequiredHost ("Excel")] impone <hostApp name = "Excel" />.

# MissingInspectionHostAppElementMessageFormat
source: XML documentation for type '{0}' is missing a 'hostApp' element.
it: Nella documentazione XML per il tipo '{0}' manca un elemento 'hostApp'.

# MissingInspectionReferenceElement
source: Missing xml-doc 'reference' element
it: Elemento xml-doc 'reference' mancante

# MissingInspectionReferenceElementDescription
source: XML documentation for inspections with a [RequiredLibraryAttribute] must include a <reference> element with a 'name' attribute with the same value as the [RequiredLibraryAttribute]. For example [RequiredLibrary("Excel")] mandates <reference name="Excel" />.
it: La documentazione XML per le ispezioni con un [RequiredLibraryAttribute] deve includere un elemento <reference> con un attributo 'name' con lo stesso valore di [RequiredLibraryAttribute]. Ad esempio [RequiredLibrary ("Excel")] impone <reference name = "Excel" />.

# MissingInspectionReferenceElementMessageFormat
source: XML documentation for type '{0}' is missing a 'reference' element.
it: Nella documentazione XML per il tipo '{0}' manca un elemento 'reference'.

# MissingInspectionSummaryElementDescription
source: All inspections must have a short <summary> xml-doc comment describing what the inspection is looking for, that reads comfortably in IntelliSense.
it: Tutte le ispezioni devono contenere un breve commento xml-doc <summary> che descrive ciò che l'ispezione sta cercando, leggibile comodamente in IntelliSense.

# MissingInspectionWhyElement
source: Missing xml-doc 'why' element
it: Elemento xml-doc 'why' mancante

# MissingInspectionWhyElementDescription
source: Inspections xml-doc must have a 'why' element that contains a paragraph explaining the reasoning behind the inspection.
it: Le ispezioni xml-doc devono avere un elemento 'why' che contiene un paragrafo che spiega il ragionamento alla base dell'ispezione.

# MissingInspectionWhyElementMessageFormat
source: XML documentation for type '{0}' is missing a <why> element.
it: Nella documentazione XML per il tipo '{0}' manca un elemento <why>.

# MissingInterfaceTypeDescription
source: COM-visible interfaces must have an explicit InterfaceType attribute, typically set to Dual or Dispatch for event interfaces.
it: Le interfacce visibili da COM devono avere un attributo InterfaceType esplicito, in genere impostato su Dual o Dispatch per le interfacce degli eventi.

# MissingInterfaceTypeMessageFormat
source: COM-visible interface '{0}' does not have an explicit InterfaceType attribute with the type of interface set. InterfaceIsDual is the recommended choice, unless it's an event, in which case, InterfaceIsIDispatch is recommended instead.
it: L'interfaccia visibili da COM '{0}' non dispone di un attributo InterfaceType esplicito con il tipo di interfaccia impostato. InterfaceIsDual è la scelta consigliata, a meno che non si tratti di un evento, nel qual caso si consiglia invece InterfaceIsIDispatch.

# MissingInterfaceTypeTitle
source: Missing InterfaceType Attribute
it: Attributo InterfaceType Mancante

# MissingModuleElement
source: XML documentation example is missing a 'module' element.
it: Nella documentazione XML di esempio manca un elemento 'module'.

# MissingModuleElementDescription
source: All inspection xml-doc examples should include one or more 'module' element with a 'name' attribute.
it: Tutti gli esempi xml-doc di ispezione dovrebbero includere uno o più elementi 'module' con un attributo 'name'.

# MissingModuleElementMessageFormat
source: 'example' element has no 'module' child.
it: L'elemento 'example' non ha alcun child 'module'.

source: Missing 'name' attribute.
it: Attributo 'name' mancante.

# MissingNameAttributeDescription
source: This attribute value will be used to clearly identify each module in a code example.
it: Questo valore dell'attributo sarà utilizzato per identificare chiaramente ogni modulo in un esempio di codice.

# MissingNameAttributeMessageFormat
source: A '{0}' element requires a 'name' attribute value.
it: Un elemento '{0}' richiede un valore di attributo 'name'.

# MissingProgIdDescription
source: COM-visible classes must have an explicit ProgId attribute. This is required to avoid verisoning problems. Refer to RubberduckProgId constants.
it: Le classi visibili da COM devono avere un attributo ProgId esplicito. Ciò è necessario per evitare problemi con le versioni. Fare riferimento alle costanti RubberduckProgId.

# MissingProgIdMessageFormat
source: COM-visible class '{0}' does not have an explicit ProgId attribute that references a RubberduckProgId constant.
it: La classe visibile da COM '{0}' non ha un attributo ProgId esplicito che fa riferimento a una costante RubberduckProgId.

# MissingProgIdTitle
source: Missing ProgId Attribute
it: Attributo ProgId mancante

source: Missing 'RequiredHost' attribute
it: Attributo 'RequiredHost' mancante

# MissingRequiredHostAttributeDescription
source: The <hostApp name="RequiredHost" /> element means to document the presence of a [RequiredHostAttribute]. If the attribute is correctly missing, the xml-doc element should be removed.
it: L'elemento <hostApp name = "RequiredHost" /> intende documentare la presenza di un [RequiredHostAttribute]. Se l'attributo è mancante correttamente, l'elemento xml-doc dovrebbe essere rimosso.

# MissingRequiredHostAttributeMessageFormat
source: XML documentation of type '{0}' includes a <hostApp> element, but no corresponding [RequiredHostAttribute] is decorating the inspection type. Expected: [RequiredHost("{1}")].
it: La documentazione XML di tipo '{0}' include un elemento <hostApp>, ma nessun [RequiredHostAttribute] corrispondente è presente nel tipo di ispezione. Previsto: [RequiredHost ("{1}")].

# MissingRequiredLibAttribute
source: Missing 'RequiredLibrary' attribute
it: Attributo 'RequiredLibrary' mancante

# MissingRequiredLibAttributeDescription
source: The <reference name="RequiredLibrary" /> element means to document the presence of a [RequiredLibraryAttribute]. If the attribute is correctly missing, the xml-doc element should be removed.
it: L'elemento <reference name="RequiredLibrary" /> intende documentare la presenza di un [RequiredLibraryAttribute]. Se l'attributo è mancante correttamente, l'elemento xml-doc dovrebbe essere rimosso.

# MissingRequiredLibAttributeMessageFormat
source: XML documentation of type '{0}' includes a <reference> element, but no corresponding [RequiredLibraryAttribute] is decorating the inspection type. Expected: [RequiredLibrary("{1}")].
it: La documentazione XML di tipo '{0}' include un elemento <reference>, ma nessun [RequiredLibraryAttribute] corrispondente è presente nel tipo di ispezione. Previsto: [RequiredLibrary ("{1}")].

# MissingSummaryElement
source: Missing xml-doc 'summary' element
it: Elemento xml-doc 'summary' mancante

# MissingSummaryElementMessageFormat
source: XML documentation for type '{0}' is missing a <summary> element.
it: Nella documentazione XML per il tipo '{0}' manca un elemento <summary>.

source: Missing 'type' attribute.
it: Attributo 'type' mancante.

# MissingTypeAttributeDescription
source: This attribute value will be used to determine the component type of each module in a code example.
it: Questo valore di attributo sarà utilizzato per determinare il tipo di componente di ogni modulo in un esempio di codice.

# MissingTypeAttributeMessageFormat
source: A '{0}' element requires a 'type' attribute value.
it: Un elemento '{0}' richiede un valore di attributo 'type'.

# XmlDocAnalyzerCategory
source: Project website compatibility
it: Compatibilità del progetto ad un sito web

# MissingClassInterfaceId
source: MissingClassInterface
it: ClassInterface mancante
