Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Refactorings/RefactoringsUI.*.resx
Languages: de, it

# AnnotationArgumentType_Number
source: Number
de: Zahl
it: Numero

# AnnotationArgumentType_Inspection
source: Inspection Name
de: Inspektionsname
it: Nome dell'Ispezione

# AnnotationArgumentType_Attribute
source: Attribute
de: Attribut
it: Attributo

# AnnotationArgument_ValidationError_WhitespaceInAttribute
source: Annotation arguments of type 'Attribute Name' cannot contain whitespace.
de: Annotationsargumente vom Typ 'Attributname' dürfen keine Leerzeichen enthalten.
it: Gli argomenti dell'annotazione di tipo 'Nome Attributo' non possono contenere whitespace.

# AnnotationArgument_ValidationError_TooLong
source: Annotation arguments cannot be longer than {0} characters.
de: Annotationsargumente dürfen nicht länger als {0} Zeihen sein.
it: Gli argomenti dell'annotazione non possono essere più lunghi di {0} caratteri.

# AnnotationArgument_ValidationError_SpecialCharacters
source: Annotation arguments must not contain control characters.
de: Annotationsargumente dürfen keine Kontrollzeichen enthalten.
it: Gli argomenti dell'annotazione non devono contenere caratteri di controllo.

# AnnotationArgument_ValidationError_NotABoolean
source: Annotation arguments of type 'Boolean' have to either be 'True' or 'False'.
de: Annotationsargumente vom Typ 'Wahrheitswert' müssen entweder 'True' oder 'False' sein.
it: Gli argomenti dell'annotazione di tipo 'Boolean' devono essere 'Vero' o 'Falso'.

# AnnotationArgument_ValidationError_Newline
source: Annotation arguments can only contain a single line.
de: Annotationsargumente dürfen nur aus einer einzigen Zeile bestehen.
it: Gli argomenti dell'annotazione possono contenere solo una riga.

# AnnotationArgument_ValidationError_InspectionName
source: Annotation arguments of type 'Inspection Name' have to be the name of an existing inspection.
de: Annotationsargumente vom Typ 'Inspektionsname' müssen der Name einer existierenden Inspektion sein.
it: Gli argomenti dell'annotazione di tipo 'Inspection Name' devono essere il nome di un'ispezione esistente.

# AnnotationArgument_ValidationError_EmptyArgument
source: Annotation arguments cannot be empty.
de: Annotationsargumente dürfen nicht leer sein.
it: Gli argomenti dell'annotazione non posso essere vuoti.

# AnnotationArgument_ValidationError_AttributeNameStart
source: Annotation arguments of type 'Attribute Name' have to start with 'VB_'.
de: Annotationsargumente vom Typ 'Attributname' müssen mit 'VB_' anfangen.
it: Gli argomenti dell'annotazione di tipo 'Nomi attributo' devono iniziare con 'VB_'.

# AnnotateDeclarationDialog_AddArgumentButtonLabel
source: Add
de: Hinzufügen
it: Aggiungi

# AnnotateDeclarationDialog_TitleText
source: Annotate Declaration
de: Annotation hinzufügen
it: Dichiarazione di Annotazione

# AnnotateDeclarationDialog_RemoveArgumentButtonLabel
source: Remove
de: Entfernen
it: Rimuovi

# AnnotateDeclarationDialog_Instructions
source: Select an annotation (and values) to add to the declaration.
de: Wählen Sie eine Annotation (und Werte), die zu der Deklaration hinzugefügt werden soll.
it: Selezionare un'annotazione (e valori) da aggiungere alla dichiarazione.

# AnnotateDeclarationDialog_DeclarationLabel
source: Declaration to Annotate:
de: Deklaration, zu welcher eine Annotation hinzugefügt werden soll:
it: Dichiarazione di Annotazione:

# AnnotateDeclarationDialog_Caption
source: Rubberduck - Annotate Declaration
de: Rubberduck - Annotation hinzufügen
it: Rubberduck - Dichiarazione di Annotazione

# AnnotateDeclarationDialog_ArgumentValueHeader
source: Value
de: Wert
it: Valore

# AnnotateDeclarationDialog_ArgumentTypeHeader
source: Type
de: Typ
it: Tipo

# AnnotateDeclarationDialog_ArgumentsLabel
source: Annotation Arguments:
de: Annotationsarguments:
it: Argomenti dell'Annotazione:

# AnnotateDeclarationDialog_AnnotationLabel
source: Annotation to Add:
de: Hinzuzufügende Annotation:
it: Annotazione da Aggiungere:

# AnnotateDeclarationDialog_AdjustAttributeLabel
source: Add/Adjust attribute
de: Attribut hinzufügen / anpassen
it: Aggiungi/Adatta attributo

# AssignedByValDialog_MeaninglessNameFormat
source: {0} Consider choosing a different name.
de: {0} Überlegen Sie, einen anderen Namen zu wählen.
it: {0} Considerare di scegliere un nome diverso.

# AssignedByValDialog_NewNameAlreadyUsedFormat
source: '{0}' is already accessible to this scope.
de: '{0}' ist in diesem Kontext bereits verfügbar.
it: '{0}' è già accessibile in questo scope.

# AssignedByValParamQFixDialog_TitleText
source: Specify Local Copy Variable Name
de: Variablenname der Lokalen Kopie festlegen
it: Specificare il Nome della Variabile Locale Copia

# AssignedByValParamQFixDialog_InstructionsLabelText
source: Please specify a name to use for the local copy of ByVal {0} '{1}'.
de: Bitte geben Sie einen Namen für die lokale Kopie von ByVal {0} '{1}'.
it: Specificare un nome da usare per la copia locale di ByVal {0} '{1}'.

# AssignedByValParamQFixDialog_Caption
source: Assigned ByVal parameter QuickFix - Make Local Copy
de: ByVal zugewiesener Parameter QuickFix - Lokale Kopie erstellen
it: Parametro assegnato con ByVal Soluzione veloce - Creare una Copia Locale

# ReorderPresenter_OptionalParametersMustBeLastError
source: Optional parameters must be specified at the end of the parameter list.
de: Optionale Parameter müssen am Ende der Parameterliste deklariert werden.
it: I parametri opzionali devono essere specificati alla fine della lista dei parametri.

# ReorderPresenter_LessThanTwoParametersError
source: Less than two parameters in method '{0}'.
de: Weniger als zwei Parameter für die Methode '{0}'.
it: Meno di due parametri nel metodo '{0}'.

# ReorderParamsDialog_TitleText
source: Reorder parameters
de: Parameter umordnen
it: Riordina i parametri

# ReorderParamsDialog_MoveUpButtonText
source: Move up
de: Nach oben
it: Sposta sopra

# ReorderParamsDialog_MoveDownButtonText
source: Move down
de: Nach unten
it: Sposta sotto

# ReorderParamsDialog_InstructionsLabelText
source: Select a parameter and drag it or use buttons to move it up or down.
de: Wählen sie einen Parameter und bewegen Sie ihn mit der Maus oder den Schaltflächen nach oben oder unten.
it: Selezionare un parametro e trascinarlo o usare i pulsanti per spostarlo sopra o sotto.

# ReorderParamsDialog_Caption
source: Rubberduck - Reorder Parameters
de: Rubberduck - Parameter umordnen
it: Rubberduck - Riordina Parametri

# RenamePresenter_TargetIsInterfaceMemberImplementation
source: Method '{0}' implements '{1}.{2}'. Rename the interface member?
de: Methode '{0}' implementiert '{1}.{2}'. Wollen Sie den Interfacemember umbenennen?
it: Il metodo '{0}' implementa '{1}.{2}'. Rinominare il membro dell'interfaccia?

# RenamePresenter_TargetIsEventHandlerImplementation
source: Method '{0}' is an implementation of event '{1}.{2}'. Rename event '{2}' instead?
de: Die Methode '{0}' ist eine Implementierung des Ereignisses '{1}.{2}'. Stattdessen Ereignis '{2}' umbenennen?
it: Il metodo '{0}' è un'implementazione dell'evento '{1}.{2}'. Rinominare l'evento '{2}'?

# RenamePresenter_TargetIsControlEventHandler
source: Method '{0}' is an EventHandler for control '{1}'. Only the control can be renamed. Rename '{1}' instead?
de: Methode '{0}' ist ein EventHandler für die Schaltfläche '{1}'. Nur die Schaltfläche kann umbenannt werden. Stattdessen '{1}' umbennen?
it: Il metodo '{0}' un è EventHandler per il controllo '{1}'. Solo il controllo può essere rinominato. Rinominare '{1}'?

# RenameFailure_TargetModuleWithoutCodeModule
source: No code module found for the target module '{0}'.
de: Es wurde kein Codemodul für das Zielmodul '{0}' gefunden.
it: Nessun modulo di codice trovato per il modulo di destinazione '{0}'.

# RenameFailure_TargetControlNotFound
source: Target control '{0}' not found.
de: Es wurde das Zielkontrollelement '{0}' nicht gefunden.
it: Controllo di destinazione '{0}' non trovato.

# RenameFailure_StandardEventHandler
source: Target '{0}' is a standard event handler, which cannot be renamed.
de: Das Ziel '{0}' ist ein Standardeventhandler, welcher nicht umbenannt werden kann.
it: La destinazione '{0}' è un gestore d'evento standard, che non può essere rinominato.

# RenameDialog_TitleText_Folder
source: Rename folder
de: Ordner umbenennen
it: Rinomina cartella

# RenameDialog_TitleText
source: Rename identifier
de: Identifikator umbenennen
it: Rinomina l'identificatore

# RenameDialog_OnlyCasingDifferent
source: It is not possible to change only the case of an identifier in VBA (language is case-insensitive).
de: Es ist in VBA nicht möglich nur die Groß- und Kleinschreibung eines Namens zu ändern.
it: Non è possibile modificare solo maiuscole e minuscole di un identificatore in VBA (il linguaggio non distingue maiuscole e minuscole).

# RenameDialog_InterfaceRenameError
source: Could not rename Interface Member {0}.
de: Konnte Interfacemitglied {0} nicht umbenennen.
it: Impossibile rinominare il membro di interfaccia {0}.

# RenameDialog_InstructionsLabelText
source: Please specify new name for {0} '{1}'.
de: Bitte geben Sie einen neuen Namen für {0} '{1}' an.
it: Specificare il nuovo nome per {0} '{1}'.

# RenameDialog_FullNewFolderLabel
source: Full new folder:
de: Kompletter Ordnername:
it: Nuova cartella completa:

# RenameDialog_FolderLabel
source: Folder:
de: Ordner:
it: Cartella:

# RenameDialog_FolderAlreadyExists
source: The folder '{0}' already exists. Renaming '{1}' to '{2}' will lead to a merge with the existing folder. Do you want to proceed?
de: Der Ordner '{0}' existiert bereits. '{1}' in '{2}. umzubenennen wird die Ordner verschmelzen. Wollen Sie fortfahren?
it: La cartella '{0}' esiste già. Rinominare '{1}' in '{2}' la unirà con la cartella esistente. Continuare?

# RenameDialog_Folder
source: folder
de: Ordner
it: cartella

# RenameDialog_DefaultRenameError
source: Could not rename {0}.
de: Konnte {0} nicht umbenennen.
it: Impossibile rinominare {0}.

# RenameDialog_ConflictingNames
source: '{0}' conflicts with the name of the existing declaration '{1}'. Renaming '{2}' to '{0}' may result in uncompilable code or a change in logic. Do you want to proceed with this rename?
de: Der neue Name '{0}' kollidiert mit dem Namen des existierenden Elements '{1}'. '{2}' in '{0}' umzubenennen kann zu nicht kompilierbarem Code oder einer Änderung der Logik führen. Wollen Sie trotzdem fortfahren?
it: '{0}' è in conflitto con il nome della dichiarazione esistente '{1}'. Rinominare '{2}' in '{0}' può rendere il codice non compilabile o modificarne la logica. Procedere con la ridenominazione?

# RenameDialog_Caption
source: Rubberduck - Rename
de: Rubberduck - Umbenennen
it: Rubberduck - Rinomina

# RenameDialog_BuiltInNameError
source: {0} {1} cannot be changed.
de: {0} {1} kann nicht geändert werden.
it: {0} {1} non può essere modificato.

# RenameDialog_AmbiguousSelection
source: Please ensure that exactly 1 control is selected before renaming.
de: Bitte stellen Sie zur Umbenennung sicher, dass genau ein Control-Objekt ausgewählt ist.
it: Assicurarsi che esattamente 1 controllo sia selezionato prima di rinominare.

# Rename_DeclarationType
source: Rename {0}
de: {0} Umbenennen
it: Rinomina {0}

# RemovePresenter_NoParametersError
source: No parameters in method '{0}'.
de: Keine Parameter in Methode '{0}'.
it: Nessun parametro nel metodo '{0}'.

# RemoveParamsDialog_TitleText
source: Remove parameters
de: Parameter entfernen
it: Rimuovi i parametri

# RemoveParamsDialog_RemoveIllegalSetterLetterParameter
source: Cannot remove last parameter from setter or letter.
de: Kann den letzten Parameter eines Setters oder Letters nicht entfernen.
it: Impossibile rimuovere l'ultimo parametro dal setter o letter.

# RemoveParamsDialog_InstructionsLabelText
source: Select a parameter and double-click it or use buttons to remove or restore it.
de: Wählen Sie einen Parameter und benutzen Sie die Schaltflächen oder doppelklicken Sie um ihn zu bewegen oder zu löschen.
it: Seleziona un parametro e fai doppio click su di esso o usa i pulsanti per rimuoverlo o ripristinarlo.

# RemoveParamsDialog_Caption
source: Rubberduck - Remove Parameters
de: Rubberduck - Parameter entfernen
it: Rubberduck - Rimozione Parametri

# RefactoringFailure_TargetNull
source: Target declaration is null.
de: Das Ziel des Refactorings ist null.
it: La dichiarazione di destinazione è nulla.

# RefactoringFailure_SuspendParserFailure
source: Unable to suspend the Parser to perform the refactoring operation.
de: Es war nicht möglich den Parser zum Ausführen des Refactorings temporär zu deaktivieren.
it: Impossibile sospendere l'analizzatore dal compiere l'operazione di refactoring.

# RefactoringFailure_TargetNotUserDefined
source: The target is not user-defined.
de: Das Ziel ist nicht benutzerdefiniert.
it: La destinazione non è di tipo definito dall'utente.

# RefactoringFailure_NoTargetFolder
source: No target has been specified.
de: Es wurde kein Zielordner festgelegt.
it: Non è stata specificata la destinazione.

# RefactoringFailure_NoTargetDeclarationForSelection
source: No viable target selected.
de: Es ist kein zulässiges Ziel selektiert.
it: Nessuna destinazione valida selezionata.

# RefactoringFailure_NoActiveSelection
source: There is no active selection.
de: Es gibt keine aktive Selektion.
it: Non c'è nessuna seleziona attiva.

# RefactoringFailure_InvalidDeclarationType_multipleValid
source: Declaration type of target '{0}' is '{1}' instead of one of the expected '{2}'.
de: Der Typ des Ziels '{0}'ist '{1}' anstatt eines der erwarteten Typen '{2}'.
it: Il tipo dichiarazione di destinazione '{0}' è '{1}' invece di '{2}' atteso.

# RefactoringFailure_InvalidDeclarationType
source: Declaration type of target '{0}' is '{1}' instead of the expected '{2}'.
de: Der Typ des Ziels '{0}'ist '{1}' anstatt des erwarteten Typs '{2}'.
it: Il tipo dichiarazione di destinazione '{0}' è '{1}' invece di '{2}' atteso.

# RefactoringFailure_BaseMessage
source: Refactoring failed.
de: Refactoring fehlgeschlagen.
it: Refactoring non riuscito.

# RefactoringFailure_AnnotateDeclaration_InvalidType
source: The refactoring can only annotate components, members and variables, but the target had type '{0}'.
de: Das Refactoring kann Annotationen nur zu Komponenten, Methoden und Variablen hinzufügen. Die Zieldeklaration hatte allerdings den Typ '{0}'.
it: Il refactoring può solo annotare componenti, membri e variabili, ma la destinazione ha è di tipo '{0}'.

# RefactoringFailure_AffectedModuleIsStale
source: The component '{0}' would have been affected by the refactoring, but its state in Rubberduck's memory is stale. Please refresh Rubberduck and try again.
de: Die Komponente '{0}' würde durch das Refactoring verändert, aber ihr Inhalt ist in Rubberduck veraltet. Bitte lassen Sie Rubberduck seinen Stand aktualisieren und versuchen Sie es erneut.
it: Il componente '{0}' sarebbe oggetto di refactoring, ma il suo stato nella memoria di Rubberduck è superato. Aggiorna Rubberduck e riprova.

# Refactoring_TargetIsInterfaceMemberImplementation
source: Method '{0}' implements '{1}.{2}'. Change interface signature? (Will propagate to all implementations.)
de: Die Methode '{0}' implementiert '{1}.{2}'. Signatur Ändern? (Wird auf alle Implementierungen angewendet)
it: Il metodo '{0}' implementa '{1}.{2}'. Modificare la firma dell'interfaccia? (Si propagherà a tutte le implementazioni.)

# MoveToFolderDialog_TitleText
source: Move to Folder
de: In Ordner verschieben
it: Sposta nella cartella

# MoveToFolderDialog_InstructionsLabelText
source: Please specify a new folder for {0} '{1}' in folder '{2}'.
de: Bitte geben Sie einen neuen Ordner für {0} '{1}' im Ordner '{2}' an.
it: Specificare una nuova cartella per {0} '{1}' nella cartella '{2}'.

# MoveToFolderDialog_FolderLabelText
source: Folder:
de: Ordner:
it: Cartella:

# MoveCloserToUsage_Caption
source: Rubberduck - Move Closer To Usage
de: Rubberduck - Näher an die Nutzung führen
it: Rubberduck - Spostare più vicino all'uso

# MoveCloserToUsageFailure_InvalidSelection
source: Invalid Selection.
de: Ungültige Auswahl.
it: Selezione non valida.

# MoveCloserToUsageFailure_ReferencingMethodHasSameNameDeclarationInScope
source: The method using '{0}' already has the declaration '{1}' of the same name in scope.
de: In der Methode, die '{0}' verwendet, referenziert der Name dieser Variable bereits die Deklaration '{1}.
it: Il metodo che usa '{0}' ha già la dichiarazione '{1}' con lo stesso nome nell'area di validità.

# MoveCloserToUsageFailure_TargetHasNoReferences
source: '{0}' is not used anywhere.
de: '{0}' hat keine Referenzen.
it: '{0}' non è usato.

# MoveCloserToUsageFailure_TargetIsInDifferentProject
source: '{0}' is not defined in the same project it is used.
de: Die Variable '{0}' ist nicht im selben Projekt definiert, in dem sie verwendet wird.
it: '{0}' non è definito nello stesso progetto in cui è usato.

# MoveToFolderDialog_Caption
source: Rubberduck - Move to Folder
de: Rubberduck - In Ordner verschieben
it: Rubberduck - Sposta nella cartella

# MoveRootFolderDialog_InstructionsLabelText
source: Please specify a new parent folder for the folder '{0}'.
de: Bitte geben Sie einen Ordner an, in den der Ordner '{0}' verschoben werden soll.
it: Specificare la nuova cartella superiore per la cartella '{0}'.

# MoveMultipleToFolderDialog_InstructionsLabelText
source: Please specify new folder for the components.
de: Bitte geben Sie einen neuen Ordner für die Komponenten an.
it: Specificare la nuova cartella per i componenti.

# MoveFoldersDialog_TitleText
source: Move Folders
de: Ordner verschieben
it: Sposta cartelle

# MoveFoldersDialog_InstructionsLabelText
source: Please specify a new parent folder for the folders.
de: Bitte geben Sie einen Ordner an, in den die Ordner verschoben werden sollen.
it: Specificare la nuova cartella superiore per le cartelle.

# MoveFoldersDialog_Caption
source: Rubberduck - Move Folders
de: Rubberduck - Ordner verschieben
it: Rubberduck - Sposta Cartelle

# MoveFolders_SameNameSubfolders
source: The target folder '{0}' already contains subfolders {1}. Moving the folders will merge them with the existing folders with corresponding names. Do you want to proceed?
de: Der Zielordner '{0}' enthält bereits die Unterordner {1}. Gleichnamige Ordner werden verschmolzen, wenn die Ordner verschoben werden. Wollen Sie fortfahren?
it: La cartella di destinazione '{0}' contiene già sottocartelle '{1}'. Spostando le cartelle queste saranno unite con le cartelle esistenti con il nome corrispondente. Procedere?

# MoveFolders_SameNameSubfolder
source: The target folder '{0}' already contains a subfolder '{1}'. Moving the folder will merge it with the existing folder. Do you want to proceed?
de: Der Zielordner '{0}' enthält bereits einen Unterordner '{1}'. Die Ordner werden zusammengelegt, wenn der Ordner verschoben wird. Wollen Sie fortfahren?
it: La cartella di destinazione '{0}' contiene già una sottocartella '{1}'. Spostare la cartella questa sarà unirà con la cartella esistente. Procedere?

# MoveFolders_SameNameSourceFolders
source: Several folders with the same name are being moved. This will merge them. Do you want to proceed?
de: Mehrere Ordner mit demselben Namen werden verschoben. Dies wird Sie zusammenlegen. Wollen Sie fortfahren?
it: Più cartelle con lo stesso nome stanno per essere spostate. Questo le unirà. Continuare?

# MoveFolders_EmptySubfolderName
source: The names of individual subfolders cannot be empty.
de: Die Namen individueller Unterordner dürfen nicht leer sein.
it: I nomi delle singole sottocartelle non possono essere vuoti.

# MoveFolders_EmptyFolderName
source: A folder name cannot be empty.
de: Ordnernamen dürfen nicht leer sein.
it: Il nome di una cartella non può essere vuoto.

# MoveFolders_ControlCharacter
source: Folder names cannot contain control characters like e.g. new lines.
de: Ordnernamen dürfen keine Kontrollzeichen wie etwa Zeilenumbrüche enthalten.
it: I nomi delle cartelle non possono contenere caratteri di controllo come ad esempio nuove righe.

# MoveFolderDialog_InstructionsLabelText
source: Please specify a new parent folder for the subfolder '{0}' of '{1}'.
de: Bitte geben Sie einen Ordner an, in den der Unterordner '{0}' des Ordners '{1}' verschoben werden soll.
it: Specificare la nuova cartella superiore per la sottocartella '{0}' di '{1}'.

# MoveCloserToUsageFailure_TargetIsUsedInMultipleMethods
source: '{0}' has references in multiple methods.
de: '{0}' hat Referenzen in mehrere Methoden.
it: '{0}' ha riferimenti in più metodi.

# MoveCloserToUsageFailure_TargetIsNotUserDefined
source: '{0}' is built-in.
de: '{0}' ist keine Nutzerdeklaration.
it: '{0}' è built-in.

# MoveCloserToUsageFailure_TargetIsNonPrivateInNonStandardModule
source: '{0}' is a public member of of a class, form or document.
de: '{0}' ist eine nicht private Modulvariable außerhalb eines Standardmoduls.
it: '{0}' è un membro pubblico di una classe, maschera o documento.

# MoveCloserToUsageFailure_TargetIsInOtherNonStandardModule
source: '{0}' is defined neither in the component component it is used nor in a standard module.
de: Die Variable '{0}' ist weder in der Komponente definiert, in der sie verwendet wir, noch in einem Standardmodul.
it: '{0}' non è definito né nel componente in cui è usato né in un modulo standard.

# InvalidNameCriteria_IsReservedKeywordFormat
source: '{0}' is a reserved keyword.
de: '{0}' ist ein reserviertes Schlüsselwort.
it: '{0}' è una parola riservata.

# InvalidNameCriteria_IsNullOrEmpty
source: VBA Identifiers cannot be null or zero-length.
de: Bezeichner in VBA können nicht Null sein oder Länge Null haben.
it: Gli identificatori VBA non possono essere nulli o a lunghezza zero.

# InvalidNameCriteria_InvalidCharactersFormat
source: '{0}' contains special character(s) other than underscores.
de: '{0}' enthält mindestens ein anderes Sonderzeichen als der Unterstrich.
it: '{0}' contiene uno o più caratteri speciali diversi dal trattino basso.

# InvalidNameCriteria_ExceedsMaximumLengthFormat
source: '{0}' exceeds the maximum allowed string length.
de: '{0}' überschreitet die maximal erlaubte Länge.
it: '{0}' eccede la lunghezza massima consentita per una stringa.

# InvalidNameCriteria_DoesNotStartWithLetterFormat
source: '{0}' does not start with a letter.
de: '{0}' beginnt nicht mit einem Buchstaben.
it: '{0}' non inizia con una lettera.

# PromoteToParameterFailed_TargetNotContainedInMethod
source: The target '{0}' is not contained in a method.
de: Das Ziel '{0}' ist nicht in einer Methode enthalten.
it: La destinazione '{0}' non è contenuta in un metodo.

# PromoteToParameter_PromptIfTargetIsInterface
source: Method '{0}' implements '{1}.{2}'. Change interface signature? (Will propagate to all implementations.)
de: Methode '{0}' implementiert '{1}.{2}'. Ändern der Interface Signatur? (Wird auf alle Implementierungen angewendet.)
it: Il metodo '{0}' implementa '{1}.{2}'. Modificare la firma dell'interfaccia? (Si propagherà a tutte le implementazioni.)

# PromoteToParameter_Caption
source: Rubberduck - Promote to Parameter
de: Rubberduck - Parameter einfügen
it: Rubberduck - Introduci Parametro

# IntroduceFieldFailed_TargetIsAlreadyAField
source: The target '{0}' is already a field.
de: Das Ziel '{0}' ist bereits ein Feld.
it: La destinazione '{0}' è già un campo.

# IntroduceField_Caption
source: Rubberduck - Introduce Field
de: Rubberduck - Feld einfügen
it: Rubberduck - Introduci Campo

# ImplementInterface_Caption
source: Rubberduck - Implement Interface
de: Rubberduck - Interface Implementieren
it: Rubberduck - Implementare un'Interfaccia

# ImplementInterfaceFailed_NoImplementsStatementSelected
source: No implements selected.
de: Es ist keine Implements-Anweisung ausgewählt.
it: Nessuna implementazione selezionata.

# ExtractMethod_TitleText
source: Extract method
de: Methode extrahieren
it: Estrai metodo
