Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Refactorings/RefactoringsUI.*.resx
Languages: de, it

# ExtractMethod_ReturnLabel
source: Return:
de: Rückgabe:
it: Risultato:

# ExtractMethod_PreviewLabel
source: Preview:
de: Vorschau:
it: Anteprima:

# ExtractMethod_ParametersLabel
source: Parameters:
de: Parameter:
it: Parametri:

# ExtractMethod_InvalidSelectionMessage
source: The current selection is not valid: {0}
de: Die aktuelle Auswahl kann nicht extrahiert werden.
it: La selezione corrente non è valida: {0}

# ExtractMethod_InstructionsText
source: Please specify method name, return type and/or parameters (if applicable), and other options.
de: Bitte spezifizieren Sie Methodenname, Rückgabetyp und/oder Parameter (falls anwendbar), sowie andere Optionen.
it: Specificare il nome del metodo, tipo da restituire e/o i parametri (se applicabili), ed altre opzioni.

# ExtractMethod_Caption
source: Rubberduck - Extract Method
de: Rubberduck - Methode Extrahieren
it: Rubberduck - Estrai Metodo

# ExtractMethod_AccessibilityLabel
source: Accessibility:
de: Zugriffsebene:
it: Accessibilità:

# ExtractInterface_TitleLabel
source: Extract Interface
de: Extrahiere Interface
it: Estrai Interfaccia

# ExtractInterface_PublicInstancingMandatedByPublicClass
source: The implementing class is 'Public' mandating the interface be public as well. If you require a 'Private' interface, change the classes instancing to private as well. A private class can still implement a public interface.
de: Die implementierende Klasse ist öffentlich, was es notwendig macht, dass die Schnittstelle ebenfalls öffentlich ist. Falls Sie eine 'private' Schnittstelle benötigen, machen Sie bitte die implementierende Klasse ebenfalls privat. Eine private Klasse kann eine private Schnittstelle implementieren.
it: La classe implementante è 'Public' così come l'interfaccia mandante. Se serve un'interfaccia privata, modificare la classe istanziante in 'Private'. Una classe privata riesce ad implementare un'interfaccia pubblica.

# ExtractInterface_OptionReplaceMembersWithInterfaceMembers
source: Replace Members with Interface Members
de: Ersetze Elemente durch Interface-Elemente
it: Sostituisci i Membri con i Membri dell'Interfaccia

# ExtractInterface_OptionForwardToObjectMembers
source: Forward Interface Member Calls to Object Members
de: Weiterreichen der Interface Elemente Aufrufe an die Object Elemente
it: Inoltra le Chiamate dei Membri dell'Interfaccia ai Membri dell'Oggetto

# ExtractInterface_OptionForwardToInterfaceMembers
source: Forward Object Member Calls to Interface Members
de: Weiterreichen des Object Element Aufrufe an das Interface Element
it: Inoltra le Chiamate dei Membri dell'Oggetto ai Membri dell'Interfaccia

# ExtractInterface_OptionAddEmptyImplementation
source: Add Empty Implementation
de: Füge leere Implementierung hinzu
it: Aggiunti un'Implementazione Vuota

# ExtractInterface_MembersGroupBox
source: Members
de: Elemente
it: Membri

# ExtractInterface_InstructionLabel
source: Please specify interface name and members.
de: Bitte spezifizieren Sie den Interfacenamen und die Elemente.
it: Specificare il nome dell'interfaccia e i membri.

# ExtractInterface_InstancingGroupBox
source: Instancing
de: Sichtbarkeit
it: Istanziamento

# ExtractInterface_ImplementationOptionsGroupBox
source: Implementation Options:
de: Implementierungsoptionen:
it: Opzioni di implementazione:

# ExtractInterface_Caption
source: Rubberduck - Extract Interface
de: Rubberduck - Extrahiere Interface
it: Rubberduck - Estrai Interfaccia

# EncapsulateField_WrapFieldsInPrivateType
source: Wrap Fields in Private Type
de: Felder in einem privaten Typ kapseln
it: Racchiudi i Campi in Tipi Private

# EncapsulateField_TitleText
source: Encapsulate Field
de: Feld Kapseln
it: Incapsula Campo

# EncapsulateField_SetterType
source: Setter Type:
de: Typ des Schreibzugriffs:
it: Tipo di assegnazione:

# EncapsulateField_ReadOnlyCheckBoxContent
source: Read Only
de: Schreibgeschützt
it: Sola Lettura

# EncapsulateField_PropertyName
source: Property Name:
de: Eigenschaftsname:
it: Nome della proprietà:

# EncapsulateField_PrivateUDTPropertyText
source: Creates a property for each UDT Member
de: Erstellt eine Eigenschaft für jedes UDT-Element
it: Crea una proprietà per ogni membro di un Tipo Definito dall'Utente (UDT)

# EncapsulateField_PreviewMarker
source: '<===== Property and declaration changes above this line =====>
de: '<===== Eigenschafts- und Deklarationsänderungen oberhalb dieser Zeile =====>
it: '<===== Modifiche alla proprietà e alla dichiarazione sopra questa riga =====>

# EncapsulateField_Preview
source: Preview:
de: Vorschau:
it: Anteprima:

# EncapsulateField_ParameterName
source: Parameter Name:
it: Nome del parametro:

# EncapsulateField_NameConflictDetected
source: Name conflict
de: Namenskonflikt
it: Conflitto di nomi

# EncapsulateField_InstructionText
source: Select one or more fields to encapsulate. Accept the default values or edit property names.
de: Bitte wählen Sie ein oder mehrere Felder, die gekapselt werden sollen. Die Eigenschaftsnamen könne vor dem bestätigen geändert werden.
it: Selezionare uno o più campi da incapsulare. Accettare i valori predefiniti o modificare i nomi delle proprietà.

# EncapsulateField_Caption
source: Rubberduck - Encapsulate Field
de: Rubberduck - Gekapseltes Feld
it: Rubberduck - Incapsula Campo

# EncapsulateField_ArrayHasExternalRedimFormat
source: Unable to encapsulate '{0}'. ReDim({0}) statement(s) exist in other modules.
de: Das Kapseln von '{0}' ist nicht möglich. Es existieren ReDim({0})-Anweisungen in anderen Modulen.
it: Impossibile incapsulare '{0}'. Istruzione/i ReDim({0}) presente/i in altri moduli.

# AnnotationArgumentType_Text
source: Text
it: Testo

# AnnotationArgument_ValidationError_NotANumber
source: Annotation arguments of type 'Number' have to be a valid number in integer or floating point format.
de: Annotationsargumente vom Typ 'Zahl' müssen eine ganze Zahl oder eine Gleitkommazahl sein.
it: Gli argomenti dell'annotazione di tipo 'Numero' devono essere un numero valido in formato intero o a virgola mobile.

# MoveCloserToUsageDialog_InstructionsLabelText
source: Select the new Type of Declaration Statement for '{0}'.
de: Bitte wählen Sie die zu verwendende Deklarations-Anweisung für '{0}' aus.
it: Selezionare il nuovo Tipo di Istruzione di Dichiarazione per '{0}'.

# MoveCloserToUsageDialog_TitleText
source: Select Declaration Statement
de: Deklarations-Anweisung auswählen
it: Selezione Istruzione di Dichiarazione

# ExtractMethod_NoneSelected
source: (none)
it: (nessuno)

# ExtractParameterNewType_ByValParameter
source: Parameter passed by value
it: Parametro passato per valore

# ExtractParameterNewType_ByRefParameter
source: Parameter passed by reference
it: Parametro passato per riferimento

# ExtractMethod_UnableToMoveVariableDeclarationMessage
source: Unable to move variable declaration
it: Impossibile sposare la dichiarazione di variabile

# ExtractMethod_ReturnTypeSelection
source: Select variable to use as return value of new function. Select None to make a sub.
it: Selezionare la variabile da usare come valore di ritorno di una nuova funzione. Selezionare Nessuna per creare una sub.

# ExtractMethod_ParameterNameColumnHeader
source: Name
it: Nome

# ExtractMethod_ParameterDataTypeColumnHeader
source: Data type
it: Tipo di dato

# ExtractMethod_ParameterAssignmentTypeColumnHeader
source: Pass by type
it: Passare per tipo

# ExtractMethod_InvalidMessageSelectionStartsOutsideProcedure
source: Selection does not start inside a recognised procedure
it: La selezione non inizia dentro una procedura riconosciuta

# ExtractMethod_InvalidMessageSelectionHasUnsupportedStatement
source: Extract method cannot extract code that contains '{0}' statements.
it: Il metodo di estrazione non può estrarre codice che contiene istruzioni '{0}'.

# ExtractMethod_CodePreviewCaption
source: Preview of method extracted from '{0}'
it: Anteprima del metodo estratto da '{0}'

# ExtractMethod_CompilationDirectivesWarning
source: Selected code contains compiler directives. Extracting this code may cause breaking changes.
it: Il codice selezionato contiene direttive di compilazione. L'estrazione di questo codice può causare modifiche sostanziali.

# ExtractMethod_DefaultNewMethodName
source: NewMethod
it: NuovoMetodo

# ExtractMethod_InvalidMessageSelectionEndsOutsideProcedure
source: Selection does not end inside a recognised procedure
it: La selezione non termina dentro una procedura riconosciuta

# ExtractMethod_InvalidMessageSelectionModifiesParentFunctionReturn
source: The selected code modifies the return value of the function it is in
it: Il codice selezionato modifica il valore restituito dalla funzione in cui si trova

# ExtractMethod_InvalidMessageSelectionMoreThanSingleProcedure
source: Selection covers more than a single procedure
it: La selezione comprende più di una procedura singola

# ExtractMethod_InvalidMessageSelectionNotInRecognisedProcedure
source: Selection is not in a recognised procedure type
it: La selezione non è riconosciuta come un tipo procedura

# ExtractMethod_InvalidMessageSelectionNotSetOfCompleteStatements
source: Extract method must contain selection that represents a set of complete statements. It cannot extract a part of a statement.
it: Il metodo di estrazione deve contenere una selezione che rappresenta un insieme di istruzioni complete. Non può estrarre una parte di un'istruzione.

# AnnotationArgumentType_Boolean
source: Boolean
de: Wahrheitswert

# ExtractInterface_Private
source: Private
de: Privat

# ExtractInterface_Public
source: Public
de: Öffentlich
