Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/UnitTesting/TestExplorer.*.resx
Languages: cs, de, es, fr, it

# TestExplorer_TestNumberFailed
source: {0} Failed
cs: {0} selhal
de: {0} fehlgeschlagen
es: {0} Falló
fr: {0} Échoués
it: {0} Fallito

# TestExplorer_TestNumberInconclusive
source: {0} Inconclusive
cs: {0} neprůkazný
de: {0} ergebnislos
es: {0} Indefinido
fr: {0} Inconclusifs
it: {0} Inconcludente

# TestExplorer_TestNumberPassed
source: {0} Passed
cs: {0} v pořádku
de: {0} bestanden
es: {0} Aprobado
fr: {0} Succès
it: {0} Superato

# TestExplorer_AddButtonText
source: Add
cs: Přidat
de: Hinzufügen
es: Añadir
fr: Ajouter
it: Aggiungi

# TestExplorer_AddExpectedErrorTestMethod
source: Test Method (Expected Error)
cs: Testovací metoda (Očekávaný error)
de: neue Testmethode (Erwarteter Fehler)
es: Método de prueba (error esperado)
fr: Test (erreur attendue)
it: Metodo di test (Errore Atteso)

# TestExplorer_AddTestMethod
source: Test Method
cs: Testovací metoda
de: neue Testmethode
es: Método de prueba
fr: Test
it: Metodo di test

# TestExplorer_AddTestModule
source: Test Module
cs: Testovací modul
de: neues Testmodul
es: Módulo de prueba
fr: Module de tests
it: Modulo di test

# TestExplorer_Duration
source: Duration
cs: Trvání
de: Dauer
es: Duración
fr: Durée
it: Durata

# TestExplorer_GotoSelectionToolTip
source: Navigate to selected
cs: Navigovat na výběr
de: Zur Auswahl navigieren
es: Navegar a la selección
fr: Naviguer au test sélectionné
it: Vai alla selezione

# TestExplorer_Message
source: Message
cs: Zpráva
de: Meldung
es: Mensaje
it: Messaggio

# TestExplorer_MethodName
source: Method Name
cs: Název metody
de: Methodenname
es: Nombre del método
fr: Nom
it: Nome del metodo

# TestExplorer_QualifiedModuleName
source: Module
cs: Modul
de: Modul
es: Módulo
it: Modulo

# TestExplorer_RunMenuAllTests
source: All Tests
cs: Všechny testy
de: Alle Tests
es: Todas las pruebas
fr: Tous les tests
it: Tutti i test

# TestExplorer_RunMenuButtonText
source: Run
cs: Spustit
de: Ausführen
es: Ejecutar
fr: Exécuter
it: Esegui

# TestExplorer_RunMenuLastRunTests
source: Repeat Last Run
cs: Spustit poslední běh
de: Wiederhole letzten Testlauf
es: Repetir la última ejecución
fr: Répéter
it: Ripeti l'ultima esecuzione

# TestExplorer_RunMenuPassedTests
source: Passed Tests
cs: Testy, které prošly
de: Bestandene Tests
es: Pruebas aprobadas
fr: Tests passés
it: Test superati

# TestExplorer_RunMenuSelectedTests
source: Selected Tests
cs: Vybrané testy
de: Ausgewählte Tests
es: Pruebas seleccionadas
fr: Tests sélectionnés
it: Test selezionati

# TestExplorer_RunMenuNotRunTests
source: Not Run Tests
cs: Testy, které neproběhly
de: Nicht ausgeführte Tests
es: No Ejecutar Pruebas
fr: Tests non exécutés
it: Non eseguire i test

# TestExplorer_RunMenuFailedTests
source: Failed Tests
cs: Testy, které neprošly
de: Fehlgeschlagene Tests
es: Pruebas fallidas
fr: Tests échoués
it: Test falliti

# Command_AddTestModule_Error
source: Unable to create test module. The host application may not allow for creation of new modules or the project may be locked. For details, check the log.
cs: Nebylo možné vytvořit testovací modul. Hostující aplikace možná nemá povoleno vytváření nových modulů, nebo je projekt uzamčen. Pro detaily se koukněte do logu.
de: Konnte Testmodul nicht erzeugen. Die Hostanwendung könnte die Erzeugung nicht unterstützen oder das Projekt könnte gesperrt sein. Bitte prüfen Sie die Logdatei für weitere Informationen.
es: No se puede crear el módulo de prueba. Es posible que la aplicación host no permita la creación de nuevos módulos o que el proyecto esté bloqueado. Para más detalles, consulte el registro.
fr: Impossible de créer le module de test. L'application hôte peut ne pas permettre la création de nouveaux modules, ou le projet peut être verrouillé. Vérifiez les journaux pour les détails.
it: Impossibile creare il modulo di test. L'applicazione host può non consentire la creazione di nuovi moduli o il progetto può essere bloccato. Per dettagli, controllare il log.

# TestExplorer_Outcome
source: Outcome
cs: Výsledek
de: Ergebnis
es: Salida
fr: Résultat
it: Risultato

# TestExplorer_RunMenuInconclusiveTests
source: Inconclusive Tests
cs: Neprůkazné testy
de: Nicht aussagekräftige Tests
es: Pruebas indefinidas
fr: Tests inconclusifs
it: Test inconcludenti

# TestExplorerDockablePresenter_MultipleTestsSameNameError
source: Two or more projects containing test methods have the same name and identically named tests. Please rename one to continue.
cs: Dva nebo více projektů obsahující testovací metody, mají stejné jména nebo stejně pojmenované testy. Pokud chcete pokračovat, jedno z nich prosím přejmenujte.
de: Zwei oder mehr Projekte mit Testmethoden haben den selben Namen und identisch benannte Tests. Bitte nennen sie zum Fortfahren eines davon um.
es: Dos o más proyectos que contienen métodos de prueba tienen el mismo nombre y pruebas con el mismo nombre. Por favor renombre uno para continuar.
fr: Deux ou plusieurs projets ont le même nom et contiennent une ou plusieurs méthodes de test ayant le même nom. Veuillez en renommer un avant de continuer.
it: Due o più progetti che contengono metodi di test hanno lo stesso nome e nomi di test identici. Rinominarne uno per continuare.

# TestOutcome_Ignored
source: Ignored
cs: Ignorováno
de: Ignoriert
es: Ignorado
fr: Ignoré
it: Ignorato

# TestOutcome_Inconclusive
source: Inconclusive
cs: Neprůkazné
de: Ergebnislos
es: Indefinido
fr: Non concluant
it: Non concludente

# TestOutcome_Succeeded
source: Succeeded
cs: Úspěch
de: Erfolgreich
es: Exitoso
fr: Succès
it: Concluso con successo

# TestOutcome_Unknown
source: Unknown
cs: Neznámý
de: Unbekannt
es: Desconocido
fr: Inconnu
it: Sconosciuto

# UnitTest_NewMethod_ChangeErrorNo
source: Change to expected error number
cs: Změnit na očekávané číslo chyby
de: Auf den Fehlercode des erwarteten Fehlers ändern
es: Cambiar al número de error esperado
fr: Changer le numéro d'erreur
it: Modifica con il numero dell'errore atteso

# UnitTest_NewMethod_ErrorNotRaised
source: Expected error was not raised
cs: Očekávaná chyba se nestala
de: Der erwartete Fehler wurde nicht gefunden
es: El error esperado no fue levantado
fr: L'erreur attendue ne s'est pas produite
it: L'errore atteso non si è verificato

# UnitTest_NewMethod_RaisedTestError
source: Test raised an error
cs: Test skončil s chybou
de: Test hat diesen Fehler ergeben
es: Prueba provocó un error
fr: Le test a produit une erreur
it: Il test ha generato un errore

# UnitTest_NewMethod_Rename
source: Rename test
cs: Přejmenovat test
de: Test umbenennen
es: Renombrar prueba
fr: Renommer le test
it: Rinomina il test

# UnitTest_NewModule_RunAfterTest
source: this method runs after every test in the module
cs: tato metoda běží na konci každého testu v modulu
de: Diese Methode wird nach jedem Test ausgeführt
es: Este método se ejecuta después de cada prueba en el módulo
fr: cette procédure s'exécute après chaque test dans le module
it: Questo metodo è eseguito dopo ogni test nel modulo

# UnitTest_NewModule_RunBeforeTest
source: This method runs before every test in the module.
cs: tato metoda běží před začátkem každého testu v modulu.
de: Diese Methode wird vor jedem Test ausgeführt.
es: Este método se ejecuta antes de cada prueba en el módulo.
fr: cette procédure s'exécute avant chaque test dans le module.
it: Questo metodo è eseguito prima di ogni test nel modulo.

# UnitTest_NewModule_RunOnce
source: this method runs once per module
cs: tato metoda běží jedenkrát v modulu
de: Diese Methode wird einmal pro Modul ausgeführt
es: Este método se ejecuta una vez por módulo
fr: cette procédure s'exécute une seule fois par module
it: Questo metodo è eseguito una volta sola per ogni modulo

# TestExplorer_TotalDuration
source: Total Duration
cs: Celkové Trvání
de: Gesamtdauer
es: Duración total
fr: Durée totale
it: Durata totale

# TestExplorer_CategoryName
source: Category
cs: Kategorie
de: Kategorie
es: Categoría
fr: Catégorie
it: Categoria

# TestExplorer_Uncategorized
source: Uncategorized
cs: Bez kategorie
de: Ohne Kategorie
es: Sin categorizar
fr: Non-catégorisés
it: Senza categoria

# UnitTest_NewModule_BaseName
source: TestModule
cs: TestovaciModul
de: TestModul
it: ModuloTest

# UnitTest_NewModule_DefaultFolder
source: Tests
cs: Testy
es: Pruebas
it: Test

# UnitTest_NewMethod_TestInitializeMethod
source: TestInitialize
cs: InicializaceTestu
de: TestInitialisierung
it: InizializzaTest

# UnitTest_NewMethod_TestFailLabel
source: TestFail
cs: SelhaniTestu
de: TestFehlschlag
it: ErroreTest

# UnitTest_NewModule_LateBindDirective
source: LateBindTests
cs: PozdniVazbaTestu
de: BindeTestsSpaet
es: Pruebas de enlace tardío
it: TestAssociazioneTardiva

# UnitTest_NewMethod_TestExitLabel
source: TestExit
cs: OpusteniTestu
de: TestEnde
it: UscitaTest

# UnitTest_NewMethod_TestCleanupMethod
source: TestCleanup
cs: UklidTestu
de: TestTerminierung
it: PuliziaTest

# UnitTest_NewMethod_ModuleInitializeMethod
source: ModuleInitialize
cs: InicializovatModul
de: ModulInitialisierung
it: InizializzaModulo

# UnitTest_NewMethod_ModuleCleanupMethod
source: ModuleCleanup
cs: VycisteniModulu
de: ModulTerminierung
it: PuliziaModulo

# UnitTest_NewModule_LateBindConstant
source: LateBind
cs: PozdniVazba
de: SpaetesBinden
es: Enlace tardío
it: AssociationeTardiva

# UnitTest_NewMethod_ExpectedError
source: ExpectedError
cs: OcekavanaChyba
de: ErwarteterFehler
es: Error esperado
it: ErroreAtteso

# UnitTest_NewMethod_BaseName
source: TestMethod
cs: TestovaciMetoda
de: TestMethode
it: MetodoTest

# TestOutcome_RunSummaryFormat
source: {0} of {1} test(s) run (total run time: {2:g})
cs: {0} z {1} testů (celková doba běhu: {2:g})
de: {0} von {1} Test(s) ausgeführt. (Laufzeit: {2:g})
es: {0} de {1} Pruebas ejecutadas (Tiempo total de ejecución: {2:g})
fr: {0} de {1} test(s) exécuté(s) (temps d'exécution: {2:g})
it: {0} di {1} test run (tempo totale di esecuzione: {2:g})

# TestExplorer_ContextMenuRunGroup
source: Run all tests in group
cs: Spustit všechny testy ve skupině
de: Alle Tests in der Gruppe ausführen
es: Ejecutar todas las pruebas en grupo
fr: Exécuter le groupe
it: Esegui tutti i test del gruppo

# TestExplorer_ContextMenuRunAll
source: Run all tests
cs: Spustit všechny testy
de: Alle Tests ausführen
es: Ejecutar todas las pruebas
fr: Exécuter tous les tests
it: Esegui tutti i test

# TestExplorer_ContextMenuRunSelected
source: Run selected tests
cs: Spustit označené testy
de: Selektierte Tests ausführen
es: Ejecutar pruebas seleccionadas
fr: Exécuter les tests sélectionnés
it: Eseguiti i test selezionati

# TestExplorer_ContextMenuRunSingle
source: Run single test
cs: Spustit samostatný test
de: Einzelnen Test ausführen
es: Ejecutar prueba única
fr: Exécuter le test
it: Esegui il singolo test

# TestExplorer_ResetButtonTooltip
source: Reset all test results
cs: Resetovat výsledky všech testů
de: Alle Testergebnisse zurücksetzen
es: Restablecer todos los resultados de pruebas
fr: Réinitialiser tous les résultats
it: Azzera i risultati di tutti i test

# UnitTest_NewMethod_Act
source: Act
cs: Jednat
de: Ausfuehren
es: Actuar
it: Agisci

# UnitTest_NewMethod_Arrange
source: Arrange
cs: Připravit
de: Einrichten
es: Organizar
it: Prepara

# UnitTest_NewMethod_Assert
source: Assert
cs: Potvrzení
de: Validieren
es: Afirmar
it: Asserisci

# TestOutcome_DurationHour
source: hr
cs: hod
de: std

# TestOutcome_DurationSecond
source: sec
cs: s
de: s
es: seg
fr: s

# TestOutcome_SummaryCaption
source: Summary:
cs: Shrnutí:
de: Zusammenfassung:
es: Resumen:
fr: Sommaire:
it: Sommario:

# TestExplorer_Filter
source: Test Name
cs: Název Testu
es: Nombre de Prueba
fr: Nom du test
it: Nome del test

# TestExplorer_AllResults
source: All
cs: Vše
de: Alle
es: Todos
fr: Tous
it: Tutto

# TestExplorer_TestToggle_Ignore
source: Ignore test
cs: Ignorovat test
de: Test ignorieren
es: Ignorar prueba
fr: Ignorer le test
it: Ignora il test

# TestExplorer_TestToggle_Unignore
source: Unignore test
cs: Odignorovat test
de: Test nicht mehr ignorieren
es: Incluir la prueba
fr: Réactiver le test
it: Non ignorare il test

# TestExplorer_ContextMenuIgnoreGroup
source: Ignore all tests in group
cs: Ignorovat všechny testy ve skupině
de: Alle Tests in der Gruppe ignorieren
es: Ignorar todas las pruebas del grupo
fr: Ignorer tous les tests du groupe
it: Ignora tutti i test del gruppo

# TestExplorer_ContextMenuIgnoreSelectedTests
source: Ignore selected tests
cs: Ignorovat označené testy
de: Selektierte Tests ignorieren
es: Ignorar las pruebas seleccionadas
fr: Ignorer les tests sélectionnés
it: Ignora i test selezionati

# TestExplorer_ContextMenuUnignoreGroup
source: Unignore all tests in group
cs: Zrušit ignorování všech testů ve skupině
de: Ignorieren aller Tests in der Gruppe aufheben
es: Incluir todas las pruebas del grupo
fr: Désignorer tous les tests du groupe
it: Non ignorare tutti i test nel gruppo

# TestExplorer_ContextMenuUnignoreSelectedTests
source: Unignore selected tests
cs: Zrušit ignorování označených testů
de: Ignorieren der selektierten Tests aufheben
es: Incluir las pruebas seleccionadas
fr: Désignorer les tests sélectionnés
it: Non ignorare tutti i test selezionati

# TestOutcome_Failed
source: Failed
cs: Selhalo
de: Fehlerhaft
es: Ha fallado
fr: Échec
it: Non superato

# TestOutcome_Fail
source: Fail
cs: Selhání
de: Fehlgeschlagen
es: Fallo
fr: Échec
it: Errore

# TestExplorerWindow_Caption
source: Test Explorer
es: Explorador de pruebas
fr: Explorateur de tests
it: Explorer dei Test

# TestExplorerWindowSettings_AccessKey
source: _Test Explorer
es: Explorador de _pruebas
fr: Explorateur de _tests
it: Explorer dei _Test
