Repository: rubberduck-vba/Rubberduck
Catalog: RetailCoder.VBE/UI/RubberduckUI.*.resx
Languages: de, ja, sv

# CancelButtonText
source: Cancel
de: Abbrechen
ja: キャンセル
sv: Avbryt

# DeclarationType_ClassModule
source: class
de: Klasse
ja: クラス
sv: klass

# DeclarationType_Constant
source: constant
de: Konstante
ja: 定数
sv: konstant

# DeclarationType_EnumerationMember
source: enum member
de: Memberkonstante
ja: 列挙型のメンバー
sv: enum medlem

# DeclarationType_Function
source: function
de: Funktion
ja: ファンクション
sv: funktion

# DeclarationType_LibraryFunction
source: library function
de: Bibliotheks-Funktion
ja: ライブラリ関数
sv: extern funktion

# DeclarationType_ProceduralModule
source: module
de: Modul
ja: モジュール
sv: modul

# DeclarationType_Procedure
source: procedure
de: Prozedur
ja: プロシージャー
sv: procedur

# DeclarationType_PropertyGet
source: property get accessor
de: Get-Eigenschaftsprozedur
ja: プロパーティーgetアクセサー
sv: egenskap get åtkommare

# DeclarationType_PropertyLet
source: property let accessor
de: Let-Eigenschaftsprozedur
ja: プロパーティーletアクセサー
sv: egenskap let åtkommare

# DeclarationType_PropertySet
source: property set accessor
de: Set-Eigenschaftsprozedur
ja: プロパーティーsetアクセサー
sv: egenskap set åtkommare

# DeclarationType_UserDefinedType
source: user-defined type
de: Nutzerdefinierter Typ
ja: ユーザー定義型
sv: användardefinerad typ

# DeclarationType_UserDefinedTypeMember
source: user-defined type member
de: Mitglied eines nutzerdefinierten Typs
ja: ユーザー定義型のメンバー
sv: användardefinerad typsmedlem

# RenameDialog_Caption
source: Rubberduck - Rename
de: Rubberduck - Umbenennen
ja: Rubberduck - 名前の変更
sv: Rubberduck - Byt namn

# RenameDialog_InstructionsLabelText
source: Please specify new name for {0} '{1}'.
de: Bitte neuen Namen für {0} '{1}' angeben.
ja: {0} '{1}'に新しい名前を定義してください。
sv: Vänligen ange nytt namn för {0} '{1}'.

# RenameDialog_TitleText
source: Rename identifier
de: Identifikator umbenennen
ja: 識別子の名前を変更
sv: Byt namn på identifierare

# SettingsCaption_GeneralSettings
source: General Settings
de: Allgemeine Einstellungen
ja: 一般設定
sv: Generella inställningar

# SettingsCaption_TodoSettings
source: Todo Settings
de: Todo Einstellungen
ja: TODO設定
sv: "TODO"-markörer inställningar

# SettingsInstructions_InspectionSettings
source: Configure inspection severity. Use "DoNotShow" to disable an inspection.
de: Konfiguriere Untersuchungssensitivität. Zum Deaktivieren einer Untersuchungsart "Nicht anzeigen" auswählen.
ja: 検査の重要度設定。検査を無効にするには、「DoNotShow」を使用します。
sv: Inställningar för inspektionsnivå känslighet. Använd "DoNotShow" för att inaktivera en inspektion.

# SettingsInstructions_GeneralSettings
source: Click [Ok] to close the window and apply changes, or [Cancel] to discard them.
de: [Ok] zum Schließen und Speichern oder [Abbrechen] zum Verwerfen der Änderungen.
ja: 「OK」をクリックでウインドウを閉じ、変更を保存します。「キャンセル」で変更を廃棄します。
sv: Klicka [Ok] för att stänga fönstret och verkställa ändringar, eller [Avbryt] för att kassera ändringar.

# SettingsInstructions_TodoSettings
source: Configure markers to be recognized in comments.
de: Zu erkennende Markierungen in Kommentaren konfigurieren.
ja: コメントで認識されるマーカーを設定してください。
sv: Ställ in markörer som ska bli igenkända i kommentarer.

# DeclarationType_LineLabel
source: line label
de: Sprungmarke
sv: radnummer text

# CodeInspections_Inspecting
source: Inspecting...
de: Inspiziere...
ja: 検査中です…
sv: Inspekterar..

# ExtractMethod_OutputNone
source: (none)
de: (nichts)
ja: （なし）
sv: (ingen)

source: (parsing...)
de: (Parse...)
ja: （解析中です…）
sv: (tolkar...)

# ReorderParamsDialog_Caption
source: Rubberduck - Reorder Parameters
de: Rubberduck - Parameter umordnen
ja: Rubberduck - パラメーター再配置
sv: Rubberduck - Ändra ordning på parametrar

# ReorderParamsDialog_InstructionsLabelText
source: Select a parameter and drag it or use buttons to move it up or down.
de: Wählen sie einen Parameter und bewegen Sie ihn mit der Maus oder den Schaltflächen nach oben oder unten.
ja: パラメーターを選択し、ドラッグやボタンで並び替えます。
sv: Markera en parameter och drag eller använd knapparna för att flytta upp och ner.

# ReorderParamsDialog_MoveDownButtonText
source: Move down
de: Nach unten
ja: 下へ移動
sv: Flytta ned

# ReorderParamsDialog_MoveUpButtonText
source: Move up
de: Nach oben
ja: 上へ移動
sv: Flytta upp

# ReorderParamsDialog_TitleText
source: Reorder parameters
de: Parameter umordnen
ja: パラメーター再配置
sv: Ändra ordning på parametrar

# DeclarationType_Control
source: control
de: VBDesigner-Objekt
ja: コントロール
sv: kontroll

# ReorderPresenter_OptionalParametersMustBeLastError
source: Optional parameters must be specified at the end of the parameter list.
de: Optionale Parameter müssen am Ende der Parameterliste deklariert werden.
ja: 省略可能パラメータは、パラメータリストの最後に指定しなければなりません。
sv: Frivilliga parametrar måste specifieras i slutet av parameterlistan.

# ReorderPresenter_LessThanTwoParametersError
source: Less than two parameters in method '{0}'.
de: Weniger als zwei Parameter für die Methode '{0}'.
ja: メソッド「{0}」のパラメーターが2つ以下です。
sv: Metoden '{0}' har färre än två parametrar.

# AllReferences_NoneFound
source: No references were found for identifier '{0}'.
de: Keine Referenzen für '{0}' gefunden.
ja: 識別子「{0}」は参照されていません。
sv: Inga referenser hittades för identifieraren '{0}'.

# ReorderPresenter_ParamArrayError
source: ParamArray parameter must be specified last.
de: ParamArray-Parameter muss als letztes spezifiziert werden.
ja: ParamArrayパラメーターの定義は最後でなければなりません。
sv: En ParamArray parameter måste specifieras sist.

# RemovePresenter_NoParametersError
source: No parameters in method '{0}'.
de: Keine Parameter in Methode '{0}'.
ja: メソッド「{0}」にパラメーターが見付かりませんでした。
sv: Metoden '{0}' har inga parametrar.

# AllReferences_Caption
source: All references: '{0}'
de: Alle Referenzen: '{0}'
ja: 全ての参照「{0}」
sv: Alla referenser: '{0}'

# RemoveParamsDialog_TitleText
source: Remove parameters
de: Parameter entfernen
ja: パラメーターを削除する
sv: Ta bort parametrar

# Refactoring_TargetIsInterfaceMemberImplementation
source: Method '{0}' implements '{1}.{2}'. Change interface signature? (Will propagate to all implementations.)
de: Die Methode '{0}' implementiert '{1}.{2}'. Signatur Ändern? (Wird auf alle Implementierungen angewendet)
ja: メソッド「{0}」は「{1}.{2}」を実装しています。インターフェース署名を変更しますか？（全ての実装に反映されます）
sv: Metoden '{0}' implementerar '{1}.{2}'. Ändra signaturen på metoden i gränssnittet? (denna ändring propagerar till alla implementationer)

# RemoveParamsDialog_RemoveIllegalSetterLetterParameter
source: Cannot remove last parameter from setter or letter.
de: Kann den letzten Parameter eines Setters oder Letters nicht entfernen.
ja: set・letの最後のパラメーターを削除できませんでした。
sv: Kan inte ta bort sista parametern från en setter eller getter.

# ExtractMethod_InvalidSelectionMessage
source: The current selection is not valid.
de: Die aktuelle Auswahl kann nicht extrahiert werden.
ja: 現在のセレクションは無効です。
sv: Markeringen är inte giltig.

# ExtractMethod_AccessibilityLabel
source: Accessibility:
de: Zugriffsebene:
ja: 接近性：
sv: Åtkomst:

# ExtractMethod_Caption
source: Rubberduck - Extract Method
de: Rubberduck - Methode Extrahieren
ja: Rubberduck - メソッド抽出
sv: Rubberduck - Extrahera metod

# ExtractMethod_InstructionsText
source: Please specify method name, return type and/or parameters (if applicable), and other options.
de: Bitte spezifizieren Sie Methodenname, Rückgabetyp und/oder Parameter (falls anwendbar), sowie andere Optionen.
ja: メソッド名、戻り値、パラメーター等を指定してください。
sv: Vänligen specifiera metodnamn, returtyp och/eller parametrar (om applicerbart).

# ExtractMethod_ParametersLabel
source: Parameters:
de: Parameter:
ja: パラメーター：
sv: Parametrar:

# ExtractMethod_PreviewLabel
source: Preview:
de: Vorschau:
ja: プレビュー：
sv: Förhandsgranskning:

# ExtractMethod_ReturnLabel
source: Return:
de: Rückgabe:
ja: 戻り値
sv: Returnera:

# ExtractMethod_TitleText
source: Extract method
de: Methode extrahieren
ja: メソッド抽出
sv: Extrahera metod

# AllImplementations_NoneFound
source: Class or member '{0}' is not implemented.
de: Klasse oder Member '{0}' ist nicht implementiert.
ja: クラスかメンバー「{0}」は実装されていません。
sv: Klass eller medlem '{0}' är inte implementerad.

# ContextMenu_FindAllReferences
source: &Find all references...
de: &Finde alle Referenzen...
ja: &F全ての参照を検索...
sv: &Hitta alla referenser...

# ContextMenu_FindSymbol
source: Find &symbol...
de: Finde &Symbol...
ja: &sシンボルを検索...
sv: Hitta &symbol...

# ContextMenu_GoToImplementation
source: Go to &implementation...
de: Springe zu &Implementation...
ja: &i実装へ移動...
sv: Gå till &implementering...

# RefactorMenu_ExtractMethod
source: Extract &Method
de: Extrahiere &Methode
ja: &Mメソッド抽出
sv: Extrahera &metod

# RefactorMenu_RemoveParameter
source: Remo&ve Parameters
de: Entferne &Parameter
ja: パラメーター削除
sv: Ta bort &parametrar

# RefactorMenu_Rename
source: &Rename
de: &Umbenennen
ja: &R名前の変更
sv: Byt &namn

# RefactorMenu_ReorderParameters
source: Re&order Parameters
de: Parameter Um&ordnen
ja: &Pパラメーター再配置
sv: Ändra ordning på &parametrar

# RubberduckMenu_About
source: &About...
de: &Über...
ja: &Aアバウト
sv: &Om...

# RubberduckMenu_CodeInspections
source: Code &Inspections
de: &Code-Untersuchungen
ja: &Iコード検査
sv: Inspe&ktioner

# RubberduckMenu_Refactor
source: &Refactor
de: Um&gestalten
ja: &Rリファクタリング
sv: &Refaktorera

# TestMenu_RunAllTests
source: &Run All Tests
de: Alle Tests &durchführen
ja: &R全てのテストを実行
sv: Kö&r alla tester

# CodeExplorerDockablePresenter_ParseStarted
source: {0} (parsing...)
de: {0} (parse...)
ja: {0} （解析中...）
sv: {0} (tolkar...)

source: Home
de: Start
ja: ホーム
sv: Hem

# LoadConfigError
source: Error Loading Rubberduck Configuration
de: Fehler beim Laden der Rubberduck-Konfiguration
ja: Rubberduck設定のロード中にエラーが発生しました
sv: Ett fel uppstod vid laddning av konfigurationen för Gummiankan.

# ParseProgress
source: Parsing '{0}'...
de: Parse '{0}'...
ja: 「{0}」を解析中...
sv: Tolkar '{0}'...

# ParseStarted
source: Parsing project components...
de: Parse Projekt-Komponenten...
ja: プロジェクトコンポーネントを解析中...
sv: Tolkar projektkomponenter...

# PromptLoadDefaultConfig
source: {0} {1} {2} Would you like to restore default configuration? Warning: All customized settings will be lost. Your old file will be saved in '{3}'.
de: {0} {1} {2} Wollen sie die Standardkonfiguration wiederherstellen? Warnung: Alle eigenen Einstellungen gehen dabei verloren. Die Originaldatei wird unter '{3}' gespeichert.
ja: {0} {1} {2} デフォールト設定を回復しますか？ 注意：カスタム設定が全て上書きされます。 古い設定ファイルは「{3}」に保存されます。
sv: {0} {1} {2} Vill du återställa standardinställningarna? Varning: Alla anpassade inställningar kommer att försvinna. Din gamla fil kommer att bli sparad i '{3}'.

# ResolutionProgress
source: Resolving...
de: Löse auf ...
ja: 「{0}」解決中...
sv: Löser '{0}'...

# RubberduckLoadFailure
source: Rubberduck Add-In could not be loaded
de: Konnte das Rubberduck Add-In nicht laden
ja: Rubberduckアドインをロードできませんでした
sv: Ett fel uppstod vid laddning av Rubberduck.

# AllImplementations_Caption
source: Implementations of '{0}'
de: Implementierungen von '{0}'
ja: 「{0}」の実装
sv: Implementationer av '{0}'

source: Code Inspections
de: Code Untersuchung
ja: コード検査
sv: Inspektioner

# CodeInspections_Run
source: Run code inspections
de: Code-Untersuchung ausführen
ja: コード検査を実行
sv: Kör inspektioner

source: Fix
de: Beheben
ja: 修正

source: Issue
de: Problem
ja: 問題
sv: Problem

source: Next
de: Nächstes
ja: 次
sv: Nästa

source: Passed
de: Übergeben
ja: 合格
sv: Passerade

source: Previous
de: Voriges
ja: 前
sv: Föregående

source: Severity
de: Sensitivität
ja: 重大度
sv: Allvarlighetsgrad

# SourceControl_CreateNewRepo
source: Create New Repository
de: Neues Repository erstellen
ja: 新しいリポジトリを作成する
sv: Skapa ett nytt 'repository'

# SourceControl_OpenWorkingDirectory
source: Open Working Directory
de: Arbeitsverzeichnis öffnen
ja: 作業ダイレクトリーを開く
sv: Öppna arbetskatalog

# TestExplorer_TestNumberFailed
source: {0} Failed
de: {0} fehlgeschlagen
ja: 不合格：{0}
sv: {0} Misslyckades

# TestExplorer_TestNumberInconclusive
source: {0} Inconclusive
de: {0} ergebnislos
ja: 不決定的：{0}
sv: {0} Icke-avgörande

# TestExplorer_TestNumberPassed
source: {0} Passed
de: {0} bestanden
ja: 合格：{0}
sv: {0} Lyckade

source: Type
de: Typ
ja: 型
sv: Typ

# TestExplorerDockablePresenter_MultipleTestsSameNameError
source: Two or more projects containing test methods have the same name and identically named tests. Please rename one to continue.
de: Zwei oder mehr Projekte mit Testmethoden haben den selben Namen und identisch benannte Tests. Bitte nennen sie zum Fortfahren eines davon um.
ja: 2つ以上のテストメソッドを含むプロジェクトはプロジェクト名とテスト名が同じです。続行するには同じであるプロジェクトやテスト名を変更してください。
sv: Två eller fler projekt som innehåller testmetoder har samma namn och identisk namngivna tester. Vänligen byt namn på ett test för att fortsätta.

# TodoExplorer_Caption
source: Todo Explorer
de: ToDo Liste
ja: TODOエクスプローラー
sv: "TODO" utforskare

source: Warning
de: Warnung
ja: 警告
sv: Varning

# EasterEgg_Continuator
source: You've earned the "Continuator" badge!
de: Sie haben das Abzeichen "Continuator" erhalten!
ja: 「継続者」バッジを獲得しました！
sv: Du har förtjänat "Fortsättare" medaljen!

# ModuleOptionsNotSpecifiedFirst
source: Module options should be specified first
de: Modul-Optionen sollten zuerst deklariert werden
ja: モジュールオプションは最初に指定しなければなりません
sv: Modulinställningar ska specifieras först

source: Component
de: Komponente
ja: コンポーネント
sv: Komponent

source: Result
de: Ergebnis
ja: 結果
sv: Resultat

source: Outcome
de: Ergebnis
ja: 結果
sv: Utfall

# Language_EN
source: English
de: Englisch
ja: 英語
sv: Engelska

# Language_FR
source: French
de: Französisch
ja: フランス語
sv: Franska

# RemoveParamsDialog_Caption
source: Rubberduck - Remove Parameters
de: Rubberduck - Parameter entfernen
ja: Rubberduck - パラメーター削除
sv: Rubberduck - Ta bort parametrar

# RemoveParamsDialog_InstructionsLabelText
source: Select a parameter and double-click it or use buttons to remove or restore it.
de: Wählen Sie einen Parameter und benutzen Sie die Schaltflächen oder doppelklicken Sie um ihn zu bewegen oder zu löschen
ja: 選択したパラメーターをダブルクリックやボタン操作で削除か回復することが出来ます。
sv: Välj en parameter och dubbelklicka på den eller använd knapparna för att ta bort eller återställa den.

source: Restore
de: Wiederherstellen
ja: レストア
sv: Återställ

# ParseErrors_Caption
source: Rubberduck - Parser Errors
de: Rubberduck - Parserfehler
ja: Rubberduck - 解析エラー
sv: Rubberduck - Fel vid tolkning

# CodeExplorer_AddStdModuleText
source: Standard module (.bas)
de: Standardmodul (.bas)
ja: &S標準モジュール（.bas）
sv: &Standardmodul (.bas)

# CodeExplorer_AddTestModuleText
source: Test module
de: Testmodul
ja: &Tテストモジュール
sv: &Testmodul

# CodeExplorer_DisplayMemberNamesText
source: Display member &names
de: Member&namen anzeigen
ja: メンバー名を表示する
sv: Visa medlems&namn

# CodeExplorer_DisplaySignaturesText
source: Display full &signatures
de: Volle &Signaturen anzeigen
ja: 署名を完全に表示する
sv: Visa fullständiga &signaturer

# CodeExplorer_FindAllImplementationsText
source: Find All Implementations...
de: Alle Implementierungen finden...
ja: &A全ての実装を検索...
sv: Hitta alla implementationer...

# CodeExplorer_FindAllReferencesText
source: Find All References...
de: Alle Referenzen finden...
ja: &F全ての参照を検索...
sv: Hitta alla referenser...

source: Inspect
de: Inspizieren
ja: 検査
sv: Inspektera

source: Navigate
de: Navigieren
ja: ナビゲート
sv: Navigera

source: Refresh
de: Aktualisieren
ja: リフレッシュ
sv: Uppdatera

source: Rename
de: Umbenennen
ja: 名前の変更
sv: Byt namn

# CodeExplorer_RunAllTestsText
source: Run All &Tests
de: Alle &Tests ausführen
ja: &Tテストを全て実行する
sv: Kör alla tester

# CodeExplorer_ShowDesignerToolTip
source: Open Designer
de: Designer öffnen
ja: デザイナーを開く
sv: Öppna designer

# CodeExplorer_ShowFoldersToolTip
source: Toggle folders
de: Ordner umschalten
ja: フォルダの切り替え
sv: Aktivera/inaktivera mappar

# CodeInspections_CopyToolTip
source: Copy inspection results to clipboard
de: Untersuchungsergebnisse in Zwischenablage kopieren
ja: 検査結果をクリップボードにコピーする
sv: Kopiera inspektionsresultat till urklipp

source: Go
de: Los
ja: 実行
sv: Gå

# CodeInspections_GoToolTip
source: Navigate to selected issue
de: Zum ausgewählten Problem navigieren
ja: 選択中の問題へ移動
sv: Navigera till markerat problem

# CodeInspections_NextToolTip
source: Navigate to next issue
de: Zum nächsten Problem navigieren
ja: 次の問題へ移動
sv: Navigera till nästa problem

# CodeInspections_PreviousToolTip
source: Navigate to previous issue
de: Zum vorigen Problem navigieren
ja: 前の問題へ移動
sv: Navigera till föregående problem

# CodeInspections_QuickFixToolTip
source: Address the issue
de: Das Problem beheben
ja: 問題を解決する
sv: Applicera lösning

# CodeInspections_RefreshToolTip
source: Run code inspections
de: Code-Untersuchung ausführen
ja: コード検査を実行する
sv: Kör inspektioner igen

# TodoExplorer_Description
source: Description
de: Beschreibung
ja: 説明
sv: Beskrivning

# TodoExplorer_LineNumber
source: Line Number
de: Zeilennummer
ja: 行数
sv: Radnummer

source: Project Name
de: Projektname
ja: プロジェクト名
sv: Projektnamn

# TestExplorer_AddButtonText
source: Add
de: Hinzufügen
ja: 追加
sv: Lägg till

# TestExplorer_AddExpectedErrorTestMethod
source: Test Method (Expected Error)
de: neue Testmethode (Erwarteter Fehler)
ja: テストメソッド（エラー予想）
sv: Testmetod (förvändade fel)

# TestExplorer_AddTestMethod
source: Test Method
de: neue Testmethode
ja: Tテストメソッド
sv: Testmetod

# TestExplorer_AddTestModule
source: Test Module
de: neues Testmodul
ja: テストモジュール
sv: Testmodul

# TestExplorer_Duration
source: Duration
de: Dauer
ja: 自足時間
sv: Varaktighet

# TestExplorer_GotoSelectionToolTip
source: Navigate to selected
de: Zur Auswahl navigieren
ja: 選択中項目へ移動
sv: Navigera till markering

# TestExplorer_Message
source: Message
de: Meldung
ja: メッセージ
sv: Meddelande

# TestExplorer_MethodName
source: Method Name
de: Methodenname
ja: メソッド名
sv: Metodnamn

source: Module Name
de: Modulname
ja: モジュール名
sv: Modulnamn

# TestExplorer_RunAllTests
source: All Tests
de: Alle Tests
ja: 全てのテスト
sv: Kör alla tester

# TestExplorer_RunButtonText
source: Run
de: Ausführen
ja: 実行
sv: Kör

source: Run
de: Ausführen
ja: 実行

# TestExplorer_RunFailedTests
source: Failed Tests
de: Fehlgeschlagene Tests
ja: 不合格テスト
sv: Kör misslyckade tester

# TestExplorer_RunLastRunTests
source: Repeat Last Run
de: Wiederhole letzten Testlauf
ja: 最後の実行を繰り返す
sv: Repetera senast körning

# TestExplorer_RunNotRunTests
source: Not Run Tests
de: Nicht ausgeführte Tests
ja: 実行されていないテスト
sv: icke körda tester

# TestExplorer_RunPassedTests
source: Passed Tests
de: Bestanden Tests
ja: 合格テスト
sv: Lyckade tester

# TestExplorer_RunSelectedTests
source: Selected Tests
de: Ausgewählte Tests
ja: 選択中のテスト
sv: Markerade tester

source: Line
de: Zeile
ja: 線
sv: Rad

source: Project
de: Projekt
ja: プロジェクト
sv: projektet

# DeclarationType_Project
source: project
de: Projekt
ja: プロジェクト
sv: projektet

source: Add
de: Hinzufügen
ja: 追加
sv: Lägg till

source: Change
de: Ändern
ja: 変更
sv: Ändra

source: Remove
de: Entfernen
ja: 削除
sv: Ta bort

# Settings_Caption
source: Rubberduck Settings
de: Rubberduck Einstellungen
ja: Rubberduck設定
sv: Rubberduck Inställningar

# TodoSettings_TokenLabel
source: Token Text:
de: Markierungstext:
ja: 文字列：
sv: Text:

# TodoSettings_TokenListLabel
source: Token List:
de: Markierungen:
ja: リスト：
sv: Lista:

# RenamePresenter_TargetIsInterfaceMemberImplementation
source: Method '{0}' implements '{1}.{2}'. Rename the interface member?
de: Methode '{0}' implementiert '{1}.{2}'. Wollen Sie den Interfacemember umbenennen?
ja: メソッド「{0}」は「{1}.{2}」を実装しています。インターフェースメンバーの名前を変更しますか？

source: New
de: Neu
ja: 新規
sv: Ny

# Settings_ResetSettings
source: Reset
de: Zurücksetzen
ja: リセット
sv: Återställ

# Settings_ResetSettingsConfirmation
source: Reset settings to default configuration?
de: Einstellungen auf Standardkonfiguration zurücksetzen?
ja: 設定を初期化しますか？
sv: Återställ standardinställningarna?

# RenameDialog_ConflictingNames
source: Renaming to '{0}' clashes with '{1}' in the same scope. Are you sure you want to proceed with this rename?
de: Das Umbenenen zu '{0}' wird einen Konflikt mit '{1}' auslösen.' Wollen Sie trotzdem fortfahren?
ja: 名前「{0}」は同じスコープ内にある「{1}」を同じです。それでも名前の変更を実行しますか？
sv: Namnbyte till '{0}' krockar med '{1}' i samma utrymme. Är du säker på att du vill fortsätta med denna namnbytning?

# Rename_DeclarationType
source: Rename {0}
de: {0} Umbenennen
ja: 「{0}」の名前を変更

# SourceControlPanel_Caption
source: Source Control
de: Versionsverwaltung
ja: ソースコントロール
sv: Källkontroll

# SourceControl_AttributesFile
source: '.gitattributes' File
de: '.gitattributes' Datei
ja: 属性ファイル
sv: Attributfil

# SourceControl_CancelGlobalSettings
source: Cancel
de: Abbrechen
ja: キャンセル
sv: Avbryt

# SourceControl_DefaultRepoLocationLabel
source: Default Repository Location
de: Standard Repositorypfad
ja: リポジトリのデフォルトパス
sv: Standardplats för Repository

# SourceControl_EmailAddressLabel
source: Email Address
de: E-Mail-Adresse
ja: メールアドレス
sv: E-post Adress

# SourceControl_GlobalSettings
source: Global Settings
de: Globale Einstellungen
ja: グローバル設定
sv: Globala Inställningar

# SourceControl_IgnoreFile
source: '.gitignore' File
de: '.gitignore' Datei
ja: Ignoreファイル
sv: Ignorera Fil

# SourceControl_RefreshButtonToolTip
source: Refreshes pending changes
de: Ausstehende Änderungen aktualisieren
ja: 保留中の変更を更新します
sv: Uppdaterar oavslutade ändringar

# SourceControl_RespositorySettings
source: Repository Settings
de: Repository Einstellungen
ja: リポジトリ設定
sv: Repository Inställningar

# SourceControl_UpdateGlobalSettings
source: Update
de: Aktualisieren
ja: 更新
sv: Uppdatera

# SourceControl_UserNameLabel
source: User Name:
de: Nutzername:
ja: ユーザー名
sv: Användarnamn

# SourceControl_Changes
source: Changes
de: Änderungen
ja: 変更
sv: Ändringar

# SourceControl_Branches
source: Branches
de: Zweige
ja: ブランチ
sv: Grenar

# SourceControl_CommitButtonLabel
source: Go
de: Los
ja: 実行
sv: OK

# SourceControl_CommitMessageLabel
source: Commit message:
de: Commit-Meldung:
ja: コミットメモ：
sv: Commit meddelande:

# SourceControl_CurrentBranchLabel
source: Branch:
de: Zweig:
ja: ブランチ：
sv: Grenar:

# SourceControl_DestinationLabel
source: Destination
de: Ziel
ja: デスティネーション

# SourceControl_ExcludedChanges
source: Excluded changes
de: Ausgeschlossene Änderungen
ja: 無視されている変更項目
sv: Exkluderade ändringar

# SourceControl_FetchCommitsLabel
source: Fetch
de: Holen
ja: フェッチ
sv: Hämta

# SourceControl_IncludedChanges
source: Included changes
de: Verwendete Änderungen
ja: 含まれている変更項目
sv: Inkluderade ändringar

# SourceControl_IncomingCommits
source: Incoming commits
de: Eingehende Commits
ja: 入コミット
sv: Inkommande commits

# SourceControl_MergeBranch
source: Merge
de: Zusammenführen
ja: マージ
sv: Mergea

# SourceControl_MergeFormCaption
source: Rubberduck - Merge
de: Rubberduck - Zusammenführen
ja: Rubberduck - マージ

# SourceControl_NewBranch
source: New Branch
de: Neuer Zweig
ja: 新しいブランチ
sv: Ny Gren

# SourceControl_OutgoingCommits
source: Outgoing commits
de: Ausgehende Commits
ja: 出コミット
sv: Utgående commits

# SourceControl_PublishedBranchesLabel
source: Published Branches
de: Veröffentlichte Zweige
ja: 公開ブランチ
sv: Publicerade Grenar

# SourceControl_PullCommitsLabel
source: Pull
de: Aktualisieren
ja: プル

# SourceControl_PushCommitsLabel
source: Push
de: Versenden
ja: プッシュ

# SourceControl_Settings
source: Settings
de: Einstellungen
ja: 設定
sv: Inställningar

# SourceControl_SourceLabel
source: Source
de: Quelle
ja: ソース
sv: Källa

# SourceControl_SyncCommitsLabel
source: Sync
de: Synchronisieren
ja: 同期
sv: Synkronisera

# SourceControl_UnpublishedBranchesLabel
source: Unpublished Branches
de: Nicht veröffentlichte Zweige
ja: 未公開ブランチ
sv: Opublicerade Grenar

# SourceControl_UnsyncedCommits
source: Unsynced commits
de: Nicht synchronisierte Commits
ja: 未同期コミット
sv: Osynkroniserade commits

# SourceControl_UntrackedFiles
source: Untracked files
de: Nicht verfolgte Dateien
ja: 追跡されていないブランチ
sv: Ej spårade filer

# SourceControl_SuccessfulMerge
source: Successfully Merged {0} into {1}
de: {0} efolgreich mit {1} zusammengeführt
ja: {1}に{0}が正常にマージされました。
sv: Lyckades slå ihop {0} in i {1}
