Repository: rubberduck-vba/Rubberduck
Catalog: RetailCoder.VBE/UI/RubberduckUI.*.resx
Languages: de, ja, sv

# FormContextMenu_Rename
source: Re&name
de: Umbe&nennen
ja: &n名前の変更
sv: Byt &namn

# SourceControl_MergeFormInstructions
source: Please select source and destination branches.
de: Bitte wählen Sie Quell- und Zielzweig
ja: ソースとデスティネーションブランチを選択してください。
sv: Vänligen välj käll- och destinationsgren.

# SourceControl_DeleteBranchTitleLable
source: Delete branch
de: Zweig löschen
ja: ブランチ削除
sv: Ta bort gren

# SourceControl_CreateNewBranchTitle
source: New branch
de: Neuer Zweig
ja: 新しいブランチ
sv: Ny Gren

# CodeExplorer_New
source: &New
de: &Neu
ja: &N新規
sv: &Ny

# SourceControl_DeleteBranchCaption
source: Rubberduck - Delete Branch
de: Rubberduck - Zweig löschen
ja: Rubberduck - ブランチ削除
sv: Rubberduck - Ta bort gren

# CodeInspections_NumberOfIssues_Singular
source: {0} issue
de: {0} Problem
ja: 問題数：{0}
sv: {0} problem

# CodeInspections_InspectingIssues_Plural
source: {0} ({1} issues)
de: {0} ({1} Probleme)
ja: {0}（{1}問題）
sv: {0} ({1} problems)

# SourceControl_DeleteBranchInstructionsLabel
source: Please specify branch name.
de: Bitte geben Sie einen Zweignamen an.
ja: ブランチ名を削除
sv: Vänligen ange grennamn.

# SourceControl_CreateNewBranchCaption
source: Rubberduck - Create Branch
de: Rubberduck - Zweig erstellen
ja: Rubberduck - ブランチ作成
sv: Rubberduck - Skapa Gren

# CodeInspections_NumberOfIssuesFound_Singular
source: Rubberduck Code Inspections - {0} {1} issue found.
de: Rubberduck Code Untersuchung - {0} {1} Problem gefunden.
ja: Rubberduck コード検査 - {0} {1}問題を発見。
sv: Gummianka Inspektioner - {0} {1} problem hittades.

# SourceControl_NoRepoFound
source: No repository found.
de: Kein Repository gefunden.
ja: リポジトリが見付かりませんでした。
sv: Inget repository hittat.

# SourceControl_MergeFormTitle
source: Merge branches
de: Zweige zusammenführen
ja: ブランチをマージ
sv: Mergea grenar

# SourceControl_CreateNewBranchInstructions
source: Please specify branch name.
de: Bitte geben sie einen Zweignamen an.
ja: ブランチ名を定義してください。
sv: Vänligen specifiera grennamn.

# CodeInspections_NumberOfIssues_Plural
source: {0} issues
de: {0} Probleme
ja: {0}問題
sv: {0} problems

# CodeExplorer_Refresh
source: R&efresh
de: Aktualisieren
ja: &eリフレッシュ
sv: Uppdat&era

# CodeExplorer_Navigate
source: Na&vigate
de: Na&vigieren
ja: &vナビゲート
sv: Na&vigera

# CodeInspections_InspectingIssues_Singular
source: {0} ({1} issue)
de: {0} ({1} Problem)
ja: {0} （問題数：{1}）
sv: {0} ({1} problem)

# CodeInspections_NumberOfIssuesFound_Plural
source: Rubberduck Code Inspections - {0} {1} issues found.
de: Rubberduck Code Untersuchung - {0} {1} Probleme gefunden
ja: Rubberduckコード検査 - {0} 問題数：{1}。
sv: Gummianka Inspektioner - {0} {1} problems hittades.

# Language_DE
source: German
de: Deutsch
ja: ドイツ語
sv: Deutsch

# RubberduckMenu_Navigate
source: Na&vigate
de: &Navigieren
ja: &vナビゲート
sv: Na&vigera

# RegexSearchReplaceScope_CurrentFile
source: Current File
de: Aktuelle Datei

# RegexSearchReplaceScope_CurrentBlock
source: Current Block
de: Aktueller Block

# RegexSearchReplaceScope_AllOpenProjects
source: All Open Projects
de: Alle geöffneten Projekte

# RegexSearchReplaceScope_CurrentProject
source: Current Project
de: Aktuelles Projekt

# RegexSearchReplaceScope_AllOpenedFiles
source: All Opened Files
de: Alle geöffneten Dateien

# RegexSearchReplace_ReplaceButtonLabel
source: Replace
de: Ersetzen

# RegexSearchReplace_ReplaceAllButtonLabel
source: Replace All
de: Alles Ersetzen

# RegexSearchReplace_Caption
source: Regex Search & Replace
de: Regex Suchen & Ersetzen

# RegexSearchReplaceScope_Selection
source: Selection
de: Auswahl

# RegexSearchReplace_SearchLabel
source: Search:
de: Suche nach:

# RegexSearchReplace_ReplaceLabel
source: Replace:
de: Ersetze durch:

# RegexSearchReplace_ScopeLabel
source: Scope:
de: Bereich:

source: Make ActiveWorkbook reference explicit
de: Setze die Referenz explizit auf das 'ActiveWorkbook'

source: Make ActiveSheet reference explicit
de: Setze die Referenz explizit auf das 'ActiveSheet'

# CodeExplorer_DisplayModeToolTip
source: Display style
de: Style anzeigen

# CodeExplorer_NewToolTip
source: Add a component to the active project
de: Füge eine Komponente zum aktiven Projekt hinzu

# FindSymbolDialog_Caption
source: Find symbol
de: Finde Symbol

# SourceControl_DeleteButton
source: Delete
de: Zweig löschen
ja: ブランチ削除
sv: Ta bort gren

# ExtractInterface_Caption
source: Rubberduck - Extract Interface
de: Rubberduck - Extrahiere Interface

# DeselectAll_Button
source: Deselect All
de: Alles abwählen

# SelectAll_Button
source: Select All
de: Alles auswählen

# ExtractInterface_TitleLabel
source: Extract Interface
de: Extrahiere Interface

# ExtractInterface_MembersGroupBox
source: Members
de: Mitglieder

# ExtractInterface_InstructionLabel
source: Please specify interface name and members.
de: Bitte spezifizieren Sie den Interface-Namen und die Mitglieder

# IndentCurrentModule
source: Current &Module
de: Aktuelles &Modul

# IndentCurrentProcedure
source: Current &Procedure
de: Aktuelle &Prozedur

# IndentCurrentProject
source: Current Project
de: Aktuelles Projekt

# SmartIndenterMenu
source: In&dent
de: Ein&rücken
ja: インデント

# RefactorMenu_IntroduceField
source: Introduce &Field
de: &Feld einführen

# PromoteVariable_InvalidSelection
source: Selection is not a variable.
de: Die Auswahl ist keine Variable

# RefactorMenu_EncapsulateField
source: &Encapsulate Field
de: F&eld kapseln

# EncapsulateField_Caption
source: Rubberduck - Encapsulate Field
de: Rubberduck - Gekapseltes Feld

# EncapsulateField_Preview
source: Preview:
de: Vorschau:

# EncapsulateField_PropertyName
source: Property Name:
de: Eigenschaftsname:

# RefactorMenu_IntroduceParameter
source: Introduce &Parameter
de: Parameter e&inführen

# EncapsulateField_TitleText
source: Encapsulate Field
de: Feld Kapseln

# EncapsulateField_ParameterName
source: Parameter Name:
de: Eigenschaftsname

# RefactorMenu_ExtractInterface
source: E&xtract Interface
de: E&xtrahiere Interface

# RefactorMenu_ImplementInterface
source: &Implement Interface
de: Implementie&re Interface

# EncapsulateField_SetterType
source: Setter Type:
de: Typ für 'Set':

# MoveCloserToUsage_TargetHasNoReferences
source: '{0}' is not used anywhere.
de: '{0}' hat keine Referenzen.

# MoveCloserToUsage_TargetIsUsedInMultipleMethods
source: '{0}' has references in multiple methods.
de: '{0}' hat Referenzen in mehrere Methoden.

# IntroduceField_Caption
source: Rubberduck - Introduce Field
de: Rubberduck - Feld einfügen

# IntroduceParameter_Caption
source: Rubberduck - Introduce Parameter
de: Rubberduck - Parameter einfügen

# IntroduceParameter_PromptIfTargetIsInterface
source: Method '{0}' implements '{1}.{2}'. Change interface signature? (Will propagate to all implementations.)
de: Methode '{0}' implementiert '{1}.{2}'. Ändern der Interface Signatur? (Wird auf alle Implementierungen angewendet.)

# RefactorMenu_MoveCloserToUsage
source: Move Closer To &Usage
de: Näher an die N&utzung verschieben

# MoveCloserToUsage_Caption
source: Rubberduck - Move Closer To Usage
de: Rubberduck - Näher an die Nutzung führen

# EncapsulateField_InstructionText
source: Please specify property name, parameter accessibility, and setter type.
de: Spezifizierung des Eigenschaftsnamen, Parameterverfügbarkeit und 'Setter type' notwendig.

# MoveCloserToUsage_InvalidSelection
source: Invalid Selection.
de: Ungültige Auswahl.

# ImplementInterface_InvalidSelectionMessage
source: The current selection is not valid.
de: Die aktuelle Auswahl ist ungültig.

# ImplementInterface_Caption
source: Rubberduck - Implement Interface
de: Rubberduck - Interface Implementieren

# SettingsCaption_InspectionSettings
source: Code Inspection Settings
de: Einstellungen für die Codeuntersuchung
ja: コード検査設定

# RubberduckMenu_Settings
source: S&ettings
de: &Einstellungen
ja: &e設定

# GeneralSettings_LanguageLabel
source: Display language:
de: Anzeigesprache:
ja: 表示言語

# TestExplorer_QualifiedModuleName
source: Module
de: Modul

# AboutWindow_AttributionsLabel
source: Attributions
de: Beiträge

# AboutWindow_Caption
source: About Rubberduck
de: Über Rubberduck

# AboutWindow_Copyright
source: Â© Copyright 2014-2017 Mathieu Guindon & Christopher McClellan
de: © Copyright 2014-2017 Mathieu Guindon & Christopher McClellan

# AboutWindow_SpecialThanksLabel
source: Special Thanks
de: Spezieller Dank

# SettingsCaption_UnitTestSettings
source: Unit Test Settings
de: Einstellung für die Unit Tests
ja: ユニットテスト設定

# SeverityLabelText
source: Severity:
de: Schweregrad:

# SettingsCaption_IndenterSettings
source: Indenter Settings
de: Einrückungseinstellung
ja: インデント設定

# SettingsInstructions_IndenterSettings
source: Configure indenter settings.
de: Konfiguration der Einrückungseinstellungen

# SettingsInstructions_UnitTestSettings
source: Configure the settings for new unit test modules and methods.
de: Einstellungen für neue Unit Test Module und Methoden

# UnitTestSettings_AssertMode
source: Type safety:
de: Typ-Sicherheit:

# UnitTestSettings_BindingMode
source: Binding mode:
de: Bindungsmodus:

# UnitTestSettings_EarlyBinding
source: Early binding
de: Frühes Binden

# UnitTestSettings_IncludeTestMethodInitCleanupPrompt
source: Test method initialization/cleanup
de: Testmethodeninitialisierung / Leeren

# UnitTestSettings_IncludeTestMethodStubWhenCreatingModulePrompt
source: Insert test method stub
de: Einfügen eine Testmethodenstubs

# UnitTestSettings_IncludeTestModuleInitCleanupPrompt
source: Test module initialization/cleanup
de: Testmodulinitialisierung / Leeren

# UnitTestSettings_LateBinding
source: Late binding
de: Spätes Binden

# UnitTestSettings_PermissiveAssert
source: Permissive assert
de: Tolerante Forderung

# UnitTestSettings_StrictAssert
source: Strict assert
de: Strikte Forderung

# UnitTestSettings_TestModuleTemplateHeader
source: Test Module Template
de: Testmodulvorlage

# TestOutcome_Failed
source: Failed
de: Fehlerhaft

# TestOutcome_Inconclusive
source: Inconclusive
de: Ergebnislos

# TestOutcome_Succeeded
source: Succeeded
de: Erfolgreich

# TestOutcome_Unknown
source: Unknown
de: Unbekannt

# EndOfLineCommentStyle_Absolute
source: Absolute
de: Absolut

# EndOfLineCommentStyle_AlignInColumn
source: Align In Column
de: In Spalten ausrichten

# EndOfLineCommentStyle_SameGap
source: Same Gap
de: Gleicher Abstand

# EndOfLineCommentStyle_StandardGap
source: Standard Gap
de: Standardabstand

# GeneralSettings_HotkeyDescription
source: Description
de: Beschreibung
ja: 記述

# GeneralSettings_HotkeyEnabled
source: Enabled
de: Aktiv
ja: 有効

# IndenterSettings_AlignCommentsWithCode
source: Align comments with code
de: Richte Kommentare am Code aus

# IndenterSettings_AlignContinuations
source: Align continuations
de: Richte Fortsetzung aus

# IndenterSettings_AlignDims
source: Align dims
de: Ausrichtung der Deklarationen

# IndenterSettings_AlignmentOptionsLabel
source: Alignment Options
de: Ausrichtungsoptionen

# IndenterSettings_EnableOptionsLabel
source: Enable Options
de: Optionen freigeben

# IndenterSettings_EnableUndo
source: Enable undo
de: Rückgängig freigeben

# IndenterSettings_EndOfLineCommentStyle
source: End-of-line comment style:
de: Zeilenende Kommentarstil:

# IndenterSettings_ForceCompilerDirectivesToColumn1
source: Force compiler directives to column 1
de: Nutze Kompilerdirektiven in Spalte 1

# IndenterSettings_ForceDebugDirectivesToColumn1
source: Force debug directives to column 1
de: Nutze Debugdirektiven in Spalte 1

# IndenterSettings_IgnoreOperators
source: Ignore operators
de: Ignoriere Operatoren

# IndenterSettings_IndentCase
source: Indent case
de: Rücke 'Case' ein

# IndenterSettings_IndentCompilerDirectives
source: Indent compiler directives
de: Rücke Kompilerdirektiven ein

# IndenterSettings_IndentEntireProcedureBody
source: Indent entire procedure body
de: Rücke gesamten Prozedurblock ein

# IndenterSettings_IndentFirstCommentBlock
source: Indent first comment block
de: Rücke ersten Kommentarblock ein

# IndenterSettings_IndentFirstDeclarationBlock
source: Indent first declaration block
de: Rücke ersten Deklarationsblock ein

# IndenterSettings_IndentOptionsLabel
source: Indent Options
de: Rücke Optionen ein

# IndenterSettings_IndentSpaces
source: Indent spaces:
de: Einrückungsleerzeichen:

# IndenterSettings_SpecialOptionsLabel
source: Special Options
de: Spezielle Optionen

# CodeInspectionResults_GroupByModule
source: By module
de: Nach Modulen

# CodeInspectionResults_GroupByType
source: By inspection type
de: Nach Inspektionstyp

# CodeInspectionResults_Issue
source: Issue
de: Problem

# CodeInspectionResults_Location
source: Location
de: Ort

# CodeInspectionResults_Type
source: Type
de: Typ

# GroupingGrid_GroupingStyle
source: Grouping
de: Gruppierung

# GroupingStyle_ByInspectionType
source: By inspection type
de: Nach Inspektionstyp

# GroupingStyle_ByLocation
source: By location
de: Nach Ort

# GroupingStyle_ByOutcome
source: By outcome
de: Nach Ergebnis

# GeneralSettings_HotkeysLabel
source: Hotkeys:
de: Tastenkürzel:
ja: ショートカットキー

source: Settings
de: Einstellungen

# AboutWindow_AttributionList
source: Parsing powered by ANTLR GitHub integration powered by LibGit2Sharp Syntax highlighting powered by AvalonEdit Native hooks powered by EasyHook Fugue icons by Yusuke Kamiyamane IDE icons from SharpDevelop WPF localization support by Grant Frisken
de: Parsing ermöglicht durch ANTLR GitHub Integration ermöglicht durch LibGit2Sharp Syntaxhervorhebung ermöglicht durch AvalonEdit Native Hooks ermöglicht durch EasyHook Fugue Icons von Yusuke Kamiyamane IDE Icons von SharpDevelop WPF Lokalisierungsunterstützung von Grant Frisken

# SearchResults_Caption
source: Search Results
de: Suchergebnis

# SearchResults_Location
source: Location
de: Ort

# SearchResults_MemberName
source: Member
de: Methode

# SearchResults_ModuleName
source: Module
de: Modul

# SearchResults_Context
source: Context
de: Kontext

# SearchResults_AllImplementationsTabFormat
source: All implementations: '{0}'
de: Alle Vorkommnisse: '{0}'

# SearchResults_AllReferencesTabFormat
source: All references: '{0}'
de: Alle Referenzen: '{0}'

# SearchResults_MemberType
source: Type
de: Typ

# SourceControl_CommitAndPush
source: Commit and Push
de: Commit und Push

# SourceControl_CommitAndSync
source: Commit and Sync
de: Commit und Synchronisieren

# SourceControl_DeleteBranch
source: Delete branch
de: Zweig löschen

# AboutWindow_GeneralThanks
source: All contributors to our GitHub repository All our stargazers, likers & followers, for the warm fuzzies ...and anyone reading this!
de: Allen, die zu unserem GitHub Repositoty beigetragen haben Allen Sternguckern, Likern & Followern, für das warme Kribbeln … und jedem der dies leist.

# SourceControl_BranchName
source: Branch Name:
de: Zweigname:

# SourceControl_LocalDirectoryLabel
source: Local Directory:
de: Lokales Verzeichnis:

# SourceControl_RemotePathLabel
source: Remote Path:
de: Entferntes Verzeichnis:

# SourceControl_FilePath
source: File Path
de: Dateipfad

# SourceControl_FileStatus
source: File Status
de: Dateistatus

# SourceControl_Author
source: Author
de: Autor

# SourceControl_Message
source: Message
de: Nachricht

# SourceControl_Dismiss
source: Dismiss
de: Entfernen

# SourceControl_PasswordLabel
source: Password:
de: Kennwort:

# SourceControl_PublishBranchButton
source: Publish
de: Veröffentlichen

# SourceControl_UnpublishBranchButton
source: Unpublish
de: Nicht veröffentlichen

# SourceControl_SourceBranch
source: Source Branch:
de: Quellzweig:

# SourceControl_LoginInstructions
source: Your last action failed because Rubberduck did not have your authorization credentials. Please login and try again.
de: Die letzte Aktion konnte nicht durchgeführt werden, da Rubberduck nicht die notwendigen Anmeldedaten hatte. Bitte anmelden und die Aktion wiederholen.

# SourceControl_ExcludeFileButton
source: Exclude
de: Ausschließen

# SourceControl_IncludeFileButton
source: Include
de: Einschließen

# SourceControl_UndoChangesButton
source: Undo
de: Rückgängig

# SourceControl_Delete
source: Delete
de: Löschen

# ParserState_Error
source: Parse Error
de: Fehler beim Parsen

# ParserState_LoadingReference
source: Loading references
de: Referenzen werden geladen

# ParserState_Parsed
source: Parsed
de: Fertig analysiert

# ParserState_Pending
source: Pending
de: Wartend

# ParserState_Ready
source: Ready
de: Fertig

# ParserState_ResolverError
source: Resolver Error
de: Fehler beim Auflösen

# AboutWindow_ContributorsHeader
source: Contributors & supporters:
de: Beitragende & Unterstützer:

# SourceControl_MergeStatus
source: Merge status.
de: Status der Zusmmenführung

# SourceControl_UpdateSettingsMessage
source: Your user name, email address, and default repository location have been saved.
de: Der Benutzername, die E-Mail-Adresse und das Standard-Repository-Verzeichnis wurde gesichert.

# SourceControl_UpdateSettingsTitle
source: Settings updated
de: Einstellungen wurden aktualisiert

# SourceControl_NoBranchesMessage
source: Repository does not contain any branches.
de: Repository enthält keine Zweige

# SourceControl_NoBranchesTitle
source: No branches found
de: Keine Zweige gefunden

# RubberduckCommandbarRefreshButtonTooltip
source: Parse all opened projects
de: Parse alle offenen Projekte

# GeneralSettings_HotkeyCtrl
source: Ctrl
de: Strg
ja: Ctrlキー

# HotkeyDescription_IndentModule
source: Indent Module
de: Modul einrücken
ja: モジュールをインデント

# HotkeyDescription_IndentProcedure
source: Indent Procedure
de: Prozedur einrücken
ja: プロシージャをインデント

# GeneralSettings_HotkeyKey2
source: Key2
de: Taste2
ja: 2つ目のきー

# GeneralSettings_HotkeyKey1
source: Key1
de: Taste1
ja: 1つ目のきー

# GeneralSettings_HotkeyShift
source: Shift
de: Umschalt
ja: Shiftキー

# HotkeyDescription_RefactorRename
source: Refactor / Rename
de: Refactor / Umbenennen
ja: 名前の変更

# HotkeyDescription_InspectionResults
source: Code Inspections
de: Codeuntersuchung
ja: コード検査

# HotkeyDescription_RefactorExtractMethod
source: Refactor / Extract Method
de: Refactor / Methode extrahieren
ja: メソッドを抽出

# UnitTest_NewModule_RunOnce
source: this method runs once per module
de: Diese Methode wird einmal pro Modul ausgeführt

# UnitTest_NewModule_RunBeforeTest
source: this method runs before every test in the module
de: Diese Methode wird vor jedem Test ausgeführt.

# UnitTest_NewModule_RunAfterTest
source: this method runs after every test in the module
de: Diese Methode wird nach jedem Test ausgeführt

# UnitTest_NewMethod_Rename
source: Rename test
de: Test umbenennen

# UnitTest_NewMethod_RaisedTestError
source: Test raised an error
de: Test hat diesen Fehler ergeben

# UnitTest_NewMethod_ChangeErrorNo
source: Change to expected error number
de: Auf den Fehlercode des erwarteten Fehlers ändern

# UnitTest_NewMethod_ErrorNotRaised
source: Expected error was not raised
de: Der erwartete Fehler wurde nicht gefunden

# CommonHotkey_InvalidKey
source: Invalid key.
de: Ungültiges Zeichen.

# CommonHotkey_HookDetached
source: Hook is already detached.
de: Hook ist nicht mehr aktiv.

# CommonHotkey_HookAttached
source: Hook is already attached.
de: Hook ist schon hinzugefügt.

# CommonHotkey_KeyNotRegistered
source: Hotkey ({0}) not registered.
de: Hotkey ({0}) ist nicht registriert.

# RubberduckMenu_RegexSearchReplace
source: Rege&x Search/Replace
de: Rege&x Suchen/Ersetzen
ja: &x正規表現の検索置換

# HotkeyDescription_FindSymbol
source: Find symbol
de: Suche Symbol
ja: シンボルを検索

# HotkeyDescription_RefactorMoveCloserToUsage
source: Refactor / Move declaration closer to usage
de: Ziehe die Deklaration näher an die Nutzung.
ja: 宣言へ移動

# HotkeyDescription_ParseAll
source: Refresh parser state
de: Aktualisierung des Parserstatus
ja: パーサーのステートを更新

# GroupingStyle_ByMarker
source: By marker
de: Nach Markierung

# DeclarationType_LibraryProcedure
source: Library procedure
de: Bibliotheksprozedur

# CodeExplorer_AddClassModuleText
source: Class module (.cls)
de: Klassenmodul (.cls)

# CodeExplorer_ShowSignaturesToolTip
source: Toggle signatures
de: Wechsele Signatur

source: Find
de: Suchen

# CodeExplorer_Remove
source: Remove...
de: Entfernen...

# CodeExplorer_Print
source: Print...
de: Drucken...

# CodeExplorer_Import
source: Import...
de: Importieren...

# CodeExplorer_Export
source: Export...
de: Exportieren...

# GeneralSettings_PeriodDelimiter
source: Period (.)
de: Punkte (.)
ja: ピリオド「 . 」

# GeneralSettings_FolderDelimiterLabel
source: Folder Delimiter:
de: Ordner-Trennzeichen:
ja: フォルダ デリミタ

# GeneralSettings_SlashDelimiter
source: Slash (/)
de: Schrägstrich (/)
ja: スラッシュ「 / 」

# SourceControl_MissingCredentials
source: Missing credentials.
de: Fehlende Zugangsdaten

# SourceControl_CommitStatus_CommitAndSyncSuccess
source: Commit and sync succeeded.
de: Commit und Synchronisation erfolgreich.

# SourceControl_CommitStatus_CommitSuccess
source: Commit succeeded.
de: Commit erfolgreich.

# SourceControl_CommitStatus_CommitAndPushSuccess
source: Commit and push succeeded.
de: Commit und Push erfolgreich.

# CodeExplorer_Sort
source: Sort
de: Sortieren

# NoIndentAnnotation
source: &Add '@NoIndent
de: Füge '@&NoIndent hinzu

# SourceControl_UndoTitle
source: Source Control - Undo
de: Versionskontrolle - Rückgänig

# SourceControl_UndoPrompt
source: Do you want to undo your changes to {0}?
de: Sollen die Änderungen in {0} rückgängig gemacht werden?

# CodeExplorer_Undo
source: Undo...
de: Rückgängig ...

# TestOutcome_Ignored
source: Ignored
de: Ingoriert

# UnitTest_TotalDuration
source: Total Duration
de: Gesamtdauer

# Parser_ParserError
source: Parser Errors
de: Parserfehler

# GeneralSettings_MinimumLogLevelLabel
source: Minimum Log Level:
de: Minimale Logging-Empfindlichkeit
ja: 最小のログレベル

# GeneralSettings_DebugLogLevel
source: Debug
de: Debugging
ja: デバッグ

# GeneralSettings_ErrorLogLevel
source: Error
de: Fehler
ja: エラー

# GeneralSettings_InfoLogLevel
source: Info
de: Informationen
ja: 情報

# GeneralSettings_OffLogLevel
source: No Logging
de: Kein Logging
ja: なし

# GeneralSettings_TraceLogLevel
source: Trace
de: Spuren
ja: トレース

# GeneralSettings_WarnLogLevel
source: Warn
de: Warnung
ja: 警告

# GeneralSettings_ShowLogFolder
source: Show Log Folder
de: Logging-Ordner anzeigen
ja: ロギングフォルダを開く

# CodeExplorer_CopyToolTip
source: Copy to clipboard
de: In Zwischenablage kopieren

# SourceControl_PublishRepo_FailureTitle
source: Publish repository.
de: Veröffentliche Repository

# SourceControl_PublishRepo_NoOpenRepo
source: No open repository to push to specified remote location.
de: Kein geöffnetes Repository verfügbar, um es auf den Remote-Pfad zu veröffentlichen

# SourceControl_ExternalModifications
source: A source file was modified out of the editor; reload it?
de: Eine Quelldatei wurde außerhalb des VBA-Editors geändert. Soll Rubberduck diese nachladen?

# SourceControl_OpenCommandPromptFailureTitle
source: Failure opening command prompt
de: Fehler beim öffnen der Eingabeaufforderung

# SourceControl_FileStatus_Unaltered
source: Unaltered
de: Unverändert

# SourceControl_FileStatus_Missing
source: Missing
de: Fehlt

# SourceControl_FileStatus_RenamedInWorkDir
source: Renamed in working directory
de: Im Arbeitsverzeichnis umbenannt

# SourceControl_PublishRepositoryDescription
source: Publishes an existing repository to a remote location. The active project must be connected to a repository.
de: Veröffentlicht ein existierendes Repository zu einem entfernten Repository. Das offene Projekt muss dazu mit einem Repository verbunden sein.

# SourceControl_FilePickerDefaultRepoHeader
source: Default Repository Directory
de: Standard Repository-Pfad
