Repository: rubberduck-vba/Rubberduck
Catalog: RetailCoder.VBE/UI/RubberduckUI.*.resx
Languages: de, ja, sv

# SourceControl_UnknownErrorMessage
source: If logging is enabled, you may create an issue on our GitHub page with the contents of your log file in '%AppData%\Roaming\Rubberduck\Logs' for support.
de: Bitte setzen Sie die Logging-Empfindlichkeit auf Fatal oder niedriger und erstellen Sie ein Ticket auf unserer GitHub-Seite mit dem Inhalt Ihrer Logdatei in C:\Users\{username}\AppData\Roaming\Rubberduck\Logs.

# SourceControl_FileStatus_Unreadable
source: Unreadable
de: Unlesbar

# SourceControl_FileStatus_RenamedInIndex
source: Renamed in index
de: Im Index umbenannt

# SourceControl_FileStatus_Staged
source: Staged
de: Vorgemerkt

# SourceControl_FileStatus_Untracked
source: Untracked
de: Nicht verfolgt

# SourceControl_CommandPromptExeLabel
source: Command prompt executable location
de: Speicherort der Eingabeaufforderung (cmd.exe / powershell.exe)

# SourceControl_CloneRepositoryTitle
source: Clone Remote Repository
de: Klone entferntes Repository

# CodeExplorer_OpenProjectProperties
source: Project properties
de: Projekteigenschaften öffnen

# SourceControl_NoActiveProject
source: No active project
de: Kein aktives VBProject

# SourceControl_ActivateProject
source: Please open or activate a project and try again.
de: Bitte öffnen oder aktivieren Sie ein Projekt und versuchen Sie es erneut.

# SourceControl_PublishRepositoryTitle
source: Publish Existing Repository
de: Existierendes Repository Veröffentlichen

# SourceControl_FileStatus_Ignored
source: Ignored
de: Ignoriert

# SourceControl_UnknownErrorTitle
source: An unknown error occurred.
de: Ein unbekannter Fehler ist aufgetreten.

# SourceControl_OpenCommandPromptButtonToolTip
source: Open Command Prompt
de: Eingabeaufforderung öffnen

# SourceControl_FileStatus_Removed
source: Removed
de: Gelöscht

# ParserState_ResolvingReferences
source: Resolving references...
de: Löse Referenzen auf...

# SourceControl_FileStatus_TypeChanged
source: Type changed
de: Typ geändert

# SourceControl_FilePickerCommandPromptHeader
source: Command Prompt Executable
de: Eingabeaufforderung

# SourceControl_FileStatus_Nonexistent
source: Nonexistent
de: Nicht Vorhanden

# SourceControl_FileStatus_Modified
source: Modified
de: Geändert

# SourceControl_ManageRepositories
source: Manage
de: Verwalten

# SourceControl_FileStatus_StagedTypeChange
source: Staged type change
de: Änderung der Vormerkung

# ParserState_ResolvingDeclarations
source: Resolving declarations...
de: Löse Deklarationen auf...

# SourceControl_FileStatus_Added
source: Added
de: Hinzugefügt

# RubberduckFatalError
source: Rubberduck encountered an error. Please save your work and restart the host program; if logging is enabled, you can upload your log file located at '%AppData%Roaming\Rubberduck\Logs\RubberduckLog.txt' to a GitHub issue at 'https://github.com/rubberduck-vba/Rubberduck/issues/new' and report the bug.
de: In Rubberduck ist ein Fehler aufgetreten. Bitte speichern Sie Ihre Arbeit und starten Sie das Hostprogramm neu. Laden Sie dann Ihre Logdatei zu unserer GitHub-Seite hoch.

# ToolsMenu_SourceControl
source: &Source Control
de: Version&skontrolle

# RegexAssistant_NoPatternError
source: (no pattern)
de: (kein Ausdruck gegeben)

# TestExplorerMenu_AddTestModule
source: Test M&odule
de: Testm&odul

# RegexAssistant_Caption
source: Rubberduck - Regex Analyzer
de: Rubberduck - Regexassistent

# ToolsMenu
source: T&ools
de: &Werkzeuge

# ToolsMenu_RegexAssistant
source: Regex &Assistant
de: Regex&assistent

# RegexAssistant_Title
source: Regular Expression Analyzer
de: Assistent für Reguläre Ausdrücke

# CodeInspectionSettings_WhitelistedIdentifiersLabel
source: Whitelisted Identifiers
de: Explizit erlaubte Namen

# ToolsMenu_TodoItems
source: To&Do Items
de: To&Do Liste

# RegexAssistant_Instructions
source: Enter a regular expression to analyze in the box below.
de: Einen Regulären Ausdruck zur Analyse in die Box unten eingeben.

# TestExplorerMenu_AddTestMethod
source: Test &Method
de: Test&methode

# RegexAssistant_IgnoreCaseFlag
source: Ignore case
de: Ignoriere Groß-/Kleinschreibung

# HotkeyDescription_SourceControl
source: Source Control
de: Versionskontrolle

# TestExplorerMenu_AddExpectedErrorTestMethod
source: Test Method (&Expected Error)
de: Testmethode (&erwartet Fehler)

# CodeInspectionSettings_WhitelistedIdentifiersDescription
source: These identifiers will be ignored by the 'Use meaningful names' inspection
de: Diese Namen werden von der Inspektion "Nutze aussagekräftige Namen" ignoriert.

# CodeInspectionSettings_InspectionSeveritySettingsLabel
source: Inspection Severities
de: Inspektionsschwere

# RegexAssistant_DescriptionResultsLabel
source: Description
de: Beschreibung

# CodeExplorer_Indent
source: Indent
de: Einrücken

# RegexAssistant_RegexPatternLabel
source: Pattern
de: Ausdruck

# IndenterSettings_IndentEnumTypeAsProcedure
source: Indent comments in Enum and Type blocks like in procedures
de: Kommentare in Enums und Typen wie in Prozeduren einrücken

# CodeInspectionSettings_Misc_RunInspectionsOnSuccessfulParse
source: Run inspections automatically on successful parse
de: Inspektionen nach erfolgreichem Parsen automatisch starten

# RubberduckReloadFailure_Title
source: Rubberduck will not reload
de: Rubberduck wird nicht neu geladen

# GeneralSettings_ShowSplash
source: Show splash screen at startup
de: Ein Startlogo zu Beginn zeigen

# HotkeyDescription_RefactorEncapsulateField
source: Refactor / Encapsulate Field
de: Refactor / Feld kapseln

# CodeExplorer_CollapseSubnodesToolTip
source: Collapse node and all child nodes
de: Knoten und alle Kindknoten einklappen

# CodeInspectionSettings_Misc
source: Miscellaneous
de: Verschiedenes

# CodeExplorer_ExpandSubnodesToolTip
source: Expand node and all child nodes
de: Knoten und alle Kindknoten aufklappen

# RubberduckReloadFailure_Message
source: Toolwindows were not correctly destroyed and/or could not be recreated; the VBE may not be in a stable state. Rubberduck will load normally next time the VBE is initialized.
de: Werkzeugfenster wurden nicht korrekt entfernt und/oder konnten nicht wieder hergestellt werden; Die VBE könnte instabil sein. Rubberduck wird beim nächsten Start der VBE normal laden.

# IndenterSettings_PreviewCode
source: Public Enum ExampleEnum ' Enum comment. Foo Bar ' Member comment. End Enum ' Example Procedure Sub ExampleProc() ' SMART INDENTER ' Original VB6 code graciously offered to Rubberduck by Stephen Bullen & Rob Bovey ' Â© 2016 by Rubberduck VBA. Dim count As Integer Static name As String If YouLikeRubberduck Then ' Star us on GitHub http://github.com/rubberduck-vba/Rubberduck ' Follow us on Twitter @rubberduckvba ' Visit http://rubberduckvba.com for news and updates Select Case X Case "A" ' If you have any comments or suggestions, _ or find valid VBA code that isn't indented correctly, #If VBA6 Then MsgBox "Contact contact@rubberduck-vba.com" #End If Case "Continued strings and parameters can be" _ & "lined up for easier reading, optionally ignoring" _ & "any operators (&+, etc) at the start of the line." Debug.Print "X<>1" End Select 'Case X End If 'More Tools? Suggestions http://github.com/rubberduck-vba/Rubberduck/Issues/New End Sub
de: Public Enum BeispielEnum ' Enum Kommentar. Foo Bar ' Member-Kommentar. End Enum ' Beispielprozedur Sub BeispielProc() ' SMART INDENTER ' Der originale VB6-Code wurde Rubberduck gnädigerweise von Stephen Bullen & Rob Bovey angeboten ' © 2016 by Rubberduck VBA. Dim zaehler As Integer Static name As String If SieMoegenRubberduck Then ' Einen Stern auf GitHub geben: http://github.com/rubberduck-vba/Rubberduck ' Auf Twitter folgen @rubberduckvba ' http://rubberduckvba.com für Neuigkeiten und Aktualisierungen Select Case X Case "A" ' Falls sie Kommentare oder Vorschläge haben, _ oder validen VBA code gefunden haben, der nicht korrekt eingerückt wird, #If VBA6 Then MsgBox "Kontaktieren Sie contact@rubberduck-vba.com" #End If Case "Fortgeführte Strings und Parameter können" _ & "zur Lesbarkeit aufgereiht werden. Optional können" _ & "beliebige Operatoren (&+, usw.) am Zeilenbeginn ignoriert werden." Debug.Print "X<>1" End Select 'Case X End If 'Mehr Werkzeuge? Vorschläge an http://github.com/rubberduck-vba/Rubberduck/Issues/New End Sub

# ParserErrorToolTipText
source: {0} module(s) failed to parse; click for details.
de: {0} Modul(e) konnten nicht geparsed werden; Klicken Sie für Details.

# ReparseToolTipText
source: {0}. Click to refresh.
de: {0}. Klicken zum aktualisieren.

# ContextReferences
source: references
de: Referenzen

# DialogCaption_SaveInspectionSettings
source: Save Inspection Settings
de: Einstellungen für Inspektionen speichern

# DialogCaption_SaveToDoSettings
source: Save Todo List Settings
de: Einstellungen für Todo-Liste speichern

# DialogMask_XmlFilesOnly
source: XML file (.xml)|*.xml|Rubberduck config file|*.config
de: XML Datei (.xml)|*.xml|Rubberduck config file|*.config

# DialogCaption_SaveGeneralSettings
source: Save General Settings
de: Allgemeine Einstellungen speichern

# DialogCaption_LoadToDoSettings
source: Load Todo List Settings
de: Einstellungen für Todo-Liste Laden

# DialogCaption_SaveUnitTestSettings
source: Save Unit Test Settings
de: Einstellungen für Unit-Tests speichern

# DialogCaption_LoadUnitTestSettings
source: Load Unit Test Settings
de: Einstellungen für Unit-Tests laden

# DialogCaption_LoadInspectionSettings
source: Load Inspection Settings
de: Einstellungen für Inspektionen laden

# SettingsCaption_ExportSettings
source: Export
de: Exportieren

# DialogCaption_SaveIndenterSettings
source: Save Indenter Settings
de: Einstellungen für Einrückung speichern

# DialogCaption_LoadIndenterSettings
source: Load Indenter Settings
de: Einstellungen für Einrückung laden

# DialogCaption_LoadGeneralSettings
source: Load General Settings
de: Allgemeine Einstellungen Laden

# SettingsCaption_ImportSettings
source: Import
de: Importieren

# SmartIndenter_LegacySettingPrompt
source: Smart Indenter settings were found in your registry. Would you like to import them to Rubberduck?
de: Einstellungen für Smart Indenter wurden in der Registry gefunden. Möchten sie die Einstellungen in Rubberduck importieren?

# GeneralSettings_CheckVersion
source: Check if a newer version is available at startup
de: Beim Start prüfen, ob eine neuere Version verfügbar ist.

# AssignedByValParamQFixDialog_TitleText
source: Specify Local Copy Variable Name
de: Variablenname der Lokalen Kopie festlegen

# IndenterSettings_CodeSampleHeader
source: Indented Code Sample
de: Eingerücktes Codebeispiel

# DialogCaption_LoadWindowSettings
source: Load Window Settings
de: Fenstereinstellungen laden

# SettingsInstructions_WindowSettings
source: Configure the settings for window visibility.
de: Die Einstellungen für Fenstersichtbarkeit anpassen.

# AssignedByValParamQFixDialog_InstructionsLabelText
source: Please specify a name to use for the local copy of ByVal {0} '{1}'
de: Bitte geben Sie einen Namen für die lokale Kopie von ByVal {0} '{1}'

# IndenterSettings_VerticalSpacing
source: Maintain vertical spacing
de: Vertikalen Abstand aufrecht erhalten

# IndenterSettings_VerticalSpacingLabel
source: Vertical Spacing
de: Vertikalen Abstand

# DialogCaption_SaveWindowSettings
source: Save Window Settings
de: Fenstereinstellungen speichern

# DeclarationType_BracketedExpression
source: runtime expression
de: Laufzeitausdruck

# AssignedByValParamQFixDialog_Caption
source: Assigned ByVal parameter QuickFix - Make Local Copy
de: ByVal zugewiesener Parameter QuickFix - Lokale Kopie erstellen

# WindowSettings_StartupVisibilityHeader
source: Window visibility at startup
de: Fenstersichtbarkeit beim Start

# VersionCheck_NewVersionAvailable
source: Rubberduck version {0} is now available! Would you like to review the release notes now?
de: Rubberduck Version {0} ist jetzt verfügbar! Wollen sie jetzt die Release Notes prüfen?

# SettingsCaption_WindowSettings
source: Window Settings
de: Fenstereinstellungen

# AssignedByValDialog_NewNameAlreadyUsedFormat
source: '{0}' is already accessible to this scope.
de: '{0}' ist in diesem Kontext bereits verfügbar.

# AssignedByValDialog_ReservedKeywordFormat
source: '{0}' is a reserved keyword.
de: '{0}' ist ein reserviertes Schlüsselwort.

# RenameDialog_AmbiguousSelection
source: Please ensure that exactly 1 control is selected before renaming.
de: Bitte stellen Sie zur Umbenennung sicher, dass genau ein Control-Objekt ausgewählt ist.

# ContextMultipleControlsSelection
source: multiple controls
de: Mehrere Schaltflächen

# AssignedByValDialog_InvalidCharacters
source: Variable names cannot contain special characters other than underscores.
de: Variablennamen können keine Sonderzeichen außer Unterstrich enthalten.

# AssignedByValDialog_IsByValIdentifierFormat
source: The local variable cannot be the same as the '{0}' parameter it replaces
de: Die lokale Variable kann nicht das gleiche wie der '{0}' Parameter, den sie ersetzt sein.

# AssignedByValDialog_QuestionableEntryFormat
source: The identifier '{0}' will trigger a "Use meaningful name" inspection result. Consider choosing a different name.
de: Der Name '{0}' wird die "Sinnige Namen verwenden"-Inspektion auslösen. Überlegen Sie, einen anderen Namen zu wählen.

# ConfirmRemoveAssignmentWithUnusedDeclaration
source: Variable '{0}' is assigned. Remove assignment instruction(s)?
de: Variable '{0}' ist zugewiesen. Zuweisung(en) entfernen?

# AssignedByValDialog_DoesNotStartWithLetter
source: Variable names must begin with a letter.
de: Variablennamen müssen mit einem Buchstaben beginnen.

# RenameDialog_InterfaceRenameError
source: Could not rename Interface Member {0}.
de: Konnte Interfacemitglied {0} nicht umbenennen.

# Assert_NeitherParameterIsArray
source: Neither [expected] or [actual] is an array.
de: Weder [Erwartet] noch [Tatsächlich] ist ein Array.

# Assert_UnexpectedArrayFormat
source: [expected] and [actual] are arrays. Consider using {0}.
de: [Erwartet] und [Tatsächlich] sind Arrays. Erwägen Sie eine Benutzung von {0}.

# Assert_ReferenceValueMismatch
source: [expected] is a reference type and [actual] is a value type.
de: [Erwartet] ist ein Referenztyp und [Tatsächlich] ist ein Werttyp.

# Assert_GenericException
source: Unexpected exception while running tests.
de: Unerwarteter Fehler beim Ausführen der Tests.

# Assert_UBoundMismatchFormat
source: Dimension {0}: expected has a UBound of {1}; actual has a UBound of {2}. {3}
de: Dimension {0}: Erwarteter UBound-Wert {1}; Tatsächlicher UBound-Wert {2}. {3}

# Assert_FailedMessageFormat
source: {0} assertion failed. {1}
de: {0} Prüfung fehlgeschlagen. {1}

# Assert_UnexpectedNullArraysFormat
source: [expected] and [actual] are Nothing. Consider using {0}.
de: [Erwartet] und [Tatsächlich] sind Nothing. Erwägen Sie eine Benutzung von {0}.

# Assert_UnexpectedValueComparisonFormat
source: [expected] and [actual] are value types. Consider using {0}.
de: [Erwartet] und [Tatsächlich] sind Werttypen. Erwägen Sie eine Benutzung von {0}.

# Assert_ComException
source: Unexpected COM exception while running tests.
de: Unerwarteter Fehler in der COM Schnittstelle bei der Ausführung der Tests.

# TestExplorer_RunInconclusiveTests
source: Inconclusive Tests
de: Nicht aussagekräftige Tests

# Assert_UnexpectedReferenceComparisonFormat
source: [expected] and [actual] are reference types. Consider using {0}.
de: [Erwartet] und [Tatsächlich] sind Referenztypen. Erwägen Sie eine Benutzung von {0}.

# RefactorRename_TargetNotUserDefinedError
source: Identifier {0} cannot be renamed.
de: Bezeichner {0} kann nicht umbenannt werden.

# Assert_EasterEggIVerifyPassed
source: IVerify too.
de: I verifizier au.

# RefactorRename_TargetNotDefinedError
source: Unable To Detect Selected Rename Target
de: Kann gewähltes Ziel für Umbenennung nicht erkennen.

# Assert_InvalidFakePassThrough
source: Invalid setup of IFake {0}. PassThrough property must be False.
de: Aufgesetztes IFake-Objekt {0} ist nicht valide. PassThrough muss False sein.

# Assert_EasterEggAssertClassPassed
source: OK, Rubberduck asserted. Now what?
de: OK. Rubberduck hat etwas geprüft. Und jetzt?

# Assert_DimensionMismatchFormat
source: expected has {0} dimensions; actual has {1} dimensions. {2}
de: Gesuchter Wert hat {0} Dimensionen; Tatsächlicher Wert hat {1} Dimensionen. {2}

# Assert_VerifyParameterNonNumeric
source: Parameter {0} was not a numeric value on invocatoin {1}. {2}
de: Parameter {0} hatte beim Aufruf keinen numerischen Wert {1}. {2}

# Assert_VerifyNoInvocationFormat
source: No matching invocation for parameter {0}; Only {1} invocations. {2}
de: Kein passender Aufruf für Parameter {0}; Nur {1} Aufrufe. {2}

# Assert_VerifyInternalErrorMessage
source: Rubberduck could not process the invocation results.
de: Rubberduck konnte das Ergebnis des Aufrufs nicht verarbeiten.

# Assert_VerifyParameterNotPassed
source: Parameter {0} was not passed on invocation {1}. {2}
de: Parameter {0} wurde beim Aufruf nicht übergeben {1}. {2}

# Assert_ParameterIsNotArrayFormat
source: {0} is not an array.
de: {0} ist kein Array.

# Assert_MismatchedTypes
source: [expected] and [actual] values are not the same type.
de: [Erwartet] und [Tatsächlich] Werte sind von verschiedenem Typ.

# Assert_LBoundMismatchFormat
source: Dimension {0}: expected has an LBound of {1}; actual has an LBound of {2}. {3}
de: Dimension {0}: Erwarteter LBound-Wert {1}; Tatsächlicher LBound-Wert {2}. {3}

# Assert_NotImplemented
source: Not implemented.
de: Nicht implementiert.

# Assert_ValueReferenceMismatch
source: [expected] is a value type and [actual] is a reference type.
de: [Erwartet] ist ein Werttyp und [Tatsächlich] ist ein Referenztyp.

# Assert_ParameterResultFormat
source: Expected: {0}; Actual: {1}. {2}
de: Erwartet: {0}; Tatsächlich: {1}. {2}

# RenameDialog_DefaultRenameError
source: Coult not rename {0}.
de: Konnte {0} nicht umbenennen.

# Assert_EasterEggIFakePassed
source: Expected: Stack overflow?; Actual: Guard clause.
de: Erwartet: Stacküberlauf?; Tatsächlich: Schutzbedingung.

source: Preview
de: Vorschau

# SourceControl_InitializeRepositoryTitle
source: Initialize New Repository
de: Neues lokales Repository erstellen.

# SourceControl_InitializeRepositoryDescription
source: Creates a new repository from the active project.
de: Erstellt aus dem aktiven Projekt ein neues lokales Repository.

# SourceControl_CloneRepositoryDescription
source: Clones remote repository from provided URI. Have an (empty) project active in the editor.
de: Ein entferntes Repository von einer anzugebenden URL auf die lokale Festplatte klonen. Das Repository wird anschließend in das aktive Projekt geladen.

# SourceControl_OpenRepositoryTitle
source: Open Existing Repository
de: Lokales Repository öffnen

# CodeExplorer_AddFormText
source: User form (.frm)
de: Formular (.frm)
ja: &fユーザーフォーム
sv: Användar&formulär

# SourceControl_OpenRepositoryDescription
source: Open repository from disk. The active project will host the source code.
de: Lokales Repository auf der Festplatte öffnen. Das aktive Projekt wird den Quellcode übernehmen.

# DeclarationType_Event
source: event
ja: イベント
sv: händelse

# DeclarationType_Parameter
source: parameter
ja: パラメーター

# DeclarationType_Variable
source: variable
ja: 変数
sv: variabel

# RenameDialog_ProjectRenameError
source: Could not rename project.
ja: オブジェクト名を変更出来ませんでした。
sv: Kunde inte byta namn på projektet.

# RenameDialog_ModuleRenameError
source: Could not rename module.
ja: モジュール名を変更出来ませんでした。
sv: Kunde inte byta namn på modul.

# DeclarationType_Enumeration
source: enum
ja: 列挙型

# NameLabelText
source: Name:
ja: 名前:
sv: Namn:

# TodoSettings_Text
source: Text
ja: テキスト

# TodoSettings_TextLabel
source: Text:
ja: テキスト：

# CodeInspectionSeverity_Warning
source: Warning
ja: 警告
sv: Varning

# CodeInspectionSeverity_Hint
source: Hint
ja: ヒント
sv: Tips

# CodeInspectionSeverity_Error
source: Error
ja: エラー
sv: Fel

# CodeInspectionSeverity_DoNotShow
source: Do Not Show
ja: 非表示
sv: Visa Inte

# CodeInspectionSeverity_Suggestion
source: Suggestion
ja: 提案」
sv: Förslag

# Rubberduck_AboutBuild
source: Version {0}
ja: 「0」（「1」）をビルド
sv: Version {0} ({1})

source: Name
ja: 名称
sv: Namn

source: Offline
ja: オフライン

source: Online
ja: オンライン

source: Parameter
ja: パラメーター

# TestExplorerWindow_Caption
source: Test Explorer
ja: テストエクスプローラー
sv: Testutforskare

# CodeInspectionSettings_CodeQualityIssues
source: Code Quality Issues
ja: コード品質問題
sv: Problem med kodkvalitet

# TodoSettings_Caption
source: TODO Explorer
ja: TODOエクスプローラー
sv: "TODO" markörer

# CodeExplorerDockablePresenter_Caption
source: Code Explorer
ja: コードエクスプローラー
sv: Kodutforskare

# SourceControl_Commit
source: Commit
ja: コミット
sv: Commita

# RubberduckMenu_CodeExplorer
source: &Code Explorer
ja: &Cコードエクスプローラー
sv: Kod &utforskare

# RubberduckMenu_UnitTests
source: Unit &Tests
ja: &Tユニットテスト
sv: Enhets&tester

# TestMenu_TextExplorer
source: &Test Explorer
ja: &Tテストエクスプローラー
sv: Test&utforskare

source: Navigation
ja: ナビゲーション

# CodeInspectionSettings_LanguageOpportunities
source: Language Opportunities
ja: 言語チャンス
sv: Språkmöjligheter

# CodeInspectionSettings_MaintainabilityAndReadabilityIssues
source: Maintainability and Readability Issues
ja: 保守性と読みやすさに関する問題
sv: Problem med läsbarhet och underhållning

# HotkeyDescription_CodeExplorer
source: Code Explorer
ja: コードエクスプローラ

# GeneralSettings_HotkeyAlt
source: Alt
ja: Altキー

# HotkeyDescription_TestExplorer
source: Test Explorer
ja: テストエクスプローラ

# GeneralSettings_FatalLogLevel
source: Fatal
ja: 致命的

# ExtractMethod_SetBoxLabel
source: Set
sv: Sätt
