Repository: rubberduck-vba/Rubberduck
Catalog: Rubberduck.Resources/Settings/SettingsUI.*.resx
Languages: cs, de, fr, it

# ConfirmResetSettings
source: Reset settings to default configuration?
cs: Resetovat nastavení na původní konfiguraci?
de: Einstellungen auf Standardkonfiguration zurücksetzen?
fr: Réinitialiser les paramètres par défaut?
it: Riportare le impostazioni alla configurazione di default?

# ExportPageSettingsButton
source: Export
cs: Exportovat
de: Exportieren
fr: Exporter
it: Esporta

# ImportPageSettingsButton
source: Import
cs: Importovat
de: Importieren
fr: Importer
it: Importa

# PageHeader_GeneralSettings
source: General Settings
cs: Nastavení Obecná
de: Allgemeine Einstellungen
fr: Options générales
it: Impostazioni Generali

# PageHeader_IndenterSettings
source: Indenter Settings
cs: Nastavení Odsazování
de: Einrückungseinstellung
fr: Indentation
it: Impostazioni di Indentazione

# PageHeader_InspectionSettings
source: Code Inspection Settings
cs: Nastavení Inspekce Kódu
de: Einstellungen für die Codeuntersuchung
fr: Inspections
it: Impostazioni di Ispezione del Codice

# PageHeader_TodoSettings
source: Todo Settings
cs: Nastavení Todo
de: Todo Einstellungen
fr: Commentaires "todo"
it: Impostazioni Todo

# PageHeader_UnitTestSettings
source: Unit Test Settings
cs: Nastavení Unit Testů
de: Einstellung für die Unit Tests
fr: Tests unitaires
it: Impostazioni Unit Test

# PageHeader_WindowSettings
source: Window Settings
cs: Nastavení Oken
de: Fenstereinstellungen
fr: Paramètres des fenêtres
it: Impostazioni Finestra

# PageInstructions_AutoCompleteSettings
source: Configure which autocompletions are enabled.
cs: Konfigurovat nastavení pro povolení individuálních automatických doplňování.
de: Konfigurieren Sie, welche Autovervollständigungen aktiviert sind.
fr: Activer ou désactiver les autocomplétions.
it: Configura quali Completamenti Automatici sono abilitati.

# PageInstructions_GeneralSettings
source: Click [{0}] to close the window and apply changes, or [{1}] to discard them.
cs: Klikněte [{0}] pro uzavření okna a aplikování změn, nebo [{1}] pro jejich zrušení.
de: [{0}] zum Schließen und Speichern oder [{1}] zum Verwerfen der Änderungen klicken.
fr: Cliquez [{0}] pour appliquer les modifications, ou [{1}] pour conserver la configuration actuelle.
it: Clicca [{0}] per chiudere la finestra e applicare le modifiche, o [{1}] per annullarle.

# PageInstructions_IndenterSettings
source: Configure indenter settings.
cs: Konfigurovat nastavení odsazování kódu.
de: Konfiguration der Einrückungseinstellungen.
fr: Configuration des options d'indentation.
it: Configura le impostazioni di indentazione.

# PageInstructions_InspectionSettings
source: Configure inspection severity. Use "DoNotShow" to disable an inspection.
cs: Konfigurovat různé závažnosti inspekcí. Použijte "Neukazovat" pro zakázání inspekce.
de: Konfiguriere Untersuchungssensitivität. Zum Deaktivieren einer Untersuchungsart "Nicht anzeigen" auswählen.
fr: Configuration des niveaux de sévérité des inspections. Utiliser "DoNotShow" pour désactiver une inspection.
it: Configura la gravità di ispezione. Usare "Non mostarare" per disabilitare un'ispezione.

# PageInstructions_TodoSettings
source: Configure markers to be recognized in comments.
cs: Konfigurovat klíčová slova, která mají být rozpoznána v komentářích kódu.
de: Zu erkennende Markierungen in Kommentaren konfigurieren.
fr: Configuration des marqueurs à reconnaître dans les commentaires.
it: Configura i marcatori da riconoscere nei commenti.

# PageInstructions_UnitTestSettings
source: Configure the settings for new unit test modules and methods.
cs: Konfigurovat nastavení pro všechny nové Unit Test moduly a metody.
de: Einstellungen für neue Unit Test Module und Methoden.
fr: Configuration du contenu des nouveaux modules et méthodes de test.
it: Configura le impostazioni dei nuovi moduli e metodi di Unit Test.

# PageInstructions_WindowSettings
source: Configure the settings for window visibility.
cs: Konfigurovat nastavení pro viditelnost okna.
de: Die Einstellungen für Fenstersichtbarkeit anpassen.
fr: Configurer la visibilité des fenêtres.
it: Configura le impostazioni di visibilità della finestra.

# ResetSettingsButton
source: Reset
cs: Resetovat
de: Zurücksetzen
fr: Réinitialiser
it: Reimposta

# SelectAll
source: All
cs: Všechno
de: Alle
fr: Tous
it: Tutto

# Settings_Caption
source: Rubberduck Settings
cs: Rubberduck Nastavení
de: Rubberduck Einstellungen
fr: Configuration de Rubberduck
it: Impostazioni di Rubberduck

# PageHeader_AutoCompleteSettings
source: Autocompletion Settings
cs: Nastavení Automatického Doplňování
de: Einstellungen der automatischen Vervollständigung
fr: Autocomplétion
it: Impostazioni di Completamento Automatico

# DialogCaption_LoadGeneralSettings
source: Load General Settings
cs: Načíst Obecná Nastavení
de: Allgemeine Einstellungen Laden
fr: Charger les paramètres généraux
it: Carica Impostazioni Generali

# DialogCaption_LoadIndenterSettings
source: Load Indenter Settings
cs: Načíst Nastavení Odsazovače
de: Einstellungen für Einrückung laden
fr: Charger les paramètres d'indentation
it: Carica Impostazioni di Indentazione

# DialogCaption_LoadInspectionSettings
source: Load Inspection Settings
cs: Načíst Nastavení Inspekcí
de: Einstellungen für Inspektionen laden
fr: Charger les paramètres d'inspections
it: Carica Impostazioni di Ispezione

# DialogCaption_LoadToDoSettings
source: Load Todo List Settings
cs: Načíst Nastavení Todo
de: Einstellungen für Todo-Liste Laden
fr: Charger les paramètres "TODO"
it: Carica Impostazioni per Lista Todo

# DialogCaption_LoadUnitTestSettings
source: Load Unit Test Settings
cs: Načíst Nastavení Unit Testů
de: Einstellungen für Unit-Tests laden
fr: Charger les paramètres des tests unitaires
it: Carica Impostazioni di Unit Test

# DialogCaption_LoadWindowSettings
source: Load Window Settings
cs: Načíst Nastavení Okna
de: Fenstereinstellungen laden
fr: Charger les paramètres des fenêtres
it: Carica Impostazioni della Finestra

# DialogCaption_SaveGeneralSettings
source: Save General Settings
cs: Uložit Obecná Nastavení
de: Allgemeine Einstellungen speichern
fr: Enregistrer les paramètres généraux
it: Salva Impostazioni Generali

# DialogCaption_SaveIndenterSettings
source: Save Indenter Settings
cs: Uložit Nastavení Odsazovače
de: Einstellungen für Einrückung speichern
fr: Enregistrer les paramètres d'indentation
it: Salva Impostazioni di Indentazione

# DialogCaption_SaveInspectionSettings
source: Save Inspection Settings
cs: Uložit Nastavení Inspekcí
de: Einstellungen für Inspektionen speichern
fr: Enregistrer les paramètres d'inspections
it: Salva Impostazioni di Ispezione

# DialogCaption_SaveToDoSettings
source: Save Todo List Settings
cs: Uložit Nastavení ToDo
de: Einstellungen für Todo-Liste speichern
fr: Enregistrer les paramètres "TODO"
it: Salva Impostazioni per Lista Todo

# DialogCaption_SaveUnitTestSettings
source: Save Unit Test Settings
cs: Uložit Nastavení Unit Testů
de: Einstellungen für Unit-Tests speichern
fr: Enregistrer les paramètres des tests unitaires
it: Salva Impostazioni di Unit Test

# DialogCaption_SaveWindowSettings
source: Save Window Settings
cs: Uložit Nastavení Okna
de: Fenstereinstellungen speichern
fr: Enregistrer les paramètres des fenêtres
it: Salva Impostazioni della Finestra

# DialogMask_XmlFilesOnly
source: XML file (.xml)|*.xml|Rubberduck config file|*.config
cs: XML soubor (.xml)'|*.xml|Rubberduck config soubor|*.config
de: XML Datei (.xml)|*.xml|Rubberduck config file|*.config
fr: Fichiers XML (.xml)|*.xml|Configuration de Rubberduck|*.config
it: File XML (.xml)|*.xml|File di configurazione di Rubberduck|*.config

# DialogCaption_LoadAutocompletionSettings
source: Load Autocompletion Settings
cs: Načíst Nastavení Automatického Doplňování
de: Einstellungen der automatischen Vervollständigung laden
fr: Charger les paramètres d'autocomplétion
it: Carica Impostazioni di Completamento Automatico

# DialogCaption_SaveAutocompletionSettings
source: Save Autocompletion Settings
cs: Uložit Nastavení Automatického Doplňování
de: Einstellungen der automatischen Vervollständigung speichern
fr: Enregistrer les paramètres d'autocomplétion
it: Salva Impostazioni di Completamento Automatico

# PageHeader_ReferenceSettings
source: Reference Settings
cs: Nastavení Referencí
de: Referenzeinstellingen
fr: Références
it: Impostazioni dei Riferimenti

# PageInstructions_ReferenceSettings
source: Configure settings for adding and removing references.
cs: Nakonfigurovat nastavení pro přidávání a odstraňování referencí.
de: Einstellungen bzgl. des Hinzufügens und Entfernens von Referenzen verwalten.
fr: Configuration des paramètres pour ajouter et supprimer des références.
it: Configura le impostazioni per l'aggiunta e la rimozione dei riferimenti.

# HotKeys_Exclamation
source: Warning! No Modifier!
cs: Pozor! Chybí modifikátor!
de: Warnung! Kein Modifikator ausgewählt!
fr: Pas de modificateur?!
it: Attenzione! Nessun Modificatore!

# FilesHeader_IgnoredProjectsSettings
source: Ignored Files
cs: Ignorované Soubory
de: Ignorierte Dateien
fr: Fichiers ignorés
it: File Ignorati

# PageHeader_IgnoredProjectsSettings
source: Ignored Projects
cs: Ignorované Projekty
de: Ignorierte Projekte
fr: Projets Ignorés
it: Progetti ignorati
